AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PRMODE7</name>
              <description>Set the Precision Mode For Slot 7.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P12B0</name>
                  <description>12-bit precision mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12B1</name>
                  <description>12-bit precision mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10B</name>
                  <description>10-bit precision mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8B</name>
                  <description>8-bit precision mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>Select one of the 11 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE1</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE2</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE3</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE4</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE5</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE6</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE7</name>
                  <description>Single ended external GPIO connection.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP</name>
                  <description>Internal temperature sensor.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATT</name>
                  <description>Internal voltage divide-by-3 connection.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>Input VSS.</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN7</name>
              <description>This bit enables the window compare function for slot 7.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 7.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCDIS</name>
                  <description>Disable the window compare for slot 7.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN7</name>
              <description>This bit enables slot 7 for ADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 7 for ADC conversions.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLDIS</name>
                  <description>Disable slot 7 for ADC conversions.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WULIM</name>
          <description>Window Comparator Upper Limits</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>ULIM</name>
              <description>Sets the upper limit for the window comparator.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

