AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TIMERMAX</name>
              <description>Trigger counter count max, used as initial condition to trigger. Also used repeatedly each time counter reaches it to restart trigger timer at zero. To update this value, first disable the INTTRIGTIMER by setting TIMEREN to DIS, change TIMERMAX, and then reenable it INTTRIGTIMER by setting TIMEREN to EN again.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ZXCFG</name>
          <description>Zero Crossing Comparator Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>ZXCHANSEL</name>
              <description>Select which slots to use for zero crossing measurement.  0 enables zero crossing detection on slots 0 and 2.  1 enables zero crossing detection on slots 1 and 3.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ZXEN</name>
              <description>Enable the ZX comparator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ZXLIM</name>
          <description>Zero Crossing Comparator Limits</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>

          <fields>
            <field>
              <name>UZXC</name>
              <description>Sets the upper integer sample limit for the ZX comparator.  Note that these values are raw ADC values whose bounds are specified by PRMODE but not maniupulated by accumulate/divide logic.  Therefore, there is no oversampling and no binary point in this value.  Samples must enter the range between UZXC and LZXC in order for a zero crossing to be recognized.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LZXC</name>
              <description>Sets the lower integer sample limit for the ZX comparator.  Note that these values are raw ADC values whose bounds are specified by PRMODE but not maniupulated by accumulate/divide logic.  Therefore, there is no oversampling and no binary point in this value.  Samples must enter the range between UZXC and LZXC in order for a zero crossing to be recognized.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GAINCFG</name>
          <description>PGA Gain Configuration</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>UPDATEMODE</name>
              <description>PGA update mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMED</name>
                  <description>Immediate update mode.  Once gain is written, it is immediately encoded and provided to the PGA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZX</name>
                  <description>Update gain only at detected zero crossing as configured by ZX registers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGACTRLEN</name>
              <description>Enable PGA gain updates.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GAIN</name>
          <description>PGA Gain Codes</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F7F7F7F</resetMask>

          <fields>
            <field>
              <name>HGBDELTA</name>
              <description>Specifies the high gain code as an delta from the LGB field for channel B (slot 3).</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LGB</name>
              <description>Specifies the low gain code (0 to 102 decimal specifies -6.0 dB to 45.0 dB in half-dB increments) for channel B (slot 2).</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HGADELTA</name>
              <description>Specifies the high gain code as an delta from the LGA field for channel A (slot 1).</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LGA</name>
              <description>Specifies the low gain code (0 to 102 decimal specifies -6.0 dB to 45.0 dB in half-dB increments) for channel A (slot 0).</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

