AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SATCFG</name>
          <description>Saturation Comparator Configuration</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>SATCHANSEL</name>
              <description>Select which slots to use for saturation measurement.  0 enables saturation on slots 0 and 2.  1 enables saturation on slots 1 and 3.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SATEN</name>
              <description>Enable the saturation comparator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SATLIM</name>
          <description>Saturation Comparator Limits</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>

          <fields>
            <field>
              <name>USATC</name>
              <description>Sets the upper integer sample limit for the saturation comparator.  Note that these values are raw ADC values whose bounds are specified by PRMODE but not manipulated by accumulate/divide logic.  Therefore, there is no oversampling and no binary point in this value.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LSATC</name>
              <description>Sets the lower integer sample limit for the saturation comparator.  Note that these values are raw ADC values whose bounds are specified by PRMODE but not manipulated by accumulate/divide logic.  Therefore, there is no oversampling and no binary point in this value.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SATMAX</name>
          <description>Saturation Comparator Event Counter Limits</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>

          <fields>
            <field>
              <name>SATCBMAX</name>
              <description>Sets the number of saturation events that may occur before a SATCB interrupt occurs.  Once this interrupt occurs, the saturation event counter must be cleared by writing the SATCLR register.  A value of 0 is invalid and will cause the saturation interrupt to assert immediately.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SATCAMAX</name>
              <description>Sets the number of saturation events that may occur before a SATCA interrupt occurs.  Once this interrupt occurs, the saturation event counter must be cleared by writing the SATCLR register.  A value of 0 is invalid and will cause the saturation interrupt to assert immediately.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SATCLR</name>
          <description>Clears the saturation event counter registers</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>SATCBCLR</name>
              <description>Clear saturation event counter register for channel B (slots 2 or 3, depending on SATCHANSEL)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SATCACLR</name>
              <description>Clear saturation event counter register for channel A (slots 0 or 1, depending on SATCHANSEL)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>SATCB</name>
              <description>Saturation - Channel B (Slots 2 or 3)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATCBINT</name>
                  <description>Saturation, as specified by SAT configuration registers, occurred on either slot 2 or 3 (channel B)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSATCBINT</name>
                  <description>No-Saturation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SATCA</name>
              <description>Saturation - Channel A (Slots 0 or 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATCAINT</name>
                  <description>Saturation, as specified by SAT configuration registers, occurred on either slot 0 or 1 (channel A)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSATCAINT</name>
                  <description>No Saturation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXCB</name>
              <description>Zero Crossing - Channel B (Slots 2 or 3)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCBINT</name>
                  <description>Zero Crossing, as specified by ZX configuration registers, occurred on either slot 2 or 3 (channel B)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONZXCBINT</name>
                  <description>Non Zero Crossing</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXCA</name>
              <description>Zero Crossing - Channel A (Slots 0 or 1)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCAINT</name>
                  <description>Zero Crossing, as specified by ZX configuration registers, occurred on either slot 0 or 1 (channel A)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONZXCAINT</name>
                  <description>Non Zero Crossing</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODMAERROR</name>
                  <description>DMA Error Condition did not Occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAON</name>
                  <description>DMA completion is pending or not triggered.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparator voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCINCNOINT</name>
                  <description>Not a Window comparator voltage incursion interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparator voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCEXCNOINT</name>
                  <description>Not a Window comparator voltage excursion interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOFULLNOINT</name>
                  <description>Not a FIFO 100 percent full interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO75NOINT</name>
                  <description>Not FIFO 75 percent full interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCNCMPNOINT</name>
                  <description>No ADC scan complete interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNVCMPNOINT</name>
                  <description>No ADC conversion complete interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

