AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
          <fields>
            <field>
              <name>SATCB</name>
              <description>Saturation - Channel B (Slots 2 or 3)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATCBINT</name>
                  <description>Saturation, as specified by SAT configuration registers, occurred on either slot 2 or 3 (channel B)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSATCBINT</name>
                  <description>No-Saturation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SATCA</name>
              <description>Saturation - Channel A (Slots 0 or 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATCAINT</name>
                  <description>Saturation, as specified by SAT configuration registers, occurred on either slot 0 or 1 (channel A)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSATCAINT</name>
                  <description>No Saturation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXCB</name>
              <description>Zero Crossing - Channel B (Slots 2 or 3)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCBINT</name>
                  <description>Zero Crossing, as specified by ZX configuration registers, occurred on either slot 2 or 3 (channel B)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONZXCBINT</name>
                  <description>Non Zero Crossing</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXCA</name>
              <description>Zero Crossing - Channel A (Slots 0 or 1)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCAINT</name>
                  <description>Zero Crossing, as specified by ZX configuration registers, occurred on either slot 0 or 1 (channel A)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONZXCAINT</name>
                  <description>Non Zero Crossing</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODMAERROR</name>
                  <description>DMA Error Condition did not Occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAON</name>
                  <description>DMA completion is pending or not triggered.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparator voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCINCNOINT</name>
                  <description>Not a Window comparator voltage incursion interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparator voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCEXCNOINT</name>
                  <description>Not a Window comparator voltage excursion interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOFULLNOINT</name>
                  <description>Not a FIFO 100 percent full interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO75NOINT</name>
                  <description>Not FIFO 75 percent full interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCNCMPNOINT</name>
                  <description>No ADC scan complete interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNVCMPNOINT</name>
                  <description>No ADC conversion complete interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>SATCB</name>
              <description>Saturation - Channel B (Slots 2 or 3)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATCBINT</name>
                  <description>Saturation, as specified by SAT configuration registers, occurred on either slot 2 or 3 (channel B)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSATCBINT</name>
                  <description>No-Saturation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SATCA</name>
              <description>Saturation - Channel A (Slots 0 or 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SATCAINT</name>
                  <description>Saturation, as specified by SAT configuration registers, occurred on either slot 0 or 1 (channel A)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSATCAINT</name>
                  <description>No Saturation</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXCB</name>
              <description>Zero Crossing - Channel B (Slots 2 or 3)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCBINT</name>
                  <description>Zero Crossing, as specified by ZX configuration registers, occurred on either slot 2 or 3 (channel B)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONZXCBINT</name>
                  <description>Non Zero Crossing</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZXCA</name>
              <description>Zero Crossing - Channel A (Slots 0 or 1)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCAINT</name>
                  <description>Zero Crossing, as specified by ZX configuration registers, occurred on either slot 0 or 1 (channel A)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONZXCAINT</name>
                  <description>Non Zero Crossing</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODMAERROR</name>
                  <description>DMA Error Condition did not Occurred</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAON</name>
                  <description>DMA completion is pending or not triggered.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparator voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCINCNOINT</name>
                  <description>Not a Window comparator voltage incursion interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparator voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCEXCNOINT</name>
                  <description>Not a Window comparator voltage excursion interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOFULLNOINT</name>
                  <description>Not a FIFO 100 percent full interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO75NOINT</name>
                  <description>Not FIFO 75 percent full interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCNCMPNOINT</name>
                  <description>No ADC scan complete interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNVCMPNOINT</name>
                  <description>No ADC conversion complete interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

