AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DFIFO75</name>
              <description>Trigger DMA upon FIFO 75 percent Full</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATRIGSTAT</name>
          <description>DMA Trigger Status</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DFULLSTAT</name>
              <description>Triggered DMA from FIFO 100 percent Full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>D75STAT</name>
              <description>Triggered DMA from FIFO 75 percent Full</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>DMA Configuration</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000E0305</resetMask>

          <fields>
            <field>
              <name>NEXTDMAEN</name>
              <description>Next DMA Request Feature Enable. When set, SW shall not program TOTCOUNT and TARGADDR. Instead, SW shall program TOTCOUNTNEXT and TARGADDRNEXT, and load them into HW DMA request pipeline using DMAENNEXT bit.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPWROFF</name>
              <description>Power Off the ADC System upon DMACPL.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAMSK</name>
              <description>Mask the FIFOCNT and SLOTNUM when transferring FIFO contents to memory</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>FIFO Contents are copied directly to memory without modification.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Only the FIFODATA contents are copied to memory on DMA transfers. The SLOTNUM and FIFOCNT contents are cleared to zero.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADYNPRI</name>
              <description>Enables dynamic priority based on FIFO fullness. When FIFO is full, priority is automatically set to HIGH. Otherwise, DMAPRI is used.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable dynamic priority (use DMAPRI setting only)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable dynamic priority</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAPRI</name>
              <description>Sets the Priority of the DMA request</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADIR</name>
              <description>Direction</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P2M</name>
                  <description>Peripheral to Memory (SRAM) transaction</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2P</name>
                  <description>Memory to Peripheral transaction</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable DMA Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable DMA Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATOTCOUNT</name>
          <description>DMA Total Transfer Count</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFC</resetMask>

          <fields>
            <field>
              <name>TOTCOUNT</name>
              <description>Total Transfer Count</description>
              <bitRange>[17:2]</bitRange>
              <access>read-write</access>

