AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOSTAT</name>
          <description>This register contains status of the data FIFO.</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>FIFOCNT</name>
              <description>Number of valid entries in the ADC FIFO.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DATAOFFSET</name>
          <description>Sample offset value</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>OFFSET</name>
              <description>Add this signed offset to data before being written to the FIFO.  This enables the user to convert unsigned samples to signed or remove a DC offset on the samples.  Note that this does NOT affect the comparator limits, which still operate on original unsigned samples.</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ZXCFG</name>
          <description>Zero Crossing Comparator Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>ZXCHANSEL</name>
              <description>Select which slots to use for zero crossing measurement.  0 enables zero crossing detection on slots 0 and 2.  1 enables zero crossing detection on slots 1 and 3.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ZXEN</name>
              <description>Enable the ZX comparator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ZXLIM</name>
          <description>Zero Crossing Comparator Limits</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0FFF</resetMask>

          <fields>
            <field>
              <name>UZXC</name>
              <description>Sets the upper integer sample limit for the ZX comparator.  Note that these values are raw ADC values whose bounds are specified by PRMODE but not maniupulated by accumulate/divide logic.  Therefore, there is no oversampling and no binary point in this value.  Samples must enter the range between UZXC and LZXC in order for a zero crossing to be recognized.</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LZXC</name>
              <description>Sets the lower integer sample limit for the ZX comparator.  Note that these values are raw ADC values whose bounds are specified by PRMODE but not maniupulated by accumulate/divide logic.  Therefore, there is no oversampling and no binary point in this value.  Samples must enter the range between UZXC and LZXC in order for a zero crossing to be recognized.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GAINCFG</name>
          <description>PGA Gain Configuration</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>UPDATEMODE</name>
              <description>PGA update mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMED</name>
                  <description>Immediate update mode.  Once gain is written, it is immediately encoded and provided to the PGA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZX</name>
                  <description>Update gain only at detected zero crossing as configured by ZX registers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGACTRLEN</name>
              <description>Enable PGA gain updates.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GAIN</name>
          <description>PGA Gain Codes</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F7F7F7F</resetMask>

          <fields>
            <field>
              <name>HGBDELTA</name>
              <description>Specifies the high gain code as an delta from the LGB field for channel B (slot 3).</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>

