AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMA Status</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPL</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATIP</name>
              <description>DMA Transfer In Progress</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDRNEXT</name>
          <description>DMA Target Address</description>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TARGADDRNEXT</name>
              <description>Next DMA Target Address. This register is not updated with the current address of the DMA, but will remain static with the original address during the DMA transfer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATOTCOUNTNEXT</name>
          <description>Next DMA Total Count</description>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFC</resetMask>

          <fields>
            <field>
              <name>TOTCOUNTNEXT</name>
              <description>Next Total Transfer Count.</description>
              <bitRange>[17:2]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMAENNEXTCTRL</name>
          <description>Enable Next DMA Job</description>
          <addressOffset>0x0000029C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DMAENNEXT</name>
              <description>SW set this bit after setting up TOTCOUNTNEXT and TARGADDRNEXT register fields. HW will then auto-load TOTCOUNTNEXT and TARGADDRNEXT values when its current DMA job completes, and auto-clear this DMAENNEXT bit. SW can then reload a new DMA job with new TOTCOUNTNEXT and TARGADDRNEXT values.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>CLKGEN</name>
      <version>1.0</version>
      <description>Clock Generator</description>
      <!-- <groupName>GROUP_CLKGEN</groupName> -->
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000124</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CLKGEN</name>
        <description>CLKGEN_IRQ</description>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>OCTRL</name>
          <description>This register includes controls for autocalibration in addition to the RTC oscillator controls.</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000080</resetMask>

          <fields>
            <field>
              <name>OSEL</name>
              <description>Selects the RTC oscillator (1=LFRC, 0=XT)This selection bit and clocking the RTC with the external crystal (XT) are inoperable in silicon revisions A and B0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT_512Hz</name>
                  <description>RTC uses the XT 512Hz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_512Hz</name>
                  <description>RTC uses the LFRC 512Hz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUT</name>
          <description>This register enables the CLKOUT to the GPIOs, and selects the clock source to that.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000BF</resetMask>

          <fields>
            <field>
              <name>CKEN</name>
              <description>Enable the CLKOUT signal</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CLKOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CLKOUT</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKSEL</name>
              <description>Select the clock signal that will be observed on CLKOUT. For Apollo5b, the clock frequencies being observed are LFRC=1KHz, XT=32KHz, HFRC=48MHz, HFRC2=250MHz.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>LFRC clock source selection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2</name>
                  <description>XT / 2 clock source selection</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV4</name>
                  <description>XT / 4 clock source selection</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8</name>
                  <description>XT / 8 clock source selection</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV16</name>
                  <description>XT / 16 clock source selection</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV32</name>
                  <description>XT / 32 clock source selection</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_1Hz</name>
                  <description>1 Hz as selected in RTC</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2M</name>
                  <description>XT / 2^21 clock source selection</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT</name>
                  <description>XT clock source selection</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CG_100Hz</name>
                  <description>100 Hz as selected in CLKGEN</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2</name>
                  <description>LFRC / 2 clock source selection</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32</name>
                  <description>LFRC / 32 clock source selection</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV512</name>
                  <description>LFRC / 512 clock source selection</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32K</name>
                  <description>LFRC / 32768 clock source selection</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV256</name>
                  <description>XT / 256 clock source selection</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8K</name>
                  <description>XT / 8192 clock source selection</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV64K</name>
                  <description>XT / 2^16 clock source selection</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV16</name>
                  <description>Uncal LFRC / 16 clock source selection</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV128</name>
                  <description>Uncal LFRC / 128 clock source selection</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV1K</name>
                  <description>Uncal LFRC / 1024 clock source selection</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV4K</name>
                  <description>Uncal LFRC / 4096 clock source selection</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRC_DIV1M</name>
                  <description>Uncal LFRC / 2^20 clock source selection</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV1M</name>
                  <description>LFRC / 2^20 clock source selection</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTNE</name>
                  <description>XT (not autoenabled)</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTNE_DIV16</name>
                  <description>XT / 16 (not autoenabled)</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCNE_DIV32</name>
                  <description>LFRC / 32 (not autoenabled)</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCNE</name>
                  <description>LFRC (not autoenabled) - Default for undefined values</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_DIV64</name>
                  <description>HFRC2 / 64 clock source selection</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_DIV32</name>
                  <description>HFRC2 / 32 clock source selection</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_DIV16</name>
                  <description>HFRC2 / 16 clock source selection</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_DIV8</name>
                  <description>HFRC2 / 8 clock source selection</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_DIV2</name>
                  <description>HFRC2 / 2 clock source selection</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2</name>
                  <description>HFRC2 clock source selection</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFADJ</name>
          <description>This register controls the HFRC adjustment. The HFRC clock can change with temperature and process corners, and this register controls the HFRC adjustment logic which reduces the fluctuations to the clock.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0025B800</resetValue>
          <resetMask>0x1FFFFF0F</resetMask>

          <fields>
            <field>
              <name>HFADJMAXDELTA</name>
              <description>Maximum delta for HF Adjustments. 0=Disabled, 1-31=maximum delta step</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Maximum Delta function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Maximum Delta function is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFADJGAIN</name>
              <description>Gain control for HFRC adjustment</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Gain_of_1</name>
                  <description>HF Adjust with Gain of 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_2</name>
                  <description>HF Adjust with Gain of 0.5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_4</name>
                  <description>HF Adjust with Gain of 0.25</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_8</name>
                  <description>HF Adjust with Gain of 0.125</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_16</name>
                  <description>HF Adjust with Gain of 0.0625</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_32</name>
                  <description>HF Adjust with Gain of 0.03125</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFWARMUP</name>
              <description>XT warmup period for HFRC adjustment</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1SEC</name>
                  <description>Autoadjust XT warmup period = 1-2 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SEC</name>
                  <description>Autoadjust XT warmup period = 2-4 seconds</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTADJ</name>
              <description>Target HFRC adjustment value.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

