AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>HFADJCK</name>
              <description>Repeat period for HFRC adjustment</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4SEC</name>
                  <description>Autoadjust repeat period = 4 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16SEC</name>
                  <description>Autoadjust repeat period = 16 seconds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SEC</name>
                  <description>Autoadjust repeat period = 32 seconds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64SEC</name>
                  <description>Autoadjust repeat period = 64 seconds</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128SEC</name>
                  <description>Autoadjust repeat period = 128 seconds</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SEC</name>
                  <description>Autoadjust repeat period = 256 seconds</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512SEC</name>
                  <description>Autoadjust repeat period = 512 seconds</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024SEC</name>
                  <description>Autoadjust repeat period = 1024 seconds</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFADJEN</name>
              <description>HFRC adjustment control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the HFRC adjustment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the HFRC adjustment</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKENSTAT</name>
          <description>This register provides the enable status to all the peripheral clocks.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF000000</resetMask>

          <fields>
            <field>
              <name>HFRC2CLKEN</name>
              <description>HFRC2 oscillator clock is on</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRCCLKEN</name>
              <description>HFRC oscillator clock is on</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALCLKOUTEN</name>
              <description>XTAL output clock is on</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OSEL</name>
              <description>RTC uses XT or LFRC</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFADJEN</name>
              <description>HFADJ circuit is enabled</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PHFRCCLKEN</name>
              <description>At least one peripheral clock relying on HFRC is on</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PXTALCLKEN</name>
              <description>At least one peripheral clock relying on XTAL is on</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRC2READY</name>
              <description>HFRC2 clock is ready (goes high approx 5us after HFRC2 is powered up)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN2STAT</name>
          <description>This is a continuation of the clock enable status.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IOM0CLKEN</name>
              <description>IOM 0 clock is on</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GFXCLKEN</name>
              <description>GFX core clock is on</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

