AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DSPPDMCLKEN</name>
              <description>DSP PDM clock is on</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSPI2S1REFCLKEN</name>
              <description>DSP I2S1 reference clock is on</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSPI2S1CLKEN</name>
              <description>DSP I2S1 clock is on</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSPI2S0REFCLKEN</name>
              <description>DISP I2S0 reference clock is on</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSPI2S0CLKEN</name>
              <description>DISP I2S0 clock is on</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPHYPLLCLKEN</name>
              <description>DPHY PLL clock is on</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISPCLKEN</name>
              <description>DISP clock is on</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCCLKEN</name>
              <description>AUD ADC clock is on</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBUSBCLKEN</name>
              <description>APB clock is on in the USB power domain</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBSDIO1CLKEN</name>
              <description>APB clock is on in the SDIO1 power domain</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBSDIO0CLKEN</name>
              <description>APB clock is on in the SDOI0 power domain</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBMSPI3CLKEN</name>
              <description>APB clock is on in the MSPI3 power domain</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBMSPI2CLKEN</name>
              <description>APB clock is on in the MSPI2 power domain</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBMSPI1CLKEN</name>
              <description>APB clock is on in the MSPI1 power domain</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBMSPI0CLKEN</name>
              <description>APB clock is on in the MSPI0 power domain</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBIOSCLKEN</name>
              <description>APB clock is on in the IOS power domain</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBHCPCCLKEN</name>
              <description>APB clock is on in the HCP C power domain</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBHCPBCLKEN</name>
              <description>APB clock is on in the HCP B power domain</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBHCPACLKEN</name>
              <description>APB clock is on in the HCP A power domain</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBGFXCLKEN</name>
              <description>APB clock is on in the GFX power domain</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBDISPPHYCLKEN</name>
              <description>APB clock is on in the DISP PHY power domain</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBDISPCLKEN</name>
              <description>APB clock is on in the DISP power domain</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCRYPTOCLKEN</name>
              <description>APB clock is on in the Crypto power domain</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBAUDCLKEN</name>
              <description>APB clock is on in the AUD power domain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBAPBCLKEN</name>
              <description>APB clock is on in the APB power domain</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

