AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>APBAOLCLKEN</name>
              <description>APB clock is on in the AOL power domain</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBAOHCLKEN</name>
              <description>APB clock is on in the AOH power domain</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBACTIVITYCLKEN</name>
              <description>APB clock is on in the Activity power domain</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCCLKEN</name>
              <description>ADC clock is on</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRACECLKEN</name>
              <description>Trace clock is on</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN3STAT</name>
          <description>This is a continuation of the clock enable status.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>XTALENABLED</name>
              <description>XTAL oscillator enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_disabled</name>
                  <description>XTAL is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_enabled</name>
                  <description>XTAL is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCLKEN</name>
              <description>WDT clock is on</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBREFCLKEN</name>
              <description>USB reference clock is on</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UART3CLKEN</name>
              <description>UART 3 clock is on</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UART2CLKEN</name>
              <description>UART 2 clock is on</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UART1CLKEN</name>
              <description>UART 1 clock is on</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UART0CLKEN</name>
              <description>UART 0 clock is on</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1CLKEN</name>
              <description>SDIO 1 clock is on</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0CLKEN</name>
              <description>SDIO 0 clock is on</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTCCLKEN</name>
              <description>Real Time Clock clock is on</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSTGENPOSCLKEN</name>
              <description>Reset generator POR clock is on</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSTGENCLKEN</name>
              <description>Reset generator POR clock is on</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OTPXTLCLKEN</name>
              <description>OTP XTL clock is on</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MSPI3CLKEN</name>
              <description>MSPI 3 clock is on</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MSPI2CLKEN</name>
              <description>MSPI 2 clock is on</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MSPI1CLKEN</name>
              <description>MSPI 1 clock is on</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MSPI0CLKEN</name>
              <description>MSPI 0 clock is on</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOM7CLKEN</name>
              <description>IOM 7 clock is on</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

