AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>IOM6CLKEN</name>
              <description>IOM 6 clock is on</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOM5CLKEN</name>
              <description>IOM 5 clock is on</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOM4CLKEN</name>
              <description>IOM 4 clock is on</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOM3CLKEN</name>
              <description>IOM 3 clock is on</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOM2CLKEN</name>
              <description>IOM 2 clock is on</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOM1CLKEN</name>
              <description>IOM 1 clock is on</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>This register controls a 'safe' mode for burst, which disables the clock when burst transition is happening. It also includes a register to force the HFRC during deep sleep. It is mainly used for debug and testing.</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x08000000</resetValue>
          <resetMask>0x03FFFFE3</resetMask>

          <fields>
            <field>
              <name>CLKGENMISCSPARE</name>
              <description>Spare/Unused Chicken Bit</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRC96TRUNKGATE</name>
              <description>DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0, will kill HFRC root clock.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HFRC96_TRUNK_GATE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0, will kill HFRC root clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFRCFUNCCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on HFRC_FUNC_CLK</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETMTRACECLKCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on ETM TRACE CLK</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBDMACPUCLKCLKGATEEN</name>
              <description>Clock gate enable for APB DMA clock</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCEON</name>
                  <description>APB DMA clock is forced ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOFORCE</name>
                  <description>APB DMA clock is controlled by APB DMA CPU logic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GFXAXICLKCLKGATEEN</name>
              <description>Clock gate enable for GFX AXI clock</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCEON</name>
                  <description>GFX AXI clock is forced ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOFORCE</name>
                  <description>GFX AXI clock is controlled by GFX logic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GFXCLKCLKGATEEN</name>
              <description>Clock gate enable for GFX clock</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCEON</name>
                  <description>GFX clock is forced ON</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOFORCE</name>
                  <description>GFX clock is controlled by GFX logic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM4DAXICLKGATEEN</name>
              <description>Unused (CLKGENMISCSPARES[0])</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

