AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>HF2ADJXTHSMUXSEL</name>
              <description>Clock select for HF2ADJ: 0=XTHS 1=EXTREF</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HF2ADJCNTINOFFSET</name>
              <description>Counter input offset</description>
              <bitRange>[28:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HF2ADJFASTSTRDLY</name>
              <description>Fast_start_delay value setting</description>
              <bitRange>[14:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HF2ADJFASTSTREN</name>
              <description>Fast_start_delay control</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Fast_start_delay disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Fast_start_delay enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HF2ADJEN</name>
              <description>HF2ADJ control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>HF2ADJ disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>HF2ADJ enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HF2ADJ1</name>
          <description>This register controls hf2adj trimming enable and trimming offset.</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x00003FFF</resetMask>

          <fields>
            <field>
              <name>HF2ADJTRIMOFFSET</name>
              <description>HF2ADJ trimming offset. (signed number)</description>
              <bitRange>[13:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HF2ADJTRIMEN</name>
              <description>HF2ADJ output selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIM_EN0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN1</name>
                  <description>HF2ADJTRIMOUT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN2</name>
                  <description>HF2ADJTRIMOFFSET</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN3</name>
                  <description>HF2ADJTRIMOUT + HF2ADJTRIMOFFSET</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN4</name>
                  <description>HF2TUNE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN5</name>
                  <description>HF2ADJTRIMOUT + HF2TUNE</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN6</name>
                  <description>HF2ADJTRIMOFFSET + HF2TUNE</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIM_EN7</name>
                  <description>HF2ADJTRIMOUT + HF2ADJTRIMOFFSET + HF2TUNE</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HF2ADJ2</name>
          <description>This register controls xtal32m divider ratio and HF2ADJ ration setting.</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00189376</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

          <fields>
            <field>
              <name>HF2ADJRATIO</name>
              <description>HF2ADJ ratio setting.</description>
              <bitRange>[30:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HF2ADJXTALDIVRATIO</name>
              <description>XTAL32MHz divider ratio for HF2ADJ.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL32M</name>
                  <description>XTAL32MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32M_DIV2</name>
                  <description>XTAL32MHz / 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32M_DIV4</name>
                  <description>XTAL32MHz / 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32M_DIV8</name>
                  <description>XTAL32MHz / 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HF2VAL</name>
          <description>This register provides the read back of the HF2TUNE</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>HF2ADJTRIMOUT</name>
              <description>HF2ADJ trimming output</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

