AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LFRCCTRL</name>
          <description>LFRC control</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>LFRCPWD</name>
              <description>Power down LFRC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LFRCOUT</name>
              <description>Disable LFRC output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DISPCLKCTRL</name>
          <description>Provides ability to select the PLL reference clock, and derivative of the display clock</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>DBICLKDIV2EN</name>
              <description>Enable for DBI CLK divider, 0x1: DBICLK/2, 0x0: bypass</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBICLKSEL</name>
              <description>selection for DBI_CLK</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBIB_CLK</name>
                  <description>DBIB_CLK from Display Controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORMAT_CLK</name>
                  <description>format_clk from Display Controller</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_CLK</name>
                  <description>pll_clk from DPHY</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCLKEN</name>
              <description>Enable for the PLL clock through clkgen</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISPCLKSEL</name>
              <description>Selection for PLL reference clock.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Static value of 0 selected for DPHY clock input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC12</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC24</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC48</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC96</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC192</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPHYPLL</name>
                  <description>DPHY PLL</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLCLKEN</name>
              <description>Enable for the PLL clock through clkgen</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PLLCLKSEL</name>
              <description>Selection for PLL reference clock.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Static value of 0 selected for DPHY clock input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHz</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS</name>
                  <description>High Frequency XTAL input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS_div2</name>
                  <description>High Frequency XTAL input divide by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFCLK</name>
                  <description>External reference clock input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFCLK_div2</name>
                  <description>External reference clock input divide by 2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKGENSPARES</name>
          <description>CLKGEN Spare Regs</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLKGENSPARES</name>
              <description>Placeholer spare registes that can be used as needed for future use</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

