AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HFRCIDLECOUNTERS</name>
          <description>Provides SW controlled # idle cycles before powering down HFRC, HFRC2., core clock enable(s)</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04050405</resetValue>
          <resetMask>0xBF3F3F3F</resetMask>

          <fields>
            <field>
              <name>UPDATEENABLE</name>
              <description>usage : Clear UPDATEENABLE or 1'b0; Update other bits fields of this register. Set this register to 1'b1 for HW to update.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRC2CLKREQDELAY</name>
              <description>Enable for the PLL clock through clkgen</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRC2PWRDOWNDELAY</name>
              <description>Idle counter for HFRC2 POWER DOWN DELAY</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRCCLKREQDELAY</name>
              <description>Idle counter for HFRC CLK REQ DELAY</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRCPWRDOWNDELAY</name>
              <description>Idle counter for HFRC POWER DOWN DELAY</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MSPIIOCLKCTRL</name>
          <description>Provides ability to select the MSPI clock, and derivative of the MSPI clock</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000A4214</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>MSPI3IOCLKSEL</name>
              <description>selection for MSPI3 io clock</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_750KHz</name>
                  <description>750KHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_1p5MHz</name>
                  <description>1.5MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_3MHz</name>
                  <description>3MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHz</name>
                  <description>6MHz sourced from the HFRC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHz</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>125MHz sourced from the HFRC2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>250MHz sourced from the HFRC2</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI3IOCLKEN</name>
              <description>Enable for the MSPI3 io clock through clkgen</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable io clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable io clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI2IOCLKSEL</name>
              <description>selection for MSPI2 io clock</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_750KHz</name>
                  <description>750KHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_1p5MHz</name>
                  <description>1.5MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_3MHz</name>
                  <description>3MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHz</name>
                  <description>6MHz sourced from the HFRC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHz</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>125MHz sourced from the HFRC2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>250MHz sourced from the HFRC2</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI2IOCLKEN</name>
              <description>Enable for the MSPI2 io clock through clkgen</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable io clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable io clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI1IOCLKSEL</name>
              <description>selection for MSPI1 io clock</description>
              <bitRange>[9:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_750KHz</name>
                  <description>750KHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_1p5MHz</name>
                  <description>1.5MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_3MHz</name>
                  <description>3MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHz</name>
                  <description>6MHz sourced from the HFRC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHz</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>125MHz sourced from the HFRC2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>250MHz sourced from the HFRC2</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI1IOCLKEN</name>
              <description>Enable for the MSPI1 io clock through clkgen</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable io clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable io clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI0IOCLKSEL</name>
              <description>selection for MSPI0 io clock</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_750KHz</name>
                  <description>750KHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_1p5MHz</name>
                  <description>1.5MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_3MHz</name>
                  <description>3MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHz</name>
                  <description>6MHz sourced from the HFRC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHz</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>125MHz sourced from the HFRC2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>250MHz sourced from the HFRC2</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI0IOCLKEN</name>
              <description>Enable for the MSPI0 io clock through clkgen</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable io clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable io clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Provides ability to select and enable/force the GFX and MCU clocks</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>DISPCTRLCLKEN</name>
              <description>Enable the 96MHz display controller clock</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Display controller clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Display controller clock enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCUCLKFORCEON</name>
              <description>Force the MCU clock to be always on (unused)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Force MCU clock on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWICCLKFORCEON</name>
              <description>Force the IWIC clock to be always on (unused)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal operaration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Force IWIC clock on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGCLKFORCEON</name>
              <description>Force the DBG clock to be always on (unused)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal operaration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Force DBG clock on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUCLKFORCEON</name>
              <description>Force the PMU clock to be always on (unused)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal operaration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Force PMU clock on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCLKFORCEON</name>
              <description>Force the ST clock to be always on</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal operaration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Force ST clock on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GFXCORECLKSEL</name>
              <description>selection for GFX CORE clock</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>125MHz sourced from the HFRC2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>250MHz sourced from the HFRC2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GFXCORECLKEN</name>
              <description>Enable for the GFX CORE clock through clkgen</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable GFX clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable GFX clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
