AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>CRYPTO</name>
      <version>1.0</version>
      <description>Embedded security and cryptographic services</description>
      <!-- <groupName>GROUP_CRYPTO</groupName> -->
      <baseAddress>0x400C0000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00001F30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRYPTOSEC</name>
        <description>CRYPTOSEC_IRQ</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>MEMORYMAP0</name>
          <description>This register maps the virtual register R0 to a physical address in memory.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP0</name>
              <description>Contains the physical address in memory to map the R0 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP1</name>
          <description>This register maps the virtual register R1 to a physical address in memory.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP1</name>
              <description>Contains the physical address in memory to map the R1 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP2</name>
          <description>This register maps the virtual register R2 to a physical address in memory.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP2</name>
              <description>Contains the physical address in memory to map the R2 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP3</name>
          <description>This register maps the virtual register R3 to a physical address in memory.</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP3</name>
              <description>Contains the physical address in memory to map the R3 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP4</name>
          <description>This register maps the virtual register R4 to a physical address in memory.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP4</name>
              <description>Contains the physical address in memory to map the R4 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP5</name>
          <description>This register maps the virtual register R5 to a physical address in memory.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP5</name>
              <description>Contains the physical address in memory to map the R5 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP6</name>
          <description>This register maps the virtual register R6 to a physical address in memory.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP6</name>
              <description>Contains the physical address in memory to map the R6 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP7</name>
          <description>This register maps the virtual register R7 to a physical address in memory.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP7</name>
              <description>Contains the physical address in memory to map the R7 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

