AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP17</name>
          <description>This register maps the virtual register R17 to a physical address in memory.</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP17</name>
              <description>Contains the physical address in memory to map the R17 registero.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP18</name>
          <description>This register maps the virtual register R18 to a physical address in memory.</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP18</name>
              <description>Contains the physical address in memory to map the R18 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP19</name>
          <description>This register maps the virtual register R19 to a physical address in memory.</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP19</name>
              <description>Contains the physical address in memory to map the R19 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP20</name>
          <description>This register maps the virtual register R20 to a physical address in memory.</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP20</name>
              <description>Contains the physical address in memory to map the R20 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP21</name>
          <description>This register maps the virtual register R21 to a physical address in memory.</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP21</name>
              <description>Contains the physical address in memory to map the R21 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP22</name>
          <description>This register maps the virtual register R22 to a physical address in memory.</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP22</name>
              <description>Contains the physical address in memory to map the R22 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP23</name>
          <description>This register maps the virtual register R23 to a physical address in memory.</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP23</name>
              <description>Contains the physical address in memory to map the R23 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP24</name>
          <description>This register maps the virtual register R24 to a physical address in memory.</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP24</name>
              <description>Contains the physical address in memory to map the R24 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP25</name>
          <description>This register maps the virtual register R25 to a physical address in memory.</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP25</name>
              <description>Contains the physical address in memory to map the R25 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

