AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>FINALUPDATEDONE</name>
              <description>0x1 indicates completion of final update algorithm.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INSTANTIATIONDONE</name>
              <description>0x1 indicates completion of instantiation algorithm with no errors.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEEDINGDONE</name>
              <description>0x1 indicates completion of reseeding algorithm with no errors.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGDMADONE</name>
              <description>0x1 indicates RNG DMA to SRAM is completed.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VNERR</name>
              <description>0x1 indicates Von Neumann error. Error in von Neumann occurs if 32 consecutive collected bits are identical, ZERO, or ONE.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CRNGTERR</name>
              <description>0x1 indicates CRNGT in the TRNG test failed. Failure occurs when two consecutive blocks of 16 collected bits are equal.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCORRERR</name>
              <description>0x1 indicates Autocorrelation test failed four times in a row. When it set ,TRNG ceases to function until next reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EHRVALID</name>
              <description>0x1 indicates that 192 bits have been collected in the TRNG and are ready to be read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGICR</name>
          <description>Interrupt_status bit clear Register. Consists of trng_icr and prng_icr bit[15-0] - TRNG bit[31-16] - PRNG</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF003F</resetMask>

          <fields>
            <field>
              <name>WHICHKATERR</name>
              <description>Cannot be cleared by SW! Only RNG reset clears this bit.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>KATERR</name>
              <description>Cannot be cleared by SW! Only RNG reset clears this bit.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REQSIZE</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRNGCRNGTERR</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEEDCNTRTOP40</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEEDCNTRFULL</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTPUTREADY</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FINALUPDATEDONE</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INSTANTIATIONDONE</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEEDINGDONE</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGDMADONE</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGWATCHDOG</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VNERR</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

