AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>RNGDMAENABLE</name>
          <description>Writing to this register enables_disables the RNG DMA.</description>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Writing value 0x1 enables RNG DMA to SRAM. The Value is cleared when DMA completes its operation.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGDMASRCMASK</name>
          <description>This register defines which ring-oscillator length should be used when using the RNG DMA.</description>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>ENSRCSEL3</name>
              <description>Writing value 0x1 enables SRC_SEL 3.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENSRCSEL2</name>
              <description>Writing value 0x1 enables SRC_SEL 2.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENSRCSEL1</name>
              <description>Writing value 0x1 enables SRC_SEL 1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENSRCSEL0</name>
              <description>Writing value 0x1 enables SRC_SEL 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGDMASRAMADDR</name>
          <description>This register defines the start address of the DMA for the TRNG data.</description>
          <addressOffset>0x000001D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>RNGSRAMDMAADDR</name>
              <description>Defines the start address of the DMA for the TRNG data.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGWATCHDOGVAL</name>
          <description>This register defines the number of 192-bits samples that the DMA collects per RNG configuration.bitfield 7:0  RNG_SAMPLES_NUM rw 0x0 Defines the number of 192-bits samples that the DMA collects per RNG configuration.bitfield 31:8  RESERVED rw 0x0 RESERVEDThis register defines the maximum number of clock cycles per TRNG collection of 192 samples. If the number of cycles for a collection exceeds this threshold, TRNG signals an interrupt.</description>
          <addressOffset>0x000001D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RNGWATCHDOGVAL</name>
              <description>Defines the maximum number of clock cycles per TRNG collection of 192 samples. If the number of cycles for a collection exceeds this threshold, TRNG signals an interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGDMASTATUS</name>
          <description>This register holds the RNG DMA status.</description>
          <addressOffset>0x000001DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>NUMOFSAMPLES</name>
              <description>Number of samples already collected in the current ring oscillator chain length.</description>
              <bitRange>[10:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMASRCSEL</name>
              <description>The active ring oscillator length using by DMA</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGDMABUSY</name>
              <description>Indicates whether DMA is busy.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHACONTROLREG</name>
          <description>CHACHA general configuration.</description>
          <addressOffset>0x00000380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000063F</resetMask>

          <fields>
            <field>
              <name>USEIV96BIT</name>
              <description>If use 96bit IV</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESETBLOCKCNT</name>
              <description>For new message</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

