AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY3</name>
          <description>bits159:128 of CHACHA Key</description>
          <addressOffset>0x00000394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY3</name>
              <description>bits 159:128 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY4</name>
          <description>bits 127:96 of CHACHA Key</description>
          <addressOffset>0x00000398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY4</name>
              <description>bits 127:96 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY5</name>
          <description>bits 95:64 of CHACHA Key</description>
          <addressOffset>0x0000039C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY5</name>
              <description>bits 95:64 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY6</name>
          <description>bits 63:32 of CHACHA Key</description>
          <addressOffset>0x000003A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY6</name>
              <description>bits 63:32 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY7</name>
          <description>bits 31:0 of CHACHA Key</description>
          <addressOffset>0x000003A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY7</name>
              <description>bits 31:0 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAIV0</name>
          <description>bits 31:0 of CHACHA_IV0 register</description>
          <addressOffset>0x000003A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAIV0</name>
              <description>bits 31:0 of CHACHA_IV0 register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAIV1</name>
          <description>bits 31:0 of CHACHA_IV1 register</description>
          <addressOffset>0x000003AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAIV1</name>
              <description>bits 31:0 of CHACHA_IV1 register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHABUSY</name>
          <description>This register is set when the CHACHA_SALSA core is active</description>
          <addressOffset>0x000003B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CHACHABUSY</name>
              <description>CHACHA_BUSY Register. This register is set when the CHACHA_SALSA core is active.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAHWFLAGS</name>
          <description>This register holds the pre-synthesis HW flag configuration of the CHACHA_SALSA engine</description>
          <addressOffset>0x000003B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>FASTCHACHA</name>
              <description>If this flag is set, the next matrix calculated when the current one is written to data output path (same flag for Salsa core):</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SALSAEXISTS</name>
              <description>If this flag is set, the Salsa_ChaCha engine include Salsa implementation:</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHAEXISTS</name>
              <description>If this flag is set, the Salsa_ChaCha engine include ChaCha implementation:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHABLOCKCNTLSB</name>
          <description>The two first words (n) in the last row of the cipher matrix are the block counter. At the end of each block (512b), the block_cnt for the next block is written by HW to the block_cnt_lsb and block_cnt_msb registers. Need reset block counter , if start new message.</description>
          <addressOffset>0x000003B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHABLOCKCNTLSB</name>
              <description>bits 31:0 of CHACHA_BLOCK_CNT_LSB register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

