AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>AESTUNNELISON</name>
              <description>This field determines whether the AES performs dual-tunnel operations or standard non-tunneling operations:</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STD_NONTUNNEL</name>
                  <description>standard non-tunneling operations</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNNEL</name>
                  <description>tunneling operations.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBCISESSIV</name>
              <description>If MODE_KEY0 is set to 3b001 (CBC), and this field is set - the mode is CBC with ESSIV.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MODEKEY1</name>
              <description>This field determines the AES mode of the second stage operation in tunneling operations:</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB modekey1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC modekey1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR modekey1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC_MAC</name>
                  <description>CBC MAC modekey1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XEX_XTS</name>
                  <description>XEX_XTS modekey1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCBC_MAC</name>
                  <description>XCBC MAC modekey1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>OFB modekey1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMAC</name>
                  <description>CMAC modekey1</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODEKEY0</name>
              <description>This field determines the AES mode in non tunneling operations, and the AES mode of the first stage in tunneling operations:</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB modekey0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC modekey0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR modekey0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCMAC</name>
                  <description>CBCMAC modekey0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XEX_XTS</name>
                  <description>XEX XTS modekey0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCBC_MAC</name>
                  <description>XCBC MAC modekey0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>OFB modekey0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMAC</name>
                  <description>CMAC modekey0</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE0ISCBCCTS</name>
              <description>If MODE_KEY0 is set to 3b001 (CBC), and this field is set - the mode is CBC-CTS. In addition, If MODE_KEY0 is set to 3b010 (CTR), and this field is set - the mode is GCTR.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DECKEY0</name>
              <description>This field determines whether the AES performs Decrypt_Encrypt operations, in non-tunneling operations:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENCRYPT</name>
                  <description>Encrypt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECRYPT</name>
                  <description>Decrypt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AESHWFLAGS</name>
          <description>This register holds the pre-synthesis HW flag configuration of the AES engine</description>
          <addressOffset>0x000004C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001D0B</resetValue>
          <resetMask>0x00001F3F</resetMask>

          <fields>
            <field>
              <name>DFACNTRMSREXIST</name>
              <description>the DFA_CNTRMSR_EXIST flag</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

