AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HASHPADCFG</name>
          <description>This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x000007C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000004</resetMask>

          <fields>
            <field>
              <name>DOPAD</name>
              <description>Enable Padding generation. must be reset upon completion of padding.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHCURLEN0</name>
          <description>This register holds the length of current hash operation bit 31:0.</description>
          <addressOffset>0x000007CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>Length</name>
              <description>Represent the current length of valid bits where digest need to be computed In Bytes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHCURLEN1</name>
          <description>This register holds the length of current hash operation bit 63:32.</description>
          <addressOffset>0x000007D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>Length</name>
              <description>Represent the current length of valid bits where digest need to be computed In Bytes.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHPARAM</name>
          <description>HASH_PARAM Register.</description>
          <addressOffset>0x000007DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00012001</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DUMPHASHTODOUTEXISTS</name>
              <description>Indicate if HASH to dout is present in the design</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HASHCOMPAREEXISTS</name>
              <description>Indicate if COMPARE digest logic is present in the design</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHA256EXISTS</name>
              <description>Indicate if SHA-256 is present in the design</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HMACEXISTS</name>
              <description>Indicate if HMAC logic is present in the design</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MD5EXISTS</name>
              <description>Indicate if MD5 is present in HW</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PADEXISTS</name>
              <description>Indicate if pad block is present in the design. 0 - pad function is not supported by hardware. 1 - pad function is supported by hardware.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHA512EXISTS</name>
              <description>Indicate if SHA-512 is present in the design. By default SHA-1 and SHA-256 are present. 0 - SHA-1 and SHA-256 are present only 1 - SHA-1 and all SHA-2 are present (SHA-256 SHA-512).</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DW</name>
              <description>Determine the granularity of word size. 0 - 32 bit word data. 1 - 64 bit word data.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CH</name>
              <description>Indicate if Hi adders are present for each Hi value or 1 adder is shared for all Hi. 0 - One Hi value is updated at a time 1 - All Hi values are updated at the same time.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CW</name>
              <description>Indicates the number of concurrent words the hash is using to compute signature. 1 - One concurrent w(t). 2 - Two concurrent w(t).</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHAESSWRESET</name>
          <description>Software reset of the AES.</description>
          <addressOffset>0x000007E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HASHAESSWRESET</name>
              <description>Hash receive reset internally.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

