AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HASHENDIANESS</name>
          <description>This register holds the HASH_ENDIANESS configuration.</description>
          <addressOffset>0x000007E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ENDIAN</name>
              <description>The default value is little-endian. The data and generation of padding can be swapped to be big-endian.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCLKENABLE</name>
          <description>This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the AES clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_E</name>
                  <description>the AES clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_D</name>
                  <description>the AES clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHCLKENABLE</name>
          <description>The HASH clock enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the hash clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_E</name>
                  <description>the HASH clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH_D</name>
                  <description>the HASH clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PKACLKENABLE</name>
          <description>The PKA clock enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x0000081C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the PKA clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKA_E</name>
                  <description>the PKA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKA_D</name>
                  <description>the PKA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACLKENABLE</name>
          <description>DMA_CLK enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the DMA clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_E</name>
                  <description>the DMA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_D</name>
                  <description>the DMA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATUS</name>
          <description>The CryptoCell clocks status register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000824</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000018D</resetMask>

          <fields>
            <field>
              <name>DMACLKSTATUS</name>
              <description>Status of DMA clock enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_E</name>
                  <description>the DMA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_D</name>
                  <description>the DMA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHACLKSTATUS</name>
              <description>Status of CHACHA clock enable.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHACHA_E</name>
                  <description>the CHACHA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHACHA_D</name>
                  <description>the CHACHA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKACLKSTATUS</name>
              <description>Status of PKA clock enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKA_E</name>
                  <description>the PKA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKA_D</name>
                  <description>the PKA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASHCLKSTATUS</name>
              <description>Status of HASH clock clock enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_E</name>
                  <description>the HASH clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH_D</name>
                  <description>the HASH clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESCLKSTATUS</name>
              <description>Status of AES clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_E</name>
                  <description>the AES clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_D</name>
                  <description>the AES clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHACLKENABLE</name>
          <description>CHACHA _SALSA clock enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000858</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the CHACHA SALSA clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHACHA_E</name>
                  <description>the CHACHA SALSA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHACHA_D</name>
                  <description>the CHACHA SALSA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTOCTL</name>
          <description>Defines the cryptographic flow.</description>
          <addressOffset>0x00000900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xBEEFBEEF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>standard</name>
              <description>This field is reserved, do not modify.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>

