AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MODE</name>
              <description>Determines the active cryptographic engine:</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>aes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_TO_HASH</name>
                  <description>aes to hash</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_AND_HASH</name>
                  <description>aes and hash</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES</name>
                  <description>des</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES_TO_HASH</name>
                  <description>des to hash</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES_AND_HASH</name>
                  <description>des and hash</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH</name>
                  <description>hash</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_MAC_AND_BYPASS</name>
                  <description>aes mac and bypass</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_TO_HASH_AND_DOUT</name>
                  <description>aes to hash and _dout</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED1</name>
                  <description>reserved1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED2</name>
                  <description>reserved2</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTOBUSY</name>
          <description>This register is set when the cryptographic core is busy.</description>
          <addressOffset>0x00000910</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CRYPTOBUSY</name>
              <description>Crypto busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHBUSY</name>
          <description>This register is set when the Hash engine is busy.</description>
          <addressOffset>0x0000091C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HASHBUSY</name>
              <description>Hash busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTEXTID</name>
          <description>A general RD_WR register. For Firmware use.</description>
          <addressOffset>0x00000930</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CONTEXTID</name>
              <description>Context ID</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHSUBKEY00</name>
          <description>Bits 31:0 of GHASH Key0 (used as the GHASH module key).</description>
          <addressOffset>0x00000960</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHSUBKEY00</name>
              <description>Bits 31:0 of GHASH Key0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

