AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RNGINTCLEAR</name>
              <description>The RNG interrupt clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKAEXPCLEAR</name>
              <description>The PKA end of operation interrupt clear.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AXIERRCLEAR</name>
              <description>The AXI error interrupt clear.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTTOMEMCLEAR</name>
              <description>The DOUT to memory DMA done interrupt clear.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMTODINCLEAR</name>
              <description>The memory to DIN DMA done interrupt clear.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTTOSRAMCLEAR</name>
              <description>The DOUT to SRAM DMA done interrupt clear.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAMTODINCLEAR</name>
              <description>The SRAM to DIN DMA done interrupt clear.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFENDIAN</name>
          <description>This register defines the endianness of the Host-accessible registers. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000A0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00008888</resetMask>

          <fields>
            <field>
              <name>DINRDWBG</name>
              <description>DIN write word endianness:</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big endian</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUTWRWBG</name>
              <description>DOUT write word endianness:</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big endian</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINRDBG</name>
              <description>DIN write endianness:</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big endian</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOUTWRBG</name>
              <description>DOUT write endianness:</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big endian</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFSIGNATURE</name>
          <description>This register holds the CryptoCell product signature.</description>
          <addressOffset>0x00000A24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10E00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTSIGNATURE</name>
              <description>Identification 'signature': always returns a fixed value, used by Host driver to verify CryptoCell presence at this address.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTBOOT</name>
          <description>This register holds the values of CryptoCells pre-synthesis flags</description>
          <addressOffset>0x00000A28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5E62982E</resetValue>
          <resetMask>0x7FFFFFEF</resetMask>

          <fields>
            <field>
              <name>AESEXISTSLOCAL</name>
              <description>AES_EXISTS_LOCAL</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

