AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DINFIFORSTPNTR</name>
          <description>Writing to this register resets the DIN_FIFO pointers.</description>
          <addressOffset>0x00000C58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>RST</name>
              <description>Writing any value to this address resets the DIN_FIFO pointers.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DOUTMEMDMABUSY</name>
          <description>DOUT memory DMA busy - Indicates that memory (AXI) destination DMA (DOUT) is busy,</description>
          <addressOffset>0x00000D20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DOUTMEMDMABUSY</name>
              <description>DOUT memory DMA busy:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>busy</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_BUSY</name>
                  <description>not busy</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTLLIWORD0</name>
          <description>This register is used in direct LLI mode - holds the location of the data destination in the memory (AXI)</description>
          <addressOffset>0x00000D28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSTLLIWORD0</name>
              <description>Destination address within memory</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSTLLIWORD1</name>
          <description>This register is used in direct LLI mode - holds the number of bytes to be written to the memory (AXI). Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000D2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAST</name>
              <description>0x1 - Indicates the last LLI entry</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIRST</name>
              <description>0x1 - Indicates the first LLI entry</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BYTESNUM</name>
              <description>Total byte number to be written by DMA in this entry</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMDESTADDR</name>
          <description>Location of result to be sent to in SRAM. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000D30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMDEST</name>
              <description>SRAM destination base address for data.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DOUTSRAMBYTESLEN</name>
          <description>This register holds the size of the data (in bytes) to be written to the SRAM. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000D34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BYTESLEN</name>
              <description>Size of data to write to SRAM (bytes). This is the trigger to the SRAM DST DMA.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DOUTSRAMDMABUSY</name>
          <description>This register holds the status of the SRAM DMA DOUT.</description>
          <addressOffset>0x00000D38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BUSY</name>
              <description>DOUT SRAM DMA busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_SRAM</name>
                  <description>all data was written to SRAM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BUSY</name>
                  <description>DOUT SRAM DMA busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTSRAMENDIANNESS</name>
          <description>This register defines the endianness of the DOUT interface from SRAM.</description>
          <addressOffset>0x00000D3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DOUTSRAMENDIANNESS</name>
              <description>Defines the endianness of DOUT interface from SRAM:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big-endianness</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endianness</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READALIGNLAST</name>
          <description>Indication that the next read from the CPU is the last one. This is needed only when the data size is NOT modulo 4 (e.g. HASH padding).</description>
          <addressOffset>0x00000D44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LAST</name>
              <description>0x1 - Flush the read aligner content (used for reading the last data).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

