AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTFIFOEMPTY</name>
          <description>DOUT_FIFO_EMPTY Register.</description>
          <addressOffset>0x00000D50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DOUTFIFOEMPTY</name>
              <description>DOUT FIFO empty status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_NE</name>
                  <description>DOUT FIFO is not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_EDOUT</name>
                  <description>FIFO is empty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMDATA</name>
          <description>READ WRITE DATA FROM SRAM. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMDATA</name>
              <description>32 bit write or read from SRAM: read - triggers the SRAM read DMA address automatically incremented write - triggers the SRAM write DMA address automatically incremented</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMADDR</name>
          <description>first address given to SRAM DMA for read_write transactions from SRAM</description>
          <addressOffset>0x00000F04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>

          <fields>
            <field>
              <name>SRAMADDR</name>
              <description>SRAM starting address</description>
              <bitRange>[14:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMDATAREADY</name>
          <description>The SRAM content is ready for read in SRAM_DATA.</description>
          <addressOffset>0x00000F08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SRAMREADY</name>
              <description>SRAM content is ready for read in SRAM_DATA.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID4</name>
          <description>Peripheral ID 4 (PID4).</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>DES2JEP106</name>
              <description>for ARM products.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID0</name>
          <description>Peripheral ID 0 (PID0).</description>
          <addressOffset>0x00000FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000C0</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PART0</name>
              <description>Identification register part number, bits[7:0]</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID1</name>
          <description>Peripheral ID 1 (PID1).</description>
          <addressOffset>0x00000FE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000B0</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DES0JEP106</name>
              <description>for ARM products.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PART1</name>
              <description>Identification register part number, bits[11:8]</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID2</name>
          <description>Peripheral ID 2 (PID2).</description>
          <addressOffset>0x00000FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000002B</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>REVISION</name>
              <description>starts at zero and increments for every new IP release.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>JEDEC</name>
              <description>constant 0x1. Indicates that a JEDEC assigned value is used.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

