AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DES1JEP106</name>
              <description>for ARM products.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID3</name>
          <description>Peripheral ID 3 (PID3).</description>
          <addressOffset>0x00000FEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>REVAND</name>
              <description>starts at zero for every Revision, and increments if metal fixes are applied between 2 IP releases.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMOD</name>
              <description>Customer Modified, normally zero, but if a partner applies any changes themselves, they must change this value.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID0</name>
          <description>Component ID0.</description>
          <addressOffset>0x00000FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PRMBL0</name>
              <description>constant 0xD</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID1</name>
          <description>Component ID1.</description>
          <addressOffset>0x00000FF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000F0</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CLASS</name>
              <description>component type 0 0xF for Cryptocell</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRMBL1</name>
              <description>constant 0x0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID2</name>
          <description>Component ID2.</description>
          <addressOffset>0x00000FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000005</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PRMBL2</name>
              <description>constant 0x5</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID3</name>
          <description>Component ID3.</description>
          <addressOffset>0x00000FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000B1</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PRMBL3</name>
              <description>constant 0xB1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN0</name>
          <description>The DCU [31:0] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN0</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN1</name>
          <description>The DCU [63:32] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN1</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN2</name>
          <description>The DCU [95:64] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN2</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN3</name>
          <description>The DCU [1271:96] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN3</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

