AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK0</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK0</name>
              <description>DCU_lock [31:0] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK1</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK1</name>
              <description>DCU_lock [63:32] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK2</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK2</name>
              <description>DCU_lock [95:64] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK3</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK3</name>
              <description>DCU_lock [127:96] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK0</name>
          <description>The DCU lock register.</description>
          <addressOffset>0x00001E20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK0</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [31:0] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK1</name>
          <description>The 'ICV_DCU_restriction_mask' parameter is read by FW during the secure debug verification to prevent OEM from setting specific DCUs that protect ICV secrets</description>
          <addressOffset>0x00001E24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK1</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [63:32] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK2</name>
          <description>The 'ICV_DCU_restriction_mask' parameter is read by FW during the secure debug verification to prevent OEM from setting specific DCUs that protect ICV secrets</description>
          <addressOffset>0x00001E28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK2</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [95:64] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK3</name>
          <description>The 'ICV_DCU_restriction_mask' parameter is read by FW during the secure debug verification to prevent OEM from setting specific DCUs that protect ICV secrets</description>
          <addressOffset>0x00001E2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK3</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [127:96] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

