AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>AOCCSECDEBUGRESET</name>
          <description>The reset-upon-debug indication</description>
          <addressOffset>0x00001E30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AOCCSECDEBUGRESET</name>
              <description>For resets Cerberus, and prevents loading the HW keys after that reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTAOLOCKBITS</name>
          <description>These masks will define, per LCS, which DCU bits will be tied to zero, even if the Host tries to set them. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>HOSTDFAENABLELOCK</name>
              <description>When this FW control is set, the DFA_ENABLE register cant be written until the next POR. The DFA_ENABLE_LOCK register is set-once (per POR).</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTFORCEDFAENABLE</name>
              <description>When this FW controlled register is set, the AES DFA countermeasures are enabled_disabled (regardless of the AES_DFA_IS_ON register value).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESETUPONDEBUGDISABLE</name>
              <description>The RESET_UPON_DEBUG_DISABLE register is set-once (per POR).</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTICVRMALOCK</name>
              <description>The ICV_RMA_LOCK register is set-once (per POR).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKCELOCK</name>
              <description>When this FW controlled register is set, the Kce HW key is masked (to zero).</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKCPLOCK</name>
              <description>When this FW controlled register is set, the Kcp HW key is masked (to zero).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKCEICVLOCK</name>
              <description>When this FW controlled register is set, the Kceicv HW key is masked (to zero).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKPICVLOCK</name>
              <description>When this FW controlled register is set, the Kpicv HW key is masked (to zero).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTFATALERR</name>
              <description>When the 'FATAL_ERROR' register is asserted - HW keys will not be copied from OTP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOAPBFILTERING</name>
          <description>This register holds the AO_APB_FILTERING data. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000055</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>APBCONLYINSTACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_INST_ACCESS_ALLOWED register cant be modified (until the next POR)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYINSTACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB-C slave accepts only instruction accesses</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYPRIVACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED register cant be modified (until the next POR)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYPRIVACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB-C slave accepts only privileged accesses</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYSECACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_SEC_ACCESS_ALLOWED register cant be modified (until the next POR).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

