AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>APBCONLYSECACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB-C slave accepts only secure accesses</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYPRIVACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED register cant be modified (until the next POR)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYPRIVACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB slave accepts only privileged accesses</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYSECACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the ONLY_SEC_ACCESS_ALLOWED register cant be modified (until the next POR).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYSECACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB slave accepts only secure accesses</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOCCGPPC</name>
          <description>holds the AO_CC_GPPC value from AONote: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>AOCCGPPC</name>
              <description>The AO_CC_GPPC value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFCCSWRST</name>
          <description>Writing to this register generates a general reset to CryptoCell. This reset takes about 4 core clock cycles.Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTRGFCCSWRST</name>
              <description>Writing 1 to this field generates a general reset to CryptoCell.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AIBFUSEPROGCOMPLETED</name>
          <description>This register reflects the fuse_aib_prog_completed input, which indicates that the fuse programming was completed.Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001F04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AIBFUSEPROGCOMPLETED</name>
              <description>Indicates if the fuse programming operation has been completed.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NVMDEBUGSTATUS</name>
          <description>AIB debug status register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001F08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000E</resetValue>
          <resetMask>0x0000000E</resetMask>

          <fields>
            <field>
              <name>NVMSM</name>
              <description>Main nvm fsm</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE NVMSM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_DUMMY</name>
                  <description>READ_DUMMY NVMSM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_MAN_FLAG</name>
                  <description>READ_MAN_FLAG NVMSM</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_OEM_FLAG</name>
                  <description>READ_OEM_FLAG NVMSM</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_GPPC</name>
                  <description>READ_GPPC NVMSM</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECODE</name>
                  <description>DECODE NVMSM</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTP_LCS_VALID</name>
                  <description>OTP_LCS_VALID NVMSM</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCS_IS_VALID</name>
                  <description>LCS_IS_VALID NVMSM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCSISVALID</name>
          <description>Indicates that the LCS register holds a valid value.Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001F0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LCSISVALIDREG</name>
              <description>Indicates whether LCS is valid.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

