AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RSVD21</name>
              <description>This field is reserved.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GAMARAMPEN</name>
              <description>When set to 1, global gamma correction is enabled</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLANKFRC</name>
              <description>When set to 1, forces output to blank</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UNDERRUNEN</name>
              <description>when set to 1, underrun prevention is enabled for interfaces that support this</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SNGFRAME</name>
              <description>When set to 1, single frame update is enabled</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD15</name>
              <description>This field is reserved.</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RGBCFG</name>
              <description>RGB format configuration</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB56516bit3</name>
                  <description>RGB565 16-bits Configuration 3</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB56516bit2</name>
                  <description>RGB565 16-bits Configuration 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB56516bit1</name>
                  <description>RGB565 16-bits Configuration 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB66618bit2</name>
                  <description>RGB666 18-bits Configuration 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB66618bit1</name>
                  <description>RGB666 18-bits Configuration 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB88824bit</name>
                  <description>RGB888 24-bits</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPICLKSET</name>
              <description>When set to 1, DPI_PCLK is equal to format_clk</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD10</name>
              <description>This field is reserved.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COLFMT</name>
              <description>Output color format:</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YUV_EN</name>
                  <description>YUV/YCbCr format is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB_EN</name>
                  <description>RGB format is enabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISPFMT</name>
              <description>Display data format</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPI</name>
                  <description>DPI Interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE3</name>
                  <description>Byte-3 beat Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE4</name>
                  <description>Byte-4 beat (RGBX) Interface</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL</name>
                  <description>Two phase serial 12-bit</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUYV</name>
                  <description>YUYV (16-bit mode)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JDI</name>
                  <description>JDI MIP</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD04</name>
              <description>This field is reserved.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

