AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>YUYVEN</name>
              <description>When set to 0, the following output color formats are enabled : Byte-3 beat Interface enabled, Byte-4 beat (RGBX) Interface enabled, Two phase serial 12-bit enabled, YUYV (16-bit mode) enabled, BT.656 enabled, JDI MIP enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD02</name>
              <description>This field is reserved.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBLHORSCANEN</name>
              <description>When set to 1, double horizontal scan is enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSTMODEN</name>
              <description>When set to 1, test mode is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Setup proper timing with divisor control bits and specify the number of lines to be prefetched before the start of frame.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000401</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SECCLKDIV</name>
              <description>Value of secondary clock divider</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDIV_0</name>
                  <description>No division</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_1</name>
                  <description>No division</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_2</name>
                  <description>Divided by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_3</name>
                  <description>Divided by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_4</name>
                  <description>Divided by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_5</name>
                  <description>Divided by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_6</name>
                  <description>Divided by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_7</name>
                  <description>Divided by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_8</name>
                  <description>Divided by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_9</name>
                  <description>Divided by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_10</name>
                  <description>Divided by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_11</name>
                  <description>Divided by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_12</name>
                  <description>Divided by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_13</name>
                  <description>Divided by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_14</name>
                  <description>Divided by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_15</name>
                  <description>Divided by 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD024</name>
              <description>This field is reserved.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PLL</name>
              <description>Select PLL Clock</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD14</name>
              <description>This field is reserved.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LINENUM</name>
              <description>Number of lines to be prefetched before starting the frame through DMA. Maximum value is 32</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

