AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>GREENCOLOR</name>
              <description>Color green is used as background color</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLUECOLOR</name>
              <description>Color blue is used as background color</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALPHACOLOR</name>
              <description>Color alpha is used as background color</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RESXY</name>
          <description>Specifies the main X and Y resolutions.</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>XRES</name>
              <description>Value of X resolution in pixels</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>YRES</name>
              <description>Value of Y resolution in pixels</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGPLAY</name>
          <description>Write any value to this register at the end of the programming sequence to trigger the NemaDC</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PLAY</name>
              <description>Trigger the frame generation process</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FRONTPORCHXY</name>
          <description>Specifies the X and Y dimensions for the Front Porch.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FPCLKCYCLES</name>
              <description>Specify the pixel clock cycles for the front porch X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLINES</name>
              <description>Specify the number of lines for the front porch Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLANKINGXY</name>
          <description>Specifies the X and Y dimensions for the Blanking Period.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HSYNCPULSE</name>
              <description>Specify the HSYNC pulse length for the X dimension blanking period</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VSYNCLINES</name>
              <description>Specify the VSYNC lines for the Y dimension blanking period</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BACKPORCHXY</name>
          <description>Specifies the X and Y dimensions for the Back Porch.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BPCLKCYCLES</name>
              <description>Specify the pixel clock cycles for the back porch X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLINES</name>
              <description>Specify the number of lines for the back porch Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CURSORXY</name>
          <description>Specifies the cursor's start X and Y coordinates.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CURSORX</name>
              <description>Specify cursor's X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CURSORY</name>
              <description>Specify cursor's Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STARTXY</name>
          <description>Specifies the start position of the very first frame</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>STARTX</name>
              <description>Specify frames's X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

