AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>FlipXenable</name>
              <description>Enables the FlipX functionality</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MODElayerregisterprotect</name>
              <description>Enable Register Protection for NemaDC layer registers. When Register Protection is enabled the layer registers take effect in the design only when frame end occurs.Register reading functionality from register file remains the same.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER0COLMODE</name>
              <description>Color mode</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER0CM_LUTBLE</name>
                  <description>8-bit color palette look-up table (LUT8)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGBX5551</name>
                  <description>16-bit RGBX5551 color format</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGBX8888</name>
                  <description>32-bit RGBX8888 color format</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGB332</name>
                  <description>8-bit RGB332 color format</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGB565</name>
                  <description>16-bit RGB565 color format</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_XRGB8888</name>
                  <description>32-bit XRGB8888 color format</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_L8</name>
                  <description>L8 Grayscale/Palette format</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RBG</name>
                  <description>24-bit RGB color format</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGBA8888</name>
                  <description>32-bit RGBA8888 color format</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_ARGB8888</name>
                  <description>32-bit ARGB8888 color format</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSc4</name>
                  <description>TSc4 format</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSc6</name>
                  <description>TSc6 format</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSc6A</name>
                  <description>TSc6A format</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA4444</name>
                  <description>16-bit RGBA4444 color format</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB4444</name>
                  <description>16-bit ARGB4444 color format</description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LAYER0STARTXY</name>
          <description>X and Y start dimensions of layer 0.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER0XOFF</name>
              <description>Specify the pixel offset of the starting X dimension of layer 0</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER0YOFF</name>
              <description>Specify the pixel offset of the starting Y dimension of layer 0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER0SIZEXY</name>
          <description>X and Y size of layer 0.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER0PIXSZEX</name>
              <description>Specify the pixel size of the layer 0 in the X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER0PIXSZEY</name>
              <description>Specify the pixel size of the layer 0 in the Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

