AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LAYER2STRIDE</name>
          <description>Specify the stride and the AXI bus burst of layer 2.</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD221</name>
              <description>This field is reserved.</description>
              <bitRange>[31:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2AXIFIFOTHLD</name>
              <description>Specify the AXI fifo threshold burst start in layer 2</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER2_BURST_HALF_SZ</name>
                  <description>half fifo (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BURST_2</name>
                  <description>2 burst-size</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BURST_4</name>
                  <description>4 burst-size</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BURST_8</name>
                  <description>8 burst-size</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAYER2AXIBURSTBITS</name>
              <description>Specify the AXI bits per burst in layer 2</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER2_BEATS_DEF</name>
                  <description>16-beats (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_2</name>
                  <description>2-beats</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_4</name>
                  <description>4-beats</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_8</name>
                  <description>8-beats</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_16</name>
                  <description>16-beats (CHECK mistake?)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_32</name>
                  <description>32-beats (AXI4 only)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_64</name>
                  <description>64-beats (AXI4 only)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_BEATS_128</name>
                  <description>128-beats (AXI4 only)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAYER2STRIDEDIST</name>
              <description>Specify the stride, which is the distance from line to line in bytes for each layer 2 memory</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER2RESXY</name>
          <description>X and Y dimensions for the resolution of layer 2.</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER2PIXRESX</name>
              <description>Specify the layer n pixel resolution in the X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2PIXRESY</name>
              <description>Specify the layer n pixel resolution in the Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER3MODE</name>
          <description>Activate and set-up layer 3.</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER3EN</name>
              <description>When set to 1, layer n is enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3FORCE</name>
              <description>When set to 1, force alpha with global alpha is enabled</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3BFILTER</name>
              <description>When set to 1, bilinear filtering is enabled</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

