AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>READDBI</name>
              <description>Read from DBI interface</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCALSTORE</name>
              <description>When set to 1, bits [15:0] are locally stored as base address of the horizontal line; it is used along with the DBI_CFG[17:16] register bits for the SPI interface</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD11</name>
              <description>This field is reserved.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA2DBI</name>
              <description>Data to send to the DBI interface</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DBIRDAT</name>
          <description>Data read by DBI Type-B interface are stored in the DBI_RDAT register.</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>READTYPEB</name>
              <description>Read data from DBI Type-B interface</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CONFG</name>
          <description>Information of the layers n activation and setup.</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF1BB3159</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CFGLAYER3TSCMEM</name>
              <description>Indicates that layer 3 has TSC Memory</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER2TSCMEM</name>
              <description>Indicates that layer 2 has TSC Memory</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER1TSCMEM</name>
              <description>Indicates that layer 1 has TSC Memory</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER0TSCMEM</name>
              <description>Indicates that layer 0 has TSC Memory</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD25</name>
              <description>This field is reserved.</description>
              <bitRange>[27:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGSPIINTERFACE</name>
              <description>Indicates that SPI interface is enabled</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER3GAMMALUT</name>
              <description>Indicates that layer 3 has gamma LUT</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD22</name>
              <description>This field is reserved.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER3BLENDER</name>
              <description>Indicates that layer 3 has blender</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER3EN</name>
              <description>Indicates that layer 3 is enabled</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER2GAMMALUT</name>
              <description>Indicates that layer 2 has gamma LUT</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1801</name>
              <description>This field is reserved.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER2BLENDER</name>
              <description>Indicates that layer 2 has blender</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER2EN</name>
              <description>Indicates that layer 2 is enabled</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER1GAMMALUT</name>
              <description>Indicates that layer 1 has gamma LUT</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1401</name>
              <description>This field is reserved.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

