AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>CFGLAYER1BLENDER</name>
              <description>Indicates that layer 1 has blender</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER1EN</name>
              <description>Indicates that layer 1 is enabled</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER0GAMMALUT</name>
              <description>Indicates that layer 0 has gamma LUT</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD3</name>
              <description>This field is reserved.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER0BLENDER</name>
              <description>Indicates that layer 0 has blender</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGLAYER0EN</name>
              <description>Indicates that layer 0 is enabled</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGRGB2YUVEN</name>
              <description>Indicates that RGB to YUV converter is enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGDBITYPEBEN</name>
              <description>Indicates that DBI Type-B interface is enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0501</name>
              <description>This field is reserved.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGFORMATTEN</name>
              <description>Indicates that formatting is enabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGDITHEREN</name>
              <description>Indicates that dithering is enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0201</name>
              <description>This field is reserved.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGFCURSOREN</name>
              <description>Indicates that cursor is enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGGLBGAMMAEN</name>
              <description>Indicates that Global Gamma/Palette is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IDREG</name>
          <description>Identification Register.</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x87452365</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DCID</name>
              <description>Fixed value for DC ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT</name>
          <description>Register interrupts enabled, level or edge enabled.</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x8000000F</resetMask>

          <fields>
            <field>
              <name>INTTRIGGER</name>
              <description>Interrupt request trigger control</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Level triggering is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Edge triggering is enabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTTEEN</name>
              <description>When set to 1, TE interrupt enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTMMUERR</name>
              <description>When set to 1, MMU error interrupt enabled</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTHSYNCEN</name>
              <description>When set to 1, HSYNC interrupt enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTVSYNCEN</name>
              <description>When set to 1, VSYNC interrupt enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

