AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>DSI Status register (interrupt and pending activity)</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD19</name>
              <description>This field is reserved.</description>
              <bitRange>[31:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPISTACK</name>
              <description>Indicates GPI got stack durring packet transaction</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CRCREADY</name>
              <description>Indicates CRC Register read ready</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPIRDWR</name>
              <description>Indicates read/write operation on SPI</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDFIFOACK</name>
              <description>Indicates the DBI/SPI Command fifo ack</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBISPICS</name>
              <description>Indicates the DBI/SPI CS status</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRAMEEND</name>
              <description>Indicates Frame end</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATDBIPENDTRANS</name>
              <description>Indicates pending output transaction in DBI interface</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATDBIPENDCOM</name>
              <description>Indicates pending commands in DBI interface</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATDBIRGB</name>
              <description>Indicates pending RGB data in DBI interface</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD09</name>
              <description>This field is reserved.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATTEAR</name>
              <description>Indicates DBI Type-B tearing effect</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATSTICKY</name>
              <description>Indicates sticky underflow. This bit clears when interrupt register is written</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATUF</name>
              <description>Indicates current underflow</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATLAST</name>
              <description>Indicates that the last row is currently displayed</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATCSYNC</name>
              <description>Indicates the CSYNC signal status (0 or 1) at the current time of reading</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATVSYNC</name>
              <description>Indicates the VSYNC signal status and the tearing e?ect signal status (0 or 1) at the current time of reading</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATHSYNC</name>
              <description>Indicates the HSYNC signal status (0 or 1) at the current time of reading</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATDE</name>
              <description>Indicates the DE signal status (0 or 1) at the current time of reading</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATNOTBLANK</name>
              <description>Indicates that the controller is not in active vertical blanking</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COLMOD</name>
          <description>Color mode status register indicating formats/back pressure are enabled.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2F8E0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD30</name>
              <description>This field is reserved</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>

