AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>JDI</name>
              <description>Indicates that NemaDC is equiped JDI</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD28</name>
              <description>This field is reserved</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLIPY</name>
              <description>Indicate that FlipY is equiped</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3FLIPX</name>
              <description>Indicate that FlipX is equiped for layer3</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2FLIPX</name>
              <description>Indicate that FlipX is equiped for layer2</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER1FLIPX</name>
              <description>Indicate that FlipX is equiped for layer1</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER0FLIPX</name>
              <description>Indicate that FlipX is equiped for layer0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD20</name>
              <description>This field is reserved</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBIBEXTERNAL</name>
              <description>Indicate DBIB external control is enabled</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSC6</name>
              <description>Indicates that TS6 is enabled</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSC4</name>
              <description>Indicates that TSC4 is enabled</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0017</name>
              <description>This field is reserved.</description>
              <bitRange>[16:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER0COLORDECSTARTXY</name>
          <description>X and Y stat of dimensions of colordec in layer0</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>COCLORDECSTARTY</name>
              <description>Specify the pixel offset of the starting Y dimension of colordec in layer0</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COCLORDECSTARTX</name>
              <description>Specify the pixel offset of the starting X dimension of colordec in layer0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CRC</name>
          <description>if cyclic redundancy errors occur, they are written in the CRC register.</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CRCREG</name>
              <description>CRC value if CRC error exists</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GLLUT</name>
          <description>R[0]G[0]B[0] thru R[255]G[255]B[255] Global palette, gamma correction memory region where x starts at 0 thru 255.Access to all 256 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_L0LUT(n) (*((volatile uint32_t*)(&amp;L0LUT + (4*n))))</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD2408</name>
              <description>This field is reserved.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GLLUT0GAMRAMPR</name>
              <description>Gamma ramp red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GLLUT0GAMRAMPG</name>
              <description>Gamma ramp green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GLLUT0GAMRAMPB</name>
              <description>Gamma ramp blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

