AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RXLPTXSYNCERR</name>
              <description>Rx LP tx sync error; Set to enable the interrupt for Low power transmission sync error in the acknowledgment packet reports</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXESCPMDETRYERR</name>
              <description>RxEscape Mode Entry Error; Set to enable the interrupt for Escape Mode Entry command error in the acknowledgment packet reports</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXEOTSYNCRR</name>
              <description>RxEot Sync Error l set to enable the interrupt for the end of transmission synchronisation Error in the acknowledgment packet reports</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSOTSYNCERROR</name>
              <description>RX start of transmission; Set to enable the interrupt for start of transmission synchronization error in the acknowledgement packet reports</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSOTERROR</name>
              <description>RX start of transmission; set to enable the interrupt for start of transmission</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSIFUNCPRG</name>
          <description>DSI function programming register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000E3FF</resetMask>

          <fields>
            <field>
              <name>REGNAME</name>
              <description>FIXME - Bitfield description needed here.</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>command</name>
                  <description>mode is not supported]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXME1</name>
                  <description>16 bit data</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXME2</name>
                  <description>9 bit data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXME3</name>
                  <description>8 bit data</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPCOLVIDMODE</name>
              <description>Supported colour format for video mode.</description>
              <bitRange>[9:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FMTVMODE0</name>
                  <description>Video mode is not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMTVMODE1</name>
                  <description>RGB565 or 16-bit format</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMTVMODE2</name>
                  <description>RGB666 or 18-bit format</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMTVMODE3</name>
                  <description>RGB 666 loosely packed format</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMTVMODE4</name>
                  <description>RGB888 or 24-bit format</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHNUMCMODE</name>
              <description>Channel Number for command mode is programmed by the processor</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VCCH0</name>
                  <description>Virtual command mode channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCCH1</name>
                  <description>Virtual command mode channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCCH2</name>
                  <description>Virtual command mode channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCCH3</name>
                  <description>Virtual command mode channel 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHNUMVM</name>
              <description>Channel number for video mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VVCH0</name>
                  <description>Virtual  video mode  channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VVCH1</name>
                  <description>Virtual  video mode  channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VVCH2</name>
                  <description>Virtual  video mode  channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VVCH3</name>
                  <description>Virtual  video mode  channel 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATALANES</name>
              <description>The number  Data lanes to be supported is programmed by the processor</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATAL0</name>
                  <description>FIXME - enum description needed here.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAL1</name>
                  <description>One data lane</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAL2</name>
                  <description>Two data lane</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAL3</name>
                  <description>Three data lane</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAL4</name>
                  <description>Four data lane</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSTXTIMEOUT</name>
          <description>Maximum duration allow for the DSi host to remain in High speed mode for transmission.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>MAXDURTOCNT</name>
              <description>The maximum duration allowed for the DSI host to remain in high speed mode for a transmission. If the counter expires, processor is interrupted with HS_Tx_timeout interrupt</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

