AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LPRXTO</name>
          <description>Timeout value to be checked for reverse communicationl</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>TOCHKRVS</name>
              <description>Timeout value to be checked for reverse communication. If the counter expires, processor is interrupted with LP_Rx_timeout interrupt.The timeout value is protocol specific. Time out value is calculated from txclkesc(50ns).</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TURNARNDTO</name>
          <description>Timeout value to be checked after the DSI host makes a trun around in the direction of transfers.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000017</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>TIMOUT</name>
              <description>If the counter expires, processor is interrupted with Turn_around_ack timeout interrupt; this specified period shall be longer then the maximum possible turnaround delay for the unit to which the turnaround request was sent, which is 23 clock cycles of txclkesc; any number greater than or equal to 23 is an acceptable number.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEVICERESETTIMER</name>
          <description>Timeout value to be checked for device to be reset after issuing reset entry command</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>TIMOUT</name>
              <description>If the timer expires the DSI Host enters normal operation; This time out value is used while contention recovery procedure; the time out value is equal to a value longer than the specified time required to complete the reset sequence</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DPIRESOLUTION</name>
          <description>Shows the horizontal address count in pixels</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DPIRESOLUTION</name>
              <description>TODO: update this register description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HSYNCCNT</name>
          <description>Shows the horizontal sync value in terms of byte clock.</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>HORZCNT</name>
              <description>rw  0000h   Shows the horizontal sync value in terms of byte clock (txbyteclkhs); Minimum HSA period should be sufficient to transmit a Hsync start short packet(4 bytes) i) For Non-burst Mode with sync pulse, Min value - 4 in decimal (plus an optional 6 bytes for a zero payload blanking packet); But if the value is less than 10 but more than 4, then this count will be added to the HBP's count for one lane; ii) For Non-Burst Sync Event and Burst Mode, there is no HSA, so you can program this to zero. If you program this register, these byte values will be added to HBP Max value - any 12 bit value greater than 4 based on DPI resolution</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HORIZBKPORCHCNT</name>
          <description>Shows the horizontal back porch value in terms of txbyteclkhs.</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>HORZBKPCNT</name>
              <description>For Non Burst Sync pulse mode, for one lane. Minimum HBP count = Hsync End short packet + HBP Blanking packet overhead (header(4) + crc (2)) + RGB packet header For other lane counts minimum value = Minimum HBPcount / lane_count. For Non Burst Sync event / Burst Mode there is no HSA. Minimum HBP count = (Hsync Start short packet + HBP Blanking packet overhead + RGB packet header) / lane_count Min value - 14 in decimal (accounted with zero payloads for blanking packet] for one lane. Max value - any 12 bit value greater than 14 based on DPI resolution</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HORIZFPORCHCNT</name>
          <description>Shows the horizontal front porch value in terms of txbyteclkhs.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>HORZFTPCNT</name>
              <description>Minimum HFP period should be sufficient to transmit RGB Data packet footer (2 bytes) + Blanking packet overhead (6 bytes) +adjustable count (16 bytes) for non burst mode; For other lane counts Minimum value = (RGB Data packet footer(2 bytes) + Blanking packet overhead(6 bytes)) / (lane_count) + adjustable count(16 bytes) For burst mode, Minimum HFP period should be sufficient to transmit Blanking packet overhead(6 bytes) +adjustable count (16 bytes) for one lane for other lane counts Minimum value = ( Blanking packet overhead(6 bytes)) / (lane_count) + adjustable count(16 bytes) Min value - 8 in decimal for non-burst mode (accounted with zero payload for blanking packet) for one lane Min value - 6 in decimal for burst mode for one lane Max value - any 12 bit value greater than the minimum value based on DPI resolution; Minimum HFP period should be sufficient to transmit</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

