AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HORZACTIVEAREACNT</name>
          <description>Horizontal active area count / time for active image data / Horizontal Address</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>HORACTCNT</name>
              <description>Shows the horizontal active area value in terms of  txbyteclkhs. In Non Burst Mode, Count equal to RGB word count value In Burst Mode, RGB pixel packets are time compressed, leaving more time during a scan line for LP mode (saving power) or for multiplexing other transmissions onto the DSI link. Hence, the count equals the time in txbyteclkhs for sending time compressed RGB pixels plus the time needed for moving to power save mode or the time needed for secondary channel to use the DSI link. But if the left out time for moving to low power mode is less than 8 txbyteclkhs (2txbyteclkhs for RGB data packet footer and 6txbyteclkhs for a blanking packet with zero payload), then this count will be added to the HFPs count for one lane.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VSYNCCNT</name>
          <description>Shows the vertical sync value</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>VSC</name>
              <description>Shows the vertical sync value in terms of lines. Min value - 2 Max value - any 12 bit value greater than 2 based on DPI resolution</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VERTBKPORCHCNT</name>
          <description>Shows the vertical back porch value</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>VBPSC</name>
              <description>Shows the vertical back porch value in terms of lines. Min value - 1; Max value - any 12 bit value greater than 1 based on DPI resolution</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VERTFPORCHCNT</name>
          <description>Shows the vertical front porch value</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>VFPSC</name>
              <description>Shows the vertical front porch value in terms of lines. Min value - 1; Max value - any 12 bit value greater than 1 based on DPI resolution</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DATALANEHILOSWCNT</name>
          <description>High speed to low power or Low power to high speed switching time</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DATALHLSWCNT</name>
              <description>High speed to low power or Low power to high speed power or Low switching time in terms byte clock (txbyteclkhs). This power to high speed switch count value is based on the byte clock (txbyteclkhs) and low power clock frequency (txclkesc); Data lane Switch count = 4 * Tlpx + programmed THS_prep + programmed THS_zero + 4 byteclk Tlpx = Low power clock equivalence in of terms byte clock programmed in AHB reg 68h; THS_prep = programmed value of dln_cnt_hs_prep in AHB Reg 6ch bit (7:0) THS_zero = programmed value of dln_cnt_hs_zero in AHB Reg 6ch bit (15:8) Programmable count  should be equal or greater than this value. Typical value x96 Number of byte clocks required to switch from low power mode to high speed mode after txrequesths is asserted.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DPI</name>
          <description>DPI control register.</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>COLORMODEOFF</name>
              <description>Set to 1 to indicate a Color Mode OFF short packet has to be packetised for the DPIs virtual channel</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COLOR</name>
              <description>MODEON    Set to 1 to indicate a color Mode ON short packet has to be packetised for the DPIs virtual channel.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TURNON1</name>
              <description>Set to 1 to indicate a Turn ON short packet has to be packetised for the DPIs virtual channel</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

