AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>CLOCK</name>
              <description>Set by the processor to enable or disable clock; Stopping feature during BLLP timing in a DPI transfer in dual channel mode or during DPI only mode and also when there is no traffic in the DBI interface in DBI only enabled mode. By default this register value is 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EOT</name>
              <description>Set by the processor to enable or disable EOT short disable_register packet transmission; vy default this register value is 0; for backward compatibility of earlier DSI systems, EOT short packet transmission can be disabled; 0 EOT short packet transmission enabled, 1  EOT short packet transmission disabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>POLARITY</name>
          <description>Polarity Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>PBITS</name>
              <description>Polarity bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POLV</name>
                  <description>polarity for Vsync</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLH</name>
                  <description>Polarity for Hsync</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLSD</name>
                  <description>Polarity for shut down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POLCM</name>
                  <description>Polarity for Color mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKLANESWT</name>
          <description>High speed to low power switching time in terms ofbyte clock (txbyteclkhs)</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LOWPWR2HI</name>
              <description>This value is based on the byte clock (txbyteclkhs) and low power clock frequency (txclkesc)LP to HS switch count = 4 * Tlpx + (programmed Tclk_prep + extracount (1 byteclk) ) + (programmed Tclk_zero + extracount (1 byteclk) ) + Tclk_pre + 2 byteclk Tlpx = Low power clock equivalence in terms of byte clock programmed in AHB reg 68h Tclk_prep = programmed value of cln_cnt_prep in AHB Reg 70h bit (7:0) Tclk_zero = programmed value of cln_cnt_zero in AHB Reg 70h bit (15:8) Tclk_pre = 8 UI Typical value x96 Number of byte clocks required to switch from low power mode to high speed mode after txrequesths_clk is asserted.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HISPLPSW</name>
              <description>High speed to low power switching time in terms byte clock (txbyteclkhs). This value is based on the byte clock (txbyteclkhs) and low power clock frequency; HS to LP switch count = Tclk_trail + THS_Exit + 3 byteclk Tclk_trail = programmed value of cln_cnt_hs_trail in AHB Reg 70h bit (23:16) THS_Exit = programmed value of cln_cnt_hs_exit in AHB Reg 70h bit (31:24) Typical value - Number of byte clocks request to switch from high speed mode to low power mode after txrequesths_clk is de-asserted.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LPBYTECLK</name>
          <description>Low power clock equivalence in terms of byte clock.</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>VALBYTECLK</name>
              <description>The value programmed in this register is equal to the number of byte clocks occupied in one low power clock; this value is based on the byte clock (txbyteclkhs) and low power clock frequency (txclkesc)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DPHYPARAM</name>
          <description>This field provides the timing requirement in byte clocks for the high speed preparation time.</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0B061A04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HSEXIT</name>
              <description>This field provides the timing requirement in byte clocks for the high speed exit time; this corresponds to the THS-EXIT parameter specified in the DPHY specification</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

