AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DS4</name>
              <description>Drive strength selection for GPIO 4</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0P1X</name>
                  <description>0.1x output driver selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P5X</name>
                  <description>0.5x output driver selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTCFG4</name>
              <description>Pin IO mode selection for GPIO pin 4</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Output Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Output configured in push pull mode. Will drive 0 and 1 values on pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Output configured in open drain mode. Will only drive pin low, tristate otherwise.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Output configured in Tristate-able push pull mode. Will drive 0, 1 of HiZ on pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRPTEN4</name>
              <description>Interrupt enable for GPIO 4</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Interrupts are disabled for this GPIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTFALL</name>
                  <description>Interrupts are enabled for falling edge transition on this GPIO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRISE</name>
                  <description>Interrupts are enabled for rising edge transitions on this GPIO</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTANY</name>
                  <description>Interrupts are enabled for any edge transition on this GPIO</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDZERO4</name>
              <description>Return 0 for read data on GPIO 4</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INPEN4</name>
              <description>Input enable for GPIO 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FNCSEL4</name>
              <description>Function select for GPIO pin 4</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWTRACE3</name>
                  <description>Serial Wire Debug Trace Output 3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLFDINT</name>
                  <description>I2C Slave FD1 interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHzXT</name>
                  <description>32kHZ from analog</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>General purpose I/O</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0RTS</name>
                  <description>UART Request to Send (RTS) (UART 0)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RTS</name>
                  <description>UART Request to Send (RTS) (UART 1)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT4</name>
                  <description>Timer/Counter input or output; Selection of direction is done via CTIMER register settings.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE4</name>
                  <description>IOMSTR N Chip Select. Polarity is determined by CE_POLARITY field</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSBUS4</name>
                  <description>Observation bus bit 4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S0_SDIN</name>
                  <description>I2S Data input (I2S Master/Slave 0)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLFD1INT</name>
                  <description>I2C Slave FD2 interrupt</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPIO</name>
                  <description>Fast PIO</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLB_TDO</name>
                  <description>Internal function (Flash Bist)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLOAD_DIR</name>
                  <description>Internal function (Flash parallel load)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDA_TDO</name>
                  <description>Internal function (MBIST)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANIN6</name>
                  <description>Internal function (SCAN)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PINCFG5</name>
          <description>Controls the operation of GPIO pin 5.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0C7FFFFF</resetMask>

          <fields>
            <field>
              <name>FOEN5</name>
              <description>Force output enable active regardless of function selected. Otherwise the selected function will enable the output only when needed</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

