AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>INPEN45</name>
              <description>Input enable for GPIO 45</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FNCSEL45</name>
              <description>Function select for GPIO pin 45</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI0_18</name>
                  <description>MSPI Master 0 Interface Signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG2</name>
                  <description>ADC trigger input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHzXT</name>
                  <description>32kHZ from analog</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>General purpose I/O</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>UART transmit output (UART 0)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>UART transmit output (UART 1)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT45</name>
                  <description>Timer/Counter input or output; Selection of direction is done via CTIMER register settings.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE45</name>
                  <description>IOMSTR N Chip Select. Polarity is determined by CE_POLARITY field</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSBUS13</name>
                  <description>Observation bus bit 13</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED9</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED10</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPIO</name>
                  <description>Fast PIO</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED12</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED13</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED14</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED15</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PINCFG46</name>
          <description>Controls the operation of GPIO pin 46.</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0C7FFFFF</resetMask>

          <fields>
            <field>
              <name>FOEN46</name>
              <description>Force output enable active regardless of function selected. Otherwise the selected function will enable the output only when needed</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIEN46</name>
              <description>Force input enable active regardless of function selected. Otherwise the selected function will enable the input only when needed</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NCEPOL46</name>
              <description>Polarity select for NCE for GPIO 46</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Polarity is active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Polarity is active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCESRC46</name>
              <description>IOMSTR/MSPI N Chip Select 46, DISP control signals DE, CSX, and CS. Polarity is determined by CE_POLARITY field</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOM0CE0</name>
                  <description>IOM 0 NCE 0 module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0CE1</name>
                  <description>IOM 0 NCE 1 module</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0CE2</name>
                  <description>IOM 0 NCE 2 module</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0CE3</name>
                  <description>IOM 0 NCE 3 module</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1CE0</name>
                  <description>IOM 1 NCE 0 module</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1CE1</name>
                  <description>IOM 1 NCE 1 module</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1CE2</name>
                  <description>IOM 1 NCE 2 module</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1CE3</name>
                  <description>IOM 1 NCE 3 module</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2CE0</name>
                  <description>IOM 2 NCE 0 module</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2CE1</name>
                  <description>IOM 2 NCE 1 module</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2CE2</name>
                  <description>IOM 2 NCE 2 module</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2CE3</name>
                  <description>IOM 2 NCE 3 module</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3CE0</name>
                  <description>IOM 3 NCE 0 module</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3CE1</name>
                  <description>IOM 3 NCE 1 module</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3CE2</name>
                  <description>IOM 3 NCE 2 module</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3CE3</name>
                  <description>IOM 3 NCE 3 module</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4CE0</name>
                  <description>IOM 4 NCE 0 module</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4CE1</name>
                  <description>IOM 4 NCE 1 module</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4CE2</name>
                  <description>IOM 4 NCE 2 module</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4CE3</name>
                  <description>IOM 4 NCE 3 module</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5CE0</name>
                  <description>IOM 5 NCE 0 module</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5CE1</name>
                  <description>IOM 5 NCE 1 module</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5CE2</name>
                  <description>IOM 5 NCE 2 module</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5CE3</name>
                  <description>IOM 5 NCE 3 module</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6CE0</name>
                  <description>IOM 6 NCE 0 module</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6CE1</name>
                  <description>IOM 6 NCE 1 module</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6CE2</name>
                  <description>IOM 6 NCE 2 module</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6CE3</name>
                  <description>IOM 6 NCE 3 module</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7CE0</name>
                  <description>IOM 7 NCE 0 module</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7CE1</name>
                  <description>IOM 7 NCE 1 module</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7CE2</name>
                  <description>IOM 7 NCE 2 module</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7CE3</name>
                  <description>IOM 7 NCE 3 module</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_DPI_DE</name>
                  <description>DC DPI DE module</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISP_CONT_CSX</name>
                  <description>DISP CONT CSX module</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_SPI_CS_N</name>
                  <description>DC SPI CS_N module</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_QSPI_CS_N</name>
                  <description>DC QSPI CS_N module</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESX</name>
                  <description>DC module RESX</description>
                  <value>52</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULLCFG46</name>
              <description>Pullup/Pulldown configuration for GPIO 46</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No pullup or pulldown selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD50K</name>
                  <description>50K Pulldown selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PU15K</name>
                  <description>1.5K Pullup selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PU6K</name>
                  <description>6K Pullup selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PU12K</name>
                  <description>12K Pullup selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PU24K</name>
                  <description>24K Pullup selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PU50K</name>
                  <description>50K Pullup selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PU100K</name>
                  <description>100K Pullup selected</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SR46</name>
              <description>Configure the slew rate</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

