AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOM1IRQ</name>
          <description>IOM1 IRQ select for flow control.</description>
          <addressOffset>0x000004CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM1IRQ</name>
              <description>IOM1 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM2IRQ</name>
          <description>IOM2 IRQ select for flow control.</description>
          <addressOffset>0x000004D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM2IRQ</name>
              <description>IOM2 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM3IRQ</name>
          <description>IOM3 IRQ select for flow control.</description>
          <addressOffset>0x000004D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM3IRQ</name>
              <description>IOM3 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM4IRQ</name>
          <description>IOM4 IRQ select for flow control.</description>
          <addressOffset>0x000004D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM4IRQ</name>
              <description>IOM4 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM5IRQ</name>
          <description>IOM5 IRQ select for flow control.</description>
          <addressOffset>0x000004DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM5IRQ</name>
              <description>IOM5 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM6IRQ</name>
          <description>IOM6 IRQ select for flow control.</description>
          <addressOffset>0x000004E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM6IRQ</name>
              <description>IOM6 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM7IRQ</name>
          <description>IOM7 IRQ select for flow control.</description>
          <addressOffset>0x000004E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>IOM7IRQ</name>
              <description>IOM7 IRQ pad select.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SDIF0CDWP</name>
          <description>SDIF0 CD and WP Select.</description>
          <addressOffset>0x000004E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FE7F</resetValue>
          <resetMask>0x0001FEFF</resetMask>

          <fields>
            <field>
              <name>SDIF0WP</name>
              <description>SDIF0 WP pad select.</description>
              <bitRange>[16:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIF0CD</name>
              <description>SDIF0 CD pad select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SDIF1CDWP</name>
          <description>SDIF1 CD and WP Select.</description>
          <addressOffset>0x000004EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FE7F</resetValue>
          <resetMask>0x0001FEFF</resetMask>

          <fields>
            <field>
              <name>SDIF1WP</name>
              <description>SDIF1 WP pad select.</description>
              <bitRange>[16:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIF1CD</name>
              <description>SDIF1 CD pad select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OBSDATA</name>
          <description>GPIO Observation mode sample</description>
          <addressOffset>0x000004F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OBSDATA</name>
              <description>Sample of the data output on the GPIO observation port. May have async sampling issues, as the data is not synronized to the read operation. Intended for debug purposes only.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

