AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS0</name>
          <description>Read only. Reflects the value of the input enable signals for pads 31-0 sent to the pad.</description>
          <addressOffset>0x000004F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA0</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS1</name>
          <description>Read only. Reflects the value of the input enable signals for pads 63-32 sent to the pad.</description>
          <addressOffset>0x000004F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA1</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS2</name>
          <description>Read only. Reflects the value of the input enable signals for pads 95-64 sent to the pad.</description>
          <addressOffset>0x000004FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA2</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS3</name>
          <description>Read only. Reflects the value of the input enable signals for pads 127-96 sent to the pad.</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA3</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS4</name>
          <description>Read only. Reflects the value of the input enable signals for pads 159-128 sent to the pad.</description>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA4</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS5</name>
          <description>Read only. Reflects the value of the input enable signals for pads 191-160 sent to the pad.</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA5</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS6</name>
          <description>Read only. Reflects the value of the input enable signals for pads 223-192 sent to the pad.</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA6</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS0</name>
          <description>Read only. Reflects the value of the output enable signals for pads 31-0 sent to the pad.</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA0</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

