AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS1</name>
          <description>Read only. Reflects the value of the output enable signals for pads 63-32 sent to the pad.</description>
          <addressOffset>0x00000514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA1</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS2</name>
          <description>Read only. Reflects the value of the output enable signals for pads 95-64 sent to the pad.</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA2</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS3</name>
          <description>Read only. Reflects the value of the output enable signals for pads 127-96 sent to the pad.</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA3</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS4</name>
          <description>Read only. Reflects the value of the output enable signals for pads 159-128 sent to the pad.</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA4</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS5</name>
          <description>Read only. Reflects the value of the output enable signals for pads 191-160 sent to the pad.</description>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA5</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS6</name>
          <description>Read only. Reflects the value of the output enable signals for pads 223-192 sent to the pad.</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA6</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN0INT0EN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN0GPIO31</name>
              <description>GPIO31 MCU N0-priority interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO30</name>
              <description>GPIO30 MCU N0-priority interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO29</name>
              <description>GPIO29 MCU N0-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO28</name>
              <description>GPIO28 MCU N0-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

