AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN0GPIO75</name>
              <description>GPIO75 MCU N0-priority interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO74</name>
              <description>GPIO74 MCU N0-priority interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO73</name>
              <description>GPIO73 MCU N0-priority interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO72</name>
              <description>GPIO72 MCU N0-priority interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO71</name>
              <description>GPIO71 MCU N0-priority interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO70</name>
              <description>GPIO70 MCU N0-priority interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO69</name>
              <description>GPIO69 MCU N0-priority interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO68</name>
              <description>GPIO68 MCU N0-priority interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO67</name>
              <description>GPIO67 MCU N0-priority interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO66</name>
              <description>GPIO66 MCU N0-priority interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO65</name>
              <description>GPIO65 MCU N0-priority interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO64</name>
              <description>GPIO64 MCU N0-priority interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN0INT3EN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN0GPIO127</name>
              <description>GPIO127 MCU N0-priority interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO126</name>
              <description>GPIO126 MCU N0-priority interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO125</name>
              <description>GPIO125 MCU N0-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO124</name>
              <description>GPIO124 MCU N0-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO123</name>
              <description>GPIO123 MCU N0-priority interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO122</name>
              <description>GPIO122 MCU N0-priority interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO121</name>
              <description>GPIO121 MCU N0-priority interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO120</name>
              <description>GPIO120 MCU N0-priority interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO119</name>
              <description>GPIO119 MCU N0-priority interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO118</name>
              <description>GPIO118 MCU N0-priority interrupt</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO117</name>
              <description>GPIO117 MCU N0-priority interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO116</name>
              <description>GPIO116 MCU N0-priority interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

