AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN0GPIO115</name>
              <description>GPIO115 MCU N0-priority interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO114</name>
              <description>GPIO114 MCU N0-priority interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO113</name>
              <description>GPIO113 MCU N0-priority interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO112</name>
              <description>GPIO112 MCU N0-priority interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO111</name>
              <description>GPIO111 MCU N0-priority interrupt</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO110</name>
              <description>GPIO110 MCU N0-priority interrupt</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO109</name>
              <description>GPIO109 MCU N0-priority interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO108</name>
              <description>GPIO108 MCU N0-priority interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO107</name>
              <description>GPIO107 MCU N0-priority interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO106</name>
              <description>GPIO106 MCU N0-priority interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO105</name>
              <description>GPIO105 MCU N0-priority interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO104</name>
              <description>GPIO104 MCU N0-priority interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO103</name>
              <description>GPIO103 MCU N0-priority interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO102</name>
              <description>GPIO102 MCU N0-priority interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO101</name>
              <description>GPIO101 MCU N0-priority interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO100</name>
              <description>GPIO100 MCU N0-priority interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO99</name>
              <description>GPIO99 MCU N0-priority interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO98</name>
              <description>GPIO98 MCU N0-priority interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO97</name>
              <description>GPIO97 MCU N0-priority interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO96</name>
              <description>GPIO96 MCU N0-priority interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN0INT3STAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000564</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN0GPIO127</name>
              <description>GPIO127 MCU N0-priority interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO126</name>
              <description>GPIO126 MCU N0-priority interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO125</name>
              <description>GPIO125 MCU N0-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO124</name>
              <description>GPIO124 MCU N0-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

