AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN1GPIO99</name>
              <description>GPIO99 MCU N1-priority interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO98</name>
              <description>GPIO98 MCU N1-priority interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO97</name>
              <description>GPIO97 MCU N1-priority interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO96</name>
              <description>GPIO96 MCU N1-priority interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN1INT3CLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x000005D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN1GPIO127</name>
              <description>GPIO127 MCU N1-priority interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO126</name>
              <description>GPIO126 MCU N1-priority interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO125</name>
              <description>GPIO125 MCU N1-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO124</name>
              <description>GPIO124 MCU N1-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO123</name>
              <description>GPIO123 MCU N1-priority interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO122</name>
              <description>GPIO122 MCU N1-priority interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO121</name>
              <description>GPIO121 MCU N1-priority interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO120</name>
              <description>GPIO120 MCU N1-priority interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO119</name>
              <description>GPIO119 MCU N1-priority interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO118</name>
              <description>GPIO118 MCU N1-priority interrupt</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO117</name>
              <description>GPIO117 MCU N1-priority interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO116</name>
              <description>GPIO116 MCU N1-priority interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO115</name>
              <description>GPIO115 MCU N1-priority interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO114</name>
              <description>GPIO114 MCU N1-priority interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO113</name>
              <description>GPIO113 MCU N1-priority interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO112</name>
              <description>GPIO112 MCU N1-priority interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO111</name>
              <description>GPIO111 MCU N1-priority interrupt</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO110</name>
              <description>GPIO110 MCU N1-priority interrupt</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO109</name>
              <description>GPIO109 MCU N1-priority interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

