AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN1GPIO140</name>
              <description>GPIO140 MCU N1-priority interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO139</name>
              <description>GPIO139 MCU N1-priority interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO138</name>
              <description>GPIO138 MCU N1-priority interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO137</name>
              <description>GPIO137 MCU N1-priority interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO136</name>
              <description>GPIO136 MCU N1-priority interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO135</name>
              <description>GPIO135 MCU N1-priority interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO134</name>
              <description>GPIO134 MCU N1-priority interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO133</name>
              <description>GPIO133 MCU N1-priority interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO132</name>
              <description>GPIO132 MCU N1-priority interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO131</name>
              <description>GPIO131 MCU N1-priority interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO130</name>
              <description>GPIO130 MCU N1-priority interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO129</name>
              <description>GPIO129 MCU N1-priority interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO128</name>
              <description>GPIO128 MCU N1-priority interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN1INT4CLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x000005E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN1GPIO159</name>
              <description>GPIO159 MCU N1-priority interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO158</name>
              <description>GPIO158 MCU N1-priority interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO157</name>
              <description>GPIO157 MCU N1-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO156</name>
              <description>GPIO156 MCU N1-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO155</name>
              <description>GPIO155 MCU N1-priority interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO154</name>
              <description>GPIO154 MCU N1-priority interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO153</name>
              <description>GPIO153 MCU N1-priority interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO152</name>
              <description>GPIO152 MCU N1-priority interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO151</name>
              <description>GPIO151 MCU N1-priority interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO150</name>
              <description>GPIO150 MCU N1-priority interrupt</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO149</name>
              <description>GPIO149 MCU N1-priority interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

