AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN1GPIO157</name>
              <description>GPIO157 MCU N1-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO156</name>
              <description>GPIO156 MCU N1-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO155</name>
              <description>GPIO155 MCU N1-priority interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO154</name>
              <description>GPIO154 MCU N1-priority interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO153</name>
              <description>GPIO153 MCU N1-priority interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO152</name>
              <description>GPIO152 MCU N1-priority interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO151</name>
              <description>GPIO151 MCU N1-priority interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO150</name>
              <description>GPIO150 MCU N1-priority interrupt</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO149</name>
              <description>GPIO149 MCU N1-priority interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO148</name>
              <description>GPIO148 MCU N1-priority interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO147</name>
              <description>GPIO147 MCU N1-priority interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO146</name>
              <description>GPIO146 MCU N1-priority interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO145</name>
              <description>GPIO145 MCU N1-priority interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO144</name>
              <description>GPIO144 MCU N1-priority interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO143</name>
              <description>GPIO143 MCU N1-priority interrupt</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO142</name>
              <description>GPIO142 MCU N1-priority interrupt</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO141</name>
              <description>GPIO141 MCU N1-priority interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO140</name>
              <description>GPIO140 MCU N1-priority interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO139</name>
              <description>GPIO139 MCU N1-priority interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO138</name>
              <description>GPIO138 MCU N1-priority interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO137</name>
              <description>GPIO137 MCU N1-priority interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO136</name>
              <description>GPIO136 MCU N1-priority interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO135</name>
              <description>GPIO135 MCU N1-priority interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO134</name>
              <description>GPIO134 MCU N1-priority interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO133</name>
              <description>GPIO133 MCU N1-priority interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

