AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN1GPIO181</name>
              <description>GPIO181 MCU N1-priority interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO180</name>
              <description>GPIO180 MCU N1-priority interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO179</name>
              <description>GPIO179 MCU N1-priority interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO178</name>
              <description>GPIO178 MCU N1-priority interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO177</name>
              <description>GPIO177 MCU N1-priority interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO176</name>
              <description>GPIO176 MCU N1-priority interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO175</name>
              <description>GPIO175 MCU N1-priority interrupt</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO174</name>
              <description>GPIO174 MCU N1-priority interrupt</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO173</name>
              <description>GPIO173 MCU N1-priority interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO172</name>
              <description>GPIO172 MCU N1-priority interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO171</name>
              <description>GPIO171 MCU N1-priority interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO170</name>
              <description>GPIO170 MCU N1-priority interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO169</name>
              <description>GPIO169 MCU N1-priority interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO168</name>
              <description>GPIO168 MCU N1-priority interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO167</name>
              <description>GPIO167 MCU N1-priority interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO166</name>
              <description>GPIO166 MCU N1-priority interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO165</name>
              <description>GPIO165 MCU N1-priority interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO164</name>
              <description>GPIO164 MCU N1-priority interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO163</name>
              <description>GPIO163 MCU N1-priority interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO162</name>
              <description>GPIO162 MCU N1-priority interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO161</name>
              <description>GPIO161 MCU N1-priority interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO160</name>
              <description>GPIO160 MCU N1-priority interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN1INT5CLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x000005F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN1GPIO191</name>
              <description>GPIO191 MCU N1-priority interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO190</name>
              <description>GPIO190 MCU N1-priority interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

