AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCUN1GPIO221</name>
              <description>GPIO221 MCU N1-priority interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO220</name>
              <description>GPIO220 MCU N1-priority interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO219</name>
              <description>GPIO219 MCU N1-priority interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO218</name>
              <description>GPIO218 MCU N1-priority interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO217</name>
              <description>GPIO217 MCU N1-priority interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO216</name>
              <description>GPIO216 MCU N1-priority interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO215</name>
              <description>GPIO215 MCU N1-priority interrupt</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO214</name>
              <description>GPIO214 MCU N1-priority interrupt</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO213</name>
              <description>GPIO213 MCU N1-priority interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO212</name>
              <description>GPIO212 MCU N1-priority interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO211</name>
              <description>GPIO211 MCU N1-priority interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO210</name>
              <description>GPIO210 MCU N1-priority interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO209</name>
              <description>GPIO209 MCU N1-priority interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO208</name>
              <description>GPIO208 MCU N1-priority interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO207</name>
              <description>GPIO207 MCU N1-priority interrupt</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO206</name>
              <description>GPIO206 MCU N1-priority interrupt</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO205</name>
              <description>GPIO205 MCU N1-priority interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO204</name>
              <description>GPIO204 MCU N1-priority interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO203</name>
              <description>GPIO203 MCU N1-priority interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO202</name>
              <description>GPIO202 MCU N1-priority interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO201</name>
              <description>GPIO201 MCU N1-priority interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO200</name>
              <description>GPIO200 MCU N1-priority interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO199</name>
              <description>GPIO199 MCU N1-priority interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO198</name>
              <description>GPIO198 MCU N1-priority interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO197</name>
              <description>GPIO197 MCU N1-priority interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

