AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RESX</name>
              <description>resolution X size</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TEX3BASE</name>
          <description>Base address of the drawing surface 3 (must be word aligned).</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>Image</name>
              <description>3 Base address of the drawing surface</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TEX3STRIDE</name>
          <description>mode and stride.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IMGFMT</name>
              <description>image format</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGBX8888</name>
                  <description>Color Space RGBX means, that the pixel format still has an alpha channel, but it is ignored, and is always set to 255. The RGBX 32 bit RGB format is stored in memory as 8 red bits, 8 green bits, 8 blue bits, and 8 ignored bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA8888</name>
                  <description>Color Space RED GREEN BLUE ALPHA (internal format is always on: 32-bit)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XRGB8888</name>
                  <description>Color Space</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>Color Space In the ARGB (word-order) encoding the intensity of each channel sample is defined by 8 bits, and are arranged in memory in such manner that a single 32-bit unsigned integer has the alpha sample in the highest 8 bits, followed by the red sample, green sample and finally the blue sample in the lowest 8 bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA565</name>
                  <description>Color Space RED(5-bits) GREEN(6-bits) BLUE (5-bits)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA5551</name>
                  <description>Color Space Red,green,blue,alpha (transparency).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L8</name>
                  <description>Color Space Lum8 grayscale</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSC4</name>
                  <description>Color Space Proprietary texture compression</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSC6</name>
                  <description>Color Space Optional proprietary texture compression</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSC6A</name>
                  <description>Color Space Optional proprietary texture compression</description>
                  <value>23</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMGMODE</name>
              <description>image mode</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POINTSAMPLE</name>
                  <description>Texture mapping: rotate, resize and distort a bitmap image.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BILINEARFILTERING</name>
                  <description>Texture mapping: rotate, resize and distort a bitmap image. A method used to smooth textures when displayed larger or smaller than they actually are.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMGSTRD</name>
              <description>image stride (signed) distance in bytes from one scanline to another</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TEX3RES</name>
          <description>Image 3 resolution.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RESY</name>
              <description>resolution Y size</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

