AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>COORDX</name>
              <description>vertex 0 X coordinate (integer value)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLIPMIN</name>
          <description>Clipping rectangle upper left vertex.</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>COORDY</name>
              <description>upper left Y coordinate</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COORDX</name>
              <description>upper left X coordinate</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLIPMAX</name>
          <description>Clipping rectangle bottom right vertex.</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FFF7FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>COORDY</name>
              <description>bottom right Y coordinate</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COORDX</name>
              <description>bottom right X coordinate</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RASTCTRL</name>
          <description>Rasterizer matrix multiplication control</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x05000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD30</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADD</name>
              <description>adds 0.5 to X and Y</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BYPASSMM</name>
              <description>BYPASS_MM, matrix multiplications are bypassed</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD26</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD25</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BYPASS</name>
              <description>BYPASS_VMM, vertx matrix multiplications are bypassed</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DRAWCODEPTR</name>
          <description>FIXME - register description needed here.</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BKGND</name>
              <description>the pointer for the instruction that will be executed for background pixel</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRGND</name>
              <description>the pointer for the instruction that will be executed for foreground pixel</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DRAWPT0X</name>
          <description>X coordinate of Vertex 0 drawing primitive 16, 16 fixed point.</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DRAW0X</name>
              <description>X coordinate</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DRAWPT0Y</name>
          <description>Y coordinate of Vertex 0 drawing primitive 16, 16 fixed point.</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DRAW0Y</name>
              <description>Y coordinate</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

