AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>BLUEX</name>
          <description>Added blue value for each step at x-axis, (16, 16 fixed point)</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BLUEX</name>
              <description>Added blue value for each step at x-axis</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLUEY</name>
          <description>Added blue value for each step at y-axis, (16, 16 fixed point)</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BLUEY</name>
              <description>Added blue value for each step at y-axis</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALFX</name>
          <description>Added alfa value for each step at x-axis, (16, 16 fixed point)</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ALFX</name>
              <description>Added alfa value for each step at x-axis</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALFY</name>
          <description>Added alfa value for each step at y-axis, (16, 16 fixed point)</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ALFY</name>
              <description>Added alfa value for each step at y-axis</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REDINIT</name>
          <description>Red value of STARTXY pixel, (16, 16 fixed point)</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REDXY</name>
              <description>Red value of STARTXY pixel</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GREINIT</name>
          <description>Green value of STARTXY pixel,   (16, 16 fixed point)</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GREENXY</name>
              <description>Green value of STARTXY pixel</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLUINIT</name>
          <description>Blue value of STARTXY pixel, (16, 16 fixed point)</description>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BLUEXY</name>
              <description>Blue value of STARTXY pixel</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALFINIT</name>
          <description>Alfa value of STARTXY pixel, (16, 16 fixed point) Shader Registers</description>
          <addressOffset>0x000001CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ALFXY</name>
              <description>Alfa value of STARTXY pixel</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IDREG</name>
          <description>Fixed value</description>
          <addressOffset>0x000001EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x86362000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GPUID</name>
              <description>Fixed value for GPU ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LOADCTRL</name>
          <description>Load Control</description>
          <addressOffset>0x000001F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF4030105</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LOADCTRL</name>
              <description>Load Control</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

