AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>SSZ1</name>
              <description>Receive audio sample length for phase 1.  0: 8b, 1: 12b, 2: 16b, 3: 20b, 4: 24b, 5: 32b, 6,7: Reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8b</name>
                  <description>Receive audio sample length is 8 bits for phase 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12b</name>
                  <description>Receive audio sample length is 12 bits for phase 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16b</name>
                  <description>Receive audio sample length is 16 bits for phase 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20b</name>
                  <description>Receive audio sample length is 20 bits for phase 1.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24b</name>
                  <description>Receive audio sample length is 24 bits for phase 1.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32b</name>
                  <description>Receive audio sample length is 32 bits for phase 1.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SIOCFG</name>
          <description>Specified polarity and clock configuration of the I2S IPB clocks and IO signals</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01F103F0</resetValue>
          <resetMask>0x0FFFFFF1</resetMask>

          <fields>
            <field>
              <name>FWID</name>
              <description>period of fsync/lr_clk in units of sclks</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRx</name>
              <description>Receive clock edge polarity bit. 0: sdata is sampled on the rising edge of sclk.  1: sdata is sampled on the falling edge of sclk.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MSL</name>
              <description>Master/Slave clock configuration.  0: External clock(sclk and lr_clk provided externally).  1: Internal clock (sclk and lr_clk sourced internally).</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRTX</name>
              <description>Transmit clock edge polarity bit. 0: sdata is transmitted starting from the falling edge of sclk.  1: sdata is transmitted starting from the rising edge of sclk.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSP</name>
              <description>Polarity of fsync/lr_clk signal.  0: Active high.   1: Active low</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FPER</name>
              <description>Frame period in units of sclk. Period is FPER + 1 sclks in length.  0: 1 sclk, 0x3F: 64 sclks</description>
              <bitRange>[15:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEN</name>
              <description>Output enable for SDATA output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>I2SCTL</name>
          <description>Specified polarity and clock configuration of the I2S IPB clocks and IO signals</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000033</resetMask>

          <fields>
            <field>
              <name>I2SVAL</name>
              <description>I2S validity bit mode.  1: RX data stored only when validity mask condition is asserted. 0: No validity mask conditions checking is done.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXRST</name>
              <description>Active high receiver reset signal. 1: Flush the RX FIFO</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXEN</name>
              <description>Receive enable control.  1: Enables capture of serial audio, starting with first channel.  0: No receive data captured. For Full duplex operation, RXEN and TXEN MUST be set in a single register write access, or the Slave FSM may ignore one of the bit-field read-modify-write accesses. TXRST and RXRST must be cleared in advance.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRST</name>
              <description>Transmit reset signal.  1 will reset the TX side registers and flush the TX FIFO.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

