AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit enable signal.  1 will enable the transmission of serial audio. For Full duplex operation, RXEN and TXEN MUST be set in a single register write access, or the Slave FSM may ignore one of the bit-field read-modify-write accesses. TXRST and RXRST must be cleared in advance.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IPBIRPT</name>
          <description>Additional mask and status registers for the IPB core.</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F003F</resetMask>

          <fields>
            <field>
              <name>TXDMAI</name>
              <description>TX dma interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDMAI</name>
              <description>RX dma interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXEI</name>
              <description>TX Empty interrupt. TX unit attempted to read an empty FIFO</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFI</name>
              <description>RX Full interrupt.  RX unit attempted to write to a full FIFO</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFFI</name>
              <description>Transmit fifo low limit interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFFI</name>
              <description>Receive fifo high limit interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDMAM</name>
              <description>Transmit FIFO interrupt mask. Will assert interrupt when = 1 and cimdmareq_tx is asserted</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDMAM</name>
              <description>Receive FIFO interrupt mask. Will assert interrupt when = 1 and cimdmareq_rx is asserted</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXEM</name>
              <description>Transmit FIFO interrupt mask.  Will assert interrupt when = 1 and TXEI is asserted</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFM</name>
              <description>Receive FIFO interrupt mask.  Will assert interrupt when = 1 and RXFI is asserted</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFFM</name>
              <description>Transmit FIFO interrupt mask.  Will assert interrupt when = 1 and TXFFI is asserted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFFM</name>
              <description>Receive FIFO interrupt mask.  Will assert interrupt when = 1 and RXFFI is asserted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IPCOREID</name>
          <description>Returns the core ID of the IPB core, and used to write the I2S validity mask.</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xDA1A0000</resetValue>
          <resetMask>0xFFFF0000</resetMask>

          <fields>
            <field>
              <name>COREFAM</name>
              <description>Core Family.  Also bit 31 is used to set the I2S validity bit when a write is done.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREID</name>
              <description>Core ID of the IPB core</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AMQCFG</name>
          <description>Control the enablement of the ASRC module and the source of the MCLK used in the IPB core.</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>FIXTDM</name>
              <description>FIXTDM bug  1: Enabled.  0: Disabled/Bypassed</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIX8B16B</name>
              <description>FIX8B16B bug  1: Enabled.  0: Disabled/Bypassed</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ASRCEN</name>
              <description>ASRC sub module enable. 0: Enabled.  1: Disabled/Bypassed</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

