AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCLKSRC</name>
              <description>MCLK source.  1: Output of nco_clk divider.  0: MCLK from ambiq clock configuration directly</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTDIV</name>
          <description>Integer divide value for the nco_clk divider</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>INTDIV</name>
              <description>Integer divide value for internal clock divider</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FRACDIV</name>
          <description>Fractional divide value for the nco_clk divider</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FRACDIV</name>
              <description>Fractional divide value for internal clock divider</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Provides clock selection and control for I2S clocks</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000160</resetValue>
          <resetMask>0x001711F1</resetMask>

          <fields>
            <field>
              <name>DIV3</name>
              <description>0: no change to the clock selected by FSEL  1: frequency divide-by-3 of the clock selected by FSEL</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFFSEL</name>
              <description>FUTURE USE  Select the input clock frequency for the ref_clk.  0: HFRC_48MHz  1: HFRC_48MHz_GATED  2: XT_24MHz   3: HFRC2_48MHz</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFCLKEN</name>
              <description>FUTURE USE  Enable for the reference clock</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSEL</name>
              <description>Select the input clock frequency for the MCLK.Whenever changing the clock source here, the MISC_HFRC2FRC bit in the CLKGEN module must first be set. The sequence for changing the clock source regardless of clock selection is to first force HFRC2 on by setting the CLKGEN_MISC_HFRC2FRC bit, select the clock source in this field, clear the CLKGEN_MISC_HFRC2FRC bit only if HFRC2 is NOT selected, and then engage the peripheral.If HFRC2 is the clock source, then shutting the module down cleanly requires switching to HFRC, for example, and then disabling the HFRC2 by clearing the CLKGEN_MISC_HFRC2FRC bit. 0: HFRC2_62MHz  1: HFRC2_31MHz  2: HFRC2_16MHz  3: HFRC2_8MHz  4: HFRC2_4MHz  5: HFRC2_2MHz  6: HFRC2_977KHz  7: HFRC2_488KHz  8: HFRC_24MHz  9: HFRC_12MHz  10: HFRC_6MHz  11: HFRC_3MHz  12: HFRC_1_5MHz  13: HFRC_750KHz  14: HFRC_375KHz  15: XTHS_EXTREF_CLK  16: XTHS_16MHz  17: XTHS_8MHz  18: XTHS_4MHz  19: XTHS_2MHz  20: XTHS_1MHz  21: XTHS_500KHz  22: HFRC_48MHz</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCLKEN</name>
              <description>Enable for the master audio clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>Configuration control of the DMA process, including the direction of DMA, and enablement of DMA</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFF33</resetMask>

          <fields>
            <field>
              <name>NEXTDMAEN</name>
              <description>Enable next DMA job auto-load feature</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXREQCNT</name>
              <description>Number of blocks of samples transferred before asserting the RXREQCNT interrupt signal. A block is 8 samples. The interrupt will assert if enabled and after RXREQCNT blocks of data has been transferred from the I2S into the device. A value of 0 will cause the assertion of the interrupt for every block of transfer done.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXREQCNT</name>
              <description>Number of blocks of samples transferred before asserting the TXREQCNT interrupt signal. A block is 8 samples. The interrupt will assert if enabled and after TXREQCNT blocks of data has been transferred to the I2S module from the device. A value of 0 will cause the assertion of the interrupt for every block of transfer done.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

