AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>TXDMATOTCNT</name>
          <description>Contains the total count of samples to be read and transmitted for the current TX DMA operation. This register is updated as DMA beats complete.</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>TXTOTCNT</name>
              <description>Number of 32b audio samples to transmit</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXDMAADDR</name>
          <description>The address which the DMA operation will fetch the audio samples. This address is updated as the samples are stored.</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TXTARGADDR</name>
              <description>Address bits of the target byte address for source of TX write DMA.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXDMASTAT</name>
          <description>Status of the TX DMA operation currently in progress.</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>TXDMAERR</name>
              <description>TX DMA Error. This active high bit signals an error was encountered during the DMA operation. The bit can be cleared by writing to 0. Once set, this bit will remain set until cleared by software.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDMACPL</name>
              <description>TX DMA Transfer Complete. This signals the end of the DMA operation. This bit can be cleared by writing to 0, and will also be cleared when a new DMA is started.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDMATIP</name>
              <description>TX DMA Transfer In Progress indicator. 1 will indicate that a DMA transfer is active. The DMA transfer may be waiting on data, transferring data, or waiting for priority.
All of these will be indicated with a 1. A 0 will indicate that the DMA is fully complete and no further transactions will be done. This bit is read only.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMAENNEXTCTRL</name>
          <description>To enable next DMA job</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>TXDMAENNEXT</name>
              <description>Indicate to HW the next TX DMA job. TXTARGADDRNEXT and TXTOTCNTNEXT needs to be valid before setting this bit. HW will autoclear this bit when this job is serviced. SW should read back this bit after setting it. If it reads back 0, it means SW can load another set of TXTARGADDRNEXT and TXTOTCNTNEXT and set this bit again. If it reads back 1, it means the HW is servicing a DMA job, and the next DMA job is yet to be loaded. SW needs to wait for TXDMACPL interrupt to setup the next job.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDMAENNEXT</name>
              <description>Indicate to HW the next RX DMA job. RXTARGADDRNEXT and RXTOTCNTNEXT needs to be valid before setting this bit. HW will autoclear this bit when this job is serviced. SW should read back this bit after setting it. If it reads back 0, it means SW can load another set of RXTARGADDRNEXT and RXTOTCNTNEXT and set this bit again. If it reads back 1, it means the HW is servicing a DMA job, and the next DMA job is yet to be loaded. SW needs to wait for RXDMACPL interrupt to setup the next job.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXDMATOTCNTNEXT</name>
          <description>Contains the total count of samples to be stored for the next RX DMA operation.</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>RXTOTCNTNEXT</name>
              <description>Number of 32b audio samples to transfer for next RX DMA.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXDMAADDRNEXT</name>
          <description>The address which the next DMA operation will store the incoming audio samples.</description>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RXTARGADDRNEXT</name>
              <description>Address bits of the target byte address for source of next RX write DMA.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

