AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TXDMACPL</name>
              <description>A TX dma operation has completed</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXREQCNT</name>
              <description>The I2S module has asserted the dma read request, based on TX fifo level.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXREQCNT</name>
              <description>The I2S module has completed RXREQCNT number of DMA transfers of size 8 samples. This interrupt allows servicing of buffers at a programmable location within the overall DMA transfer.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPB</name>
              <description>Interrupt from I2S module</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>RXDMACPL</name>
              <description>A RX dma operation has completed</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDMACPL</name>
              <description>A TX dma operation has completed</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXREQCNT</name>
              <description>The I2S module has asserted the dma read request, based on TX fifo level.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXREQCNT</name>
              <description>The I2S module has completed RXREQCNT number of DMA transfers of size 8 samples. This interrupt allows servicing of buffers at a programmable location within the overall DMA transfer.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPB</name>
              <description>Interrupt from I2S module</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2S0">
      <name>I2S1</name>
      <baseAddress>0x40209000</baseAddress>
      <interrupt>
        <name>I2S1</name>
        <description>I2S1_IRQ</description>
        <value>45</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>IOM0</name>
      <version>1.0</version>
      <description>IO Peripheral Master</description>
      <!-- <groupName>GROUP_IOM</groupName> -->
      <baseAddress>0x40050000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0000038C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IOMSTR0</name>
        <description>IOMSTR0_IRQ</description>
        <value>6</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFO</name>
          <description>Provides direct random access to both input and output fifos. The state of the FIFO is not distured by reading these locations (ie no POP will be done). FIFO0 is accessible from addresses 0x0 - 0x1C, and is used for data outuput from the IOM to external devices. These FIFO locations can be read and written directly.
FIFO locations 0x20 - 0x3C provide read only access to the input fifo. These FIFO locations cannot be directly written by the MCU, and are updated only by the internal hardware. Writes to the FIFO0 will take effect immediately. The currently FIFO pointers
in register FIFOLOC indicate the current offset into each FIFO0 for the read and write operations.
Access to the FIFOs can only be done in word increments; Byte access and writes are not supported.
For push and pop style access to FIFO0 can be done using the FIFOPOP and FIFOPUSH registers below.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>FIFO direct access. Only locations 0 - 3F will return valid information.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPTR</name>
          <description>Provides the current valid byte count of data within the FIFO as seen from the internal state machines. FIFO0 is dedicated to outgoing transactions and FIFO1 is dedicated to incoming transactions. All counts are specified in units of bytes.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO1REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

