AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>POPWR</name>
              <description>Selects the mode in which 'pop' events are done for the fifo read operations. A value of '1' will prevent a pop event on a read operation, and will require a write to the FIFOPOP register to create a pop event.
A value of '0' in this register will allow a pop event to occur on the read of the FIFOPOP register, and may cause inadvertant fifo pops when used in a debugging mode.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLOC</name>
          <description>Provides a read only value of the current read and write pointers. This register is read only and can be used alogn with the FIFO direct access method to determine the next data to be used for input and output functions.</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000F0F</resetMask>

          <fields>
            <field>
              <name>FIFORPTR</name>
              <description>Current FIFO read pointer. Used to index into the incoming FIFO (FIFO1), which is used to store read data returned from external devices during a read operation.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOWPTR</name>
              <description>Current FIFO write pointer. Value is the index into the outgoing FIFO (FIFO0), which is used during write operations to external devices.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Provides clock related controls used internal to the BLEIF module, and enablement of 32KHz clock to the BLE Core module. The internal clock sourced is selected via the FSEL and can be further divided by 3 using the DIV3 control.
This register is also used to enable the clock, which must be done prior to performing any IO transactions.</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF3F01</resetMask>

          <fields>
            <field>
              <name>TOTPER</name>
              <description>Clock total clock count minus 1. This provides the total period of the divided clock -1 when the DIVEN is active. The
source clock is selected by FSEL. Only applicable when DIVEN = 1.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOWPER</name>
              <description>Clock low clock count minus 1. This provides the number of clocks the divided clock will be low when the DIVEN = 1.
Only applicable when DIVEN = 1.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DIVEN</name>
              <description>Enable clock division by TOTPER and LOWPER</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TOTPER division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable TOTPER division.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV3</name>
              <description>Enable divide by 3 of the source IOCLK. Division by 3 is done before the DIVEN programmable divider, and if enabled
will provide the divided by 3 clock as the source to the programmable divider.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Select divide by 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Select divide by 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSEL</name>
              <description>Select the input clock frequency.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_375KHz</name>
                  <description>Selects the minimum power clock. This setting should be used whenever the IOM is not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Selects static 0 as the input clock.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHZ</name>
                  <description>Selects the HFRC 48MHz as the input clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHZ</name>
                  <description>Selects the HFRC 24MHz as the input clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHZ</name>
                  <description>Selects the HFRC 12MHz as the input clock.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHZ</name>
                  <description>Selects the HFRC 6MHz as the input clock.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_3MHZ</name>
                  <description>Selects the HFRC 3MHz as the input clock.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_1p5MHZ</name>
                  <description>Selects the HFRC 1.5MHz as the input clock.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_750KHz</name>
                  <description>Selects the HFRC 750KHz as the input clock.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOCLKEN</name>
              <description>Enable for the interface clock. Must be enabled prior to executing any IO operations.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

