AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SUBMODCTRL</name>
          <description>Provides enable for each submodule. Only a sigle submodule can be enabled at one time.</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SMOD1TYPE</name>
              <description>Submodule 1 module type. This is the I2C Master interface</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI</name>
                  <description>SPI Master submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MI2C</name>
                  <description>MI2C submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPI</name>
                  <description>SPI Slave submodule</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SI2C</name>
                  <description>I2C Slave submodule</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD1EN</name>
              <description>Submodule 1 enable (1) or disable (0)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SMOD0TYPE</name>
              <description>Submodule 0 module type. This is the SPI Master interface.</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI</name>
                  <description>MSPI submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MI2C</name>
                  <description>I2C Master submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD0EN</name>
              <description>Submodule 0 enable (1) or disable (0)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Writes to this register will start an IO transaction, as well as set various parameters for the command itself. Reads will return the command value written to the CMD register.
To read the number of bytes that have yet to be transferred, refer to the CTSIZE field within the CMDSTAT register.</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF3FFFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETLO</name>
              <description>This register holds the low order byte of offset to be used in the transaction. The number of offset bytes to use is set with bits 1:0 of the command.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSEL</name>
              <description>Command Specific selection information. Not used in Master I2C. Used as CEn select for Master SPI transactions</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSIZE</name>
              <description>Defines the transaction size in bytes. The offset transfer is not included in this size.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONT</name>
              <description>Contine to hold the bus after the current transaction if set to a 1 with a new command issued.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OFFSETCNT</name>
              <description>Number of offset bytes to use for the command - 0, 1, 2, 3, 4, 5  are valid selections. The second (byte 1),third (byte 2), and forth (byte 3)  are read from the OFFSETHI register, and the low order byte is pulled from this register in the OFFSETLO field.
Offset bytes are transmitted highest byte first.  EG if offsetcnt == 4, OFFSETHI[23:16] will be transmitted first, then OFFSETHI[15:8], then OFFSETHI[7:0] then OFFSETLO.
If offsetcnt == 5, OFFSETHI[31:24] will be transmitted, then OFFSETHI[23:0], then OFFSETLO.
If offsetcnt == 4, OFFSETHI[23:16] will be transmitted, then OFFSETHI[15:0], then OFFSETLO.
If offsetcnt == 3, OFFSETHI[15:8] will be transmitted, then OFFSETHI[7:0], then OFFSETLO.
If offsetcnt == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.
If offsetcnt == 1, only OFFSETLO will be transmitted.
Offset bytes are always transmitted MSB first, regardless of the value of the LSB control bit within the module configuration.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

