AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>CMD</name>
              <description>Command for submodule.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMW</name>
                  <description>SPI only. Test mode to do constant write operations. Useful for debug and power measurements. Will continually send data in OFFSET field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR</name>
                  <description>SPI Only. Test mode to do constant read operations. Useful for debug and power measurements. Will continually read data from external input</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCXCTRL</name>
          <description>Enables transmission of DCX signal with SPI transactions and selects which CE signals will be used to transmit the DCX signal.</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DCXEN</name>
              <description>Global enable of the DCX function. Setting to 1 will enable the generation of the DCX signal, which will assert when sending the offset bytes of the SPI transaction.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCXSEL</name>
              <description>Selects the CE channel used to convey the DCX function. The select is bitwise encoded, with bit 0 = 1 enabling CE0 for DCX transmission, bit 1 = 1 enableing CE1 for DCX transmission, etc. If the CE used for the SPI transaction is set, it will be ignored and used as the transaction CE instead. Multiple CE channels can be selected at once. To enable the DCX signal to be transmitted out of the chip, the corresponding pin mux function must be enabled in the GPIO logic as well.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETHI</name>
          <description>High order bytes of offset for IO transaction</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETHI</name>
              <description>Holds the high order bytes of the byte addressing/offset field to use with IO commands. The number of offset bytes to use is specified in the command register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTAT</name>
          <description>Provides staus on the execution of the command currently in progress. The fields in this register will reflect the real time status of the internal state machines and data transfers within the IOM.
These are read only fields and writes to the registers are ignored.</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>CTSIZE</name>
              <description>The current number of bytes still to be transferred with this command. This field will count down to zero.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSTAT</name>
              <description>The current status of the command execution.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error encountered with command</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Actively processing command</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state, no active command, no error</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Command in progress, but waiting on data from host</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCMD</name>
              <description>current command that is being executed</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

