AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOINTCTL</name>
          <description>I/O Interrupt Control</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF01FFFF</resetMask>

          <fields>
            <field>
              <name>IOINTSET</name>
              <description>These bits set the IOINT interrupts when written with a 1.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINTCLR</name>
              <description>This bit clears all of the IOINT interrupts when written with a 1.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINT</name>
              <description>These bits read the IOINT interrupts.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINTEN</name>
              <description>These read-only bits indicate whether the IOINT interrupts are enabled.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GENADD</name>
          <description>General Address Data</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>GADATA</name>
              <description>The data supplied on the last General Address reference.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADDPTR</name>
          <description>Address pointer</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>ADDPTR</name>
              <description>The current value in the Address pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>Configuration control of the DMA process, including the direction of DMA, and enablement of DMA</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF0703</resetMask>

          <fields>
            <field>
              <name>FRCRDWRT</name>
              <description>Select DMA transfer force direction</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRCWRT</name>
                  <description>Force DMA transfer write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCRD</name>
                  <description>Force DMA transfer read</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCDMA</name>
              <description>Force DMA transfer read/write independent of R/W bit in interface command</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFORCE</name>
                  <description>Do not force read/write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE</name>
                  <description>Force DMA read or DMA write, depending on FRCRDWRT bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PADBYTEEN</name>
              <description>PAD byte enable.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PAD Byte Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PAD Byte Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PADBYTE</name>
              <description>PAD byte value.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAQUAD</name>
              <description>Sets the Priority of the DMA request</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Transfer one word per DMA request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD</name>
                  <description>Transfer up to four words per DMA request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPWROFF</name>
              <description>Power off module after DMA is complete. If this bit is active, the module will request to power off the supply it is attached to. If there are other units still requiring power from the same domain, power down will not be performed.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power off disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power off enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAPRI</name>
              <description>Sets the Priority of the DMA request</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADIR</name>
              <description>Direction</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P2M</name>
                  <description>Peripheral to Memory (SRAM) transaction. To be set when doing DMA read operations, ie reading data from external devices.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2P</name>
                  <description>Memory to Peripheral transaction. To be set when doing DMA write operations, ie writing data to external devices.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable. Setting this bit to EN will start the DMA operation. This should be the last DMA related register set prior to issuing the command</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable DMA Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable DMA Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATOTCOUNT</name>
          <description>Contains the number of bytes to be transferred for this DMA transaction. This register is decremented as the data is transferred.</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>XFRCOUNT</name>
              <description>This bitfield holds the number of bytes transferred on the interface.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

