AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="IOSLAVEFD0">
      <name>IOSLAVEFD1</name>
      <baseAddress>0x40036000</baseAddress>
      <interrupt>
        <name>IOSLAVEFD1</name>
        <description>IOSLAVEFD1_IRQ</description>
        <value>98</value>
      </interrupt>      <interrupt>
        <name>IOSLAVEFDACC1</name>
        <description>IOSLAVEFDACC1_IRQ</description>
        <value>99</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>IOSLAVE</name>
      <version>1.0</version>
      <description>I2C/SPI Slave</description>
      <!-- <groupName>GROUP_IOSLAVE</groupName> -->
      <baseAddress>0x40034000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000220</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IOSLAVE</name>
        <description>IOSLAVE_IRQ</description>
        <value>4</value>
      </interrupt>      <interrupt>
        <name>IOSLAVEACC</name>
        <description>IOSLAVEACC_IRQ</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFOPTR</name>
          <description>Current FIFO Pointer</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>FIFOSIZ</name>
              <description>The number of bytes currently in the hardware FIFO.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOPTR</name>
              <description>Current FIFO pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCFG</name>
          <description>FIFO Configuration</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0x3F003F1F</resetMask>

          <fields>
            <field>
              <name>ROBASE</name>
              <description>Defines the read-only area. The IO Slave read-only area is situated in LRAM at (ROBASE*8) to (FIFOBASE*8-1)</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOMAX</name>
              <description>These bits hold the maximum FIFO address in 8 byte segments. It is also the beginning of the RAM area of the LRAM. Note that no RAM area is configured if FIFOMAX is set to 0x1F.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOBASE</name>
              <description>These bits hold the base address of the I/O FIFO in 8 byte segments. The IO Slave FIFO is situated in LRAM at (FIFOBASE*8) to (FIFOMAX*8-1).</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTHR</name>
          <description>FIFO Threshold Configuration</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>FIFOTHR</name>
              <description>FIFO size interrupt threshold.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FUPD</name>
          <description>FIFO Update Status</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>IOREAD</name>
              <description>This bitfield indicates an IO read is active.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

