AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>FIFOUPD</name>
              <description>This bit indicates that a FIFO update is underway.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCTR</name>
          <description>Overall FIFO Counter</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>FIFOCTR</name>
              <description>Virtual FIFO byte count</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOINC</name>
          <description>Overall FIFO Counter Increment</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>FIFOINC</name>
              <description>Increment the Overall FIFO Counter by this value on a write</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>I/O Slave Configuration</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x801FFF17</resetMask>

          <fields>
            <field>
              <name>IFCEN</name>
              <description>IOSLAVE interface enable.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the IOSLAVE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the IOSLAVE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRAPPTR</name>
              <description>Address pointer wrap mode enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOWRAP</name>
                  <description>Address pointer does not wrap around to FIFOBASE*8 after it reaches FIFOMAX*8-1. Additionally, the address pointer does not automatically skip Direct Area locations 0x78 to 0x7F, so care must be taken that the host does not inadvertently write to the Host Registers during a data transfer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP</name>
                  <description>Address pointer wraps around to FIFOBASE*8 after it reaches FIFOMAX*8-1 to accommodate any length transfers.  In addition, the address pointer automatically skips Direct Area locations 0x78 to 0x7F (if the FIFO Area encompasses these locations) to avoid writing to the Host Registers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CADDR</name>
              <description>7-bit or 10-bit I2C device address.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STARTRD</name>
              <description>This bit holds the cycle to initiate an I/O RAM read.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LATE</name>
                  <description>Initiate I/O RAM read late in each transferred byte.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EARLY</name>
                  <description>Initiate I/O RAM read early in each transferred byte.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSB</name>
              <description>This bit selects the transfer bit ordering.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSB_FIRST</name>
                  <description>Data is assumed to be sent and received with MSB first.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSB_FIRST</name>
                  <description>Data is assumed to be sent and received with LSB first.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOL</name>
              <description>This bit selects SPI polarity.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_MODES_0_3</name>
                  <description>Polarity 0, handles SPI modes 0 and 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_MODES_1_2</name>
                  <description>Polarity 1, handles SPI modes 1 and 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFCSEL</name>
              <description>This bit selects the I/O interface.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>Selects I2C interface for the IO Slave.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>Selects SPI interface for the IO Slave.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRENC</name>
          <description>I/O Slave Interrupt Priority Encode</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>PRENC</name>
              <description>These bits hold the priority encode of the REGACC interrupts.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

