AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MCUCTRL</name>
      <version>1.0</version>
      <description>MCU Miscellaneous Control Logic</description>
      <!-- <groupName>GROUP_MCUCTRL</groupName> -->
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000004EC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BROWNOUT</name>
        <description>BROWNOUT_IRQ</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CHIPPN</name>
          <description>Chip Information</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10320088</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>

          <fields>
            <field>
              <name>PN</name>
              <description>Apollo family device type.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO5</name>
                  <description>Apollo5 part number is 0x10xxxxxx.</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRAMSIZE</name>
              <description>MRAM size. Please use the SKU register for determining memory sizing.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4MB</name>
                  <description>MRAM size is 4MB.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3MB</name>
                  <description>MRAM size is 3MB.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MB</name>
                  <description>MRAM size is 2MB.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MB</name>
                  <description>MRAM size is 1MB.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSIZE</name>
              <description>SRAM size. Please use the SKU register for determining memory sizing.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM256K_DTCM512K_SSRAM3M</name>
                  <description>ITCM=256KB, DTCM=512KB, SSRAM=3MB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM256K_DTCM512K_SSRAM2M</name>
                  <description>ITCM=256KB, DTCM=512KB, SSRAM=2MB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM128K_DTCM256K_SSRAM2M</name>
                  <description>ITCM=128KB, DTCM=256KB, SSRAM=2MB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM128K_DTCM256K_SSRAM1M</name>
                  <description>ITCM=128KB, DTCM=256KB, SSRAM=1MB</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMAJ</name>
              <description>Major revision. Please use the CHIPREV register for device identification.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

