AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>REVMIN</name>
              <description>Minor revision. Please use the CHIPREV register for device identification.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKG</name>
              <description>Package type.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PINS</name>
              <description>Number of pins for this package.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINS274</name>
                  <description>The number of pins = 274</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINS231</name>
                  <description>The number of pins = 231</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temperature.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD</name>
              <description>This field is reserved.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID0</name>
          <description>Unique Chip ID 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHIPID0</name>
              <description>Unique chip ID 0. For APOLLO CHIPID0 value is 0x0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID1</name>
          <description>Unique Chip ID 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHIPID1</name>
              <description>Unique chip ID 1. For APOLLO CHIPID1 value is 0x0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Chip Revision</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000021</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>SIPART</name>
              <description>Silicon Part ID</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REVMAJ</name>
              <description>Major Revision ID.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C</name>
                  <description>Apollo5 revision C</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Apollo5 revision B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Apollo5 revision A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMIN</name>
              <description>Minor Revision ID.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV2</name>
                  <description>Apollo5 minor rev 2.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV1</name>
                  <description>Apollo5 minor rev 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV0</name>
                  <description>Apollo5 minor rev 0. Minor revision value, succeeding minor revisions will increment from this value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VENDORID</name>
          <description>Unique Vendor ID</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VENDORID</name>
              <description>Unique Vendor ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMBIQ</name>
                  <description>Ambiq Vendor ID 'AMBQ'</description>
                  <value>1095582289</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default Vendor ID</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SKU</name>
          <description>Unique Chip SKU</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x002D480F</resetValue>
          <resetMask>0x003FFFCF</resetMask>

          <fields>
            <field>
              <name>SKUMVE</name>
              <description>MVE feature
0x0: no MVE
0x1: Integer MVE only
0x2: Integer and Floating Point MVE supported (note that with this setting, FPU must be enabled)</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

