AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>SKUFPU</name>
              <description>FPU feature
0x0: no FPU
0x1: Has FPU</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUDTCM</name>
              <description>DTCM size feature
0x8: 128KB
0x9: 256KB
0xA: 512KB</description>
              <bitRange>[18:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUITCM</name>
              <description>ITCM size feature
0x6: 32KB
0x8: 128KB
0x9: 256KB</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUSECURESPOT</name>
              <description>Secure boot feature</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUUSB</name>
              <description>USB available</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUGFX</name>
              <description>GFX available</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUMIPIDSI</name>
              <description>MIPI DSI available</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUTURBOSPOT</name>
              <description>High performance mode for MCU and DSPs.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUMRAMSIZE</name>
              <description>MRAM size SKU. All of 4MB Available by default. Memory SU disabled
0x0: 1MB
0x1: 2MB
0x2: 3MB
0x3: 4MB</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUSRAMSIZE</name>
              <description>SRAM SKU dictates the available memory for MCU. All of the MCU TCM (384KB) and System SRAM (2MB) available by default. Memory SU disabled
0x0: SRAM 1MB (SSRAM0 only)
0x1: SSRAM 2MB (SSRAM0 and SSRAM1)
0x2: Reserve
0x3: SSRAM 3MB (SSRAM0, SSRAM1 and SSRAM2)</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SKUOVERRIDE</name>
          <description>Override register for Chip SKU</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x002D480F</resetValue>
          <resetMask>0x003FFBCF</resetMask>

          <fields>
            <field>
              <name>CFGMVE</name>
              <description>MVE feature</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGFPU</name>
              <description>FPU feature</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGDTCMSZ</name>
              <description>DTCM size feature (only 3 DTCM configurations are allowed: 0x8 - 128K, 0x9 - 256K, 0xA - 512K)</description>
              <bitRange>[18:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CFGITCMSZ</name>
              <description>ITCM size feature (only 3 ITCM configurations are allowed: 0x6 - 32K, 0x8 - 128K, 0x9 - 256K)</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUUSB</name>
              <description>Override for usb sku</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUGFX</name>
              <description>Override for gfx sku</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUMIPIDSI</name>
              <description>Override for mipi dsi sku</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUTURBOSPOT</name>
              <description>Override for turbo spot sku</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUMRAMSIZE</name>
              <description>Override for mram size sku</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUSRAMSIZE</name>
              <description>Override for sram size sku</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGGER</name>
          <description>Debugger Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LOCKOUT</name>
              <description>Lockout of debugger (SWD).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

