AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ACRG</name>
          <description>Active Current Reference Generator Control</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000078</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>ACRGTRIM</name>
              <description>ACRG Trim value</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACRGIBIASSEL</name>
              <description>Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect. The inversion of this register is driven to analog.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGSEL</name>
                  <description>Selects the bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCRGSEL</name>
                  <description>Selects the CCRG</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACRGPWD</name>
              <description>Power down the ACRG.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACRG_PWR_DN</name>
                  <description>Powers down the ACRG trim.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACRG_PWR_UP</name>
                  <description>Power up the ACRG trim.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACRGSWE</name>
              <description>Software enablement for ACRG register. A value of 1 will allow writes to the register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VREFGEN2</name>
          <description>Voltage Reference Generator 2 Control</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFC0</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>TVRGCCURRENTTRIM</name>
              <description>TVRGC Current trim init value</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGCHSENRESDIV</name>
              <description>TVRGC hsenable resdiv init value</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGCPDNB</name>
              <description>TVRGC pdnb init value</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGCSELVREF</name>
              <description>TVRGC sel vref init value</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGCTEMPCOTRIM</name>
              <description>TVRGC tempcompensation trim init value</description>
              <bitRange>[11:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGCVREFTRIM</name>
              <description>Calibrated Voltage Reference Generator tc trim (bottom transistor)</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VREFGEN4</name>
          <description>Voltage Reference Generator 4 Control</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x001FEFC0</resetValue>
          <resetMask>0x001FFFFF</resetMask>

          <fields>
            <field>
              <name>TVRGFCURRENTTRIM</name>
              <description>TVRGF Current trim init value</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGFHSENRESDIV</name>
              <description>TVRGF hsenable resdiv init value</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGFPDNB</name>
              <description>TVRGF pdnb init value</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGFPWLTEMPCOTRIM</name>
              <description>Calibrated Voltage Reference Generator pwl tc trim (bottom transistor)</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGFSELVREF</name>
              <description>TVRGF sel vref init value</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGFTEMPCOTRIM</name>
              <description>TVRGF tempo trim init value</description>
              <bitRange>[11:7]</bitRange>
              <access>read-write</access>

