AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TVRGFVREFTRIM</name>
              <description>TVRGF Voltage Reference Generator trim (bottom transistor)</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VREFBUF</name>
          <description>Voltage Reference BUF Control</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>

          <fields>
            <field>
              <name>VREFBUFCCOMPTRIM</name>
              <description>VREFBUF ccomp trim init value</description>
              <bitRange>[16:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VREFBUFIBIASTRIM</name>
              <description>VREFBUFIBIAS trim init value</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VREFBUFMISCTRIM</name>
              <description>VREFBUF MISC trim init value</description>
              <bitRange>[12:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VREFBUFPDNB</name>
              <description>VREGBUF pdnb init value</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VREFBUFVOLTTRIM</name>
              <description>VREFBUF voltage trim init value</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRCTRL</name>
          <description>Overrides for Voltage Regulators Controls</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKACTIVE</name>
              <description>SIMO BUCK ACTIVE control. Override for PWRCTRL going to analog when SIMOBUCKOVER = 1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKRSTB</name>
              <description>SIMO BUCK RSTB control. Override for PWRCTRL going to analog when SIMOBUCKOVER = 1</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKPDNB</name>
              <description>SIMO BUCK PDNB control. Override for PWRCTRL going to analog when SIMOBUCKOVER = 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKOVER</name>
              <description>Override control for SIMO BUCK signals</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ANALDOACTIVE</name>
              <description>ANALDO LDO ACTIVE control. Override for PWRCTRL going to analog when ANALDOOVER = 1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ANALDOPDNB</name>
              <description>ANALDO PDNB control. Override for PWRCTRL going to analog when ANALDOOVER = 1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ANALDOOVER</name>
              <description>Override control for ANALDO signals</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOACTIVE</name>
              <description>MEM LP LDO ACTVIVE control. Override for PWRCTRL going to analog when MEMLPLDOOVER = 1</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOPDNB</name>
              <description>MEM LP LDO PDNB control. Override for PWRCTRL going to analog when MEMLPLDOOVER = 1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOOVER</name>
              <description>Override control for MEM LP LDO signals</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOCOLDSTARTEN</name>
              <description>MEM LDO COLDSTART EN control. This is a shadow backed register and no need to set MEMLDOOVER.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOACTIVE</name>
              <description>MEM LDO ACTIVE control. Override for PWRCTRL going to analog when MEMLDOOVER = 1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOACTIVEEARLY</name>
              <description>MEM LDO EARLY ACTIVE control. Override for PWRCTRL going to analog when MEMLDOOVER = 1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOPDNB</name>
              <description>MEM LDO PDNB control. Override signal for PWRCTRL going to analog when MEMLDOOVER = 1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

