AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>XTALIBUFTRIM</name>
              <description>XTAL IBUFF trim</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALCOMPPDNB</name>
              <description>XTAL Oscillator Power Down Comparator.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUPCOMP</name>
                  <description>Power up XTAL oscillator comparator.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDNCOMP</name>
                  <description>Power down XTAL oscillator comparator.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALPDNB</name>
              <description>XTAL Oscillator Power Down Core.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUPCORE</name>
                  <description>Power up XTAL oscillator core.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDNCORE</name>
                  <description>Power down XTAL oscillator core.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALCOMPBYPASS</name>
              <description>XTAL Oscillator Bypass Comparator.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USECOMP</name>
                  <description>Use the XTAL oscillator comparator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPCOMP</name>
                  <description>Bypass the XTAL oscillator comparator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALCOREDISFB</name>
              <description>XTAL Oscillator Disable Feedback.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable XTAL oscillator comparator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable XTAL oscillator comparator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALSWE</name>
              <description>XTAL Software Override Enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>XTAL Software Override Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>XTAL Software Override Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALGENCTRL</name>
          <description>XTAL Oscillator General Control</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000001E0</resetValue>
          <resetMask>0x00003FFF</resetMask>

          <fields>
            <field>
              <name>XTALKSBIASTRIM</name>
              <description>XTAL IBIAS Kick start trim. This trim value is used during the startup process to enable a faster lock.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALBIASTRIM</name>
              <description>XTAL BIAS trim</description>
              <bitRange>[7:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACWARMUP</name>
              <description>Auto-calibration delay control</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC1</name>
                  <description>Warmup period of 1-2 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC2</name>
                  <description>Warmup period of 2-4 seconds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC4</name>
                  <description>Warmup period of 4-8 seconds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC8</name>
                  <description>Warmup period of 8-16 seconds</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALHSTRIMS</name>
          <description>XTALHS Trims</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0311F12C</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>

          <fields>
            <field>
              <name>XTALHSSPARE</name>
              <description>xtalhs_spare</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

