AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>XTALHSRSTRIM</name>
              <description>xtalhs_rs_trim</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBIASTRIM</name>
              <description>xtalhs_ibias_trim</description>
              <bitRange>[27:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBIASCOMPTRIM</name>
              <description>xtalhs_ibias_comp_trim</description>
              <bitRange>[20:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBIASCOMP2TRIM</name>
              <description>xtalhs_ibias_comp2_trim</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSDRIVERSTRENGTH</name>
              <description>xtalhs_driver_strength</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSDRIVETRIM</name>
              <description>xtalhs_drive_trim</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCAPTRIM</name>
              <description>xtalhs_cap_trim</description>
              <bitRange>[9:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCAP2TRIM</name>
              <description>xtalhs_cap2_trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>XTALHSCTRL</name>
          <description>XTALHS Control</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>XTALHSEXTERNALCLOCK</name>
              <description>xtalhs_external_clock</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSPADOUTEN</name>
              <description>xtalhs_padout_en</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSSELRCOM</name>
              <description>xtalhs_sel_rcom</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSPDNPNIMPROVE</name>
              <description>xtalhs_pdn_pn_improve</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSINJECTIONENABLE</name>
              <description>xtalhs_injection_enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBSTENABLE</name>
              <description>xtalhs_ibst_enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCOMPSEL</name>
              <description>xtalhs_comp_sel</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCOMPPDNB</name>
              <description>xtalhs_comp_pdnb</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSPDNB</name>
              <description>xtalhs_pdnb</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BGTLPCTRL</name>
          <description>LP Bandgap Control</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000E0820</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>BGTLPQUICKCHB</name>
              <description>bgtlp_quickch_b</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTLPBYPASSB</name>
              <description>bgtlp_bypass_b</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTLPVBG2P5TRIM</name>
              <description>BGTLP vbg2p5 trim</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTLPCTATTRIM</name>
              <description>BGTLP ctat trim</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTLPPTATTRIM</name>
              <description>BGTLP ptat trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MRAMCRYPTOPWRCTRL</name>
          <description>MRAM Crypto Power Control</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000033F</resetMask>

          <fields>
            <field>
              <name>CRYPTOCLKGATEN</name>
              <description>crypto clk gating enable configuration</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Crypto clk gating is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Crypto clk gating is disabled at default.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTOPWRDOWREADY</name>
              <description>Crypto power down is ready, sw can pwd down the crypto through power ctrl</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Indicate Crypto is ready for power down</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Indicate Crypto is not ready for power down.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRAM1PWRCTRL</name>
              <description>MRAM1 low power mode control. When set to 1, tmc_lpr and tmc_slp are driven by the value of MRAM1LPREN and MRAM1SLPEN of this register.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

