AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MRAM1SLPEN</name>
              <description>MRAM1 sleep mode enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAM1LPREN</name>
              <description>MRAM1 low power mode enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAM0PWRCTRL</name>
              <description>MRAM0 low power mode control. When set to 1, tmc_lpr and tmc_slp are driven by the value of MRAM0LPREN and MRAM0SLPEN of this register.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAM0SLPEN</name>
              <description>MRAM0 sleep mode enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAM0LPREN</name>
              <description>MRAM0 low power mode enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BODISABLE</name>
          <description>Brownout Disable</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BODCLVREN</name>
              <description>Disable VDDC_LV Brown Out reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDC_LV Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDC_LV Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODSREN</name>
              <description>Disable VDDS Brown Out reset.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDS Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDS Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODFREN</name>
              <description>Disable VDDF Brown Out reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDF Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDF Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODCREN</name>
              <description>Disable VDDC Brown Out reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDC Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDC Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODLRDE</name>
              <description>Disable Unregulated 1.8V Brown-out reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Unregulated 1.8v brown out reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Unregulated 1.8v brown out reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D2ASPARE</name>
          <description>Spare registers to analog module</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00018000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>D2ASPARE</name>
              <description>D2A Spare signals (shadow loaded)
::D2ASPARE Bit21:pll isolation for VDDH, VDDF; Bit22-25:When set, it will force uart0/1/2/3_gate.clken to be 1, making uart0/1/2/3.pclk to be always-on; Bit31: When set, it will fix CAB-1444 arbitration logic bug;</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

