AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOADER</name>
          <description>Bootloader and secure boot functions</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFC00000F</resetMask>

          <fields>
            <field>
              <name>SECBOOTONRST</name>
              <description>Indicates whether the secure boot on warm reset is enabled</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOT</name>
              <description>Indicates whether the secure boot on cold reset is enabled</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOTFEATURE</name>
              <description>Indicates whether the secure boot feature is enabled.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBLLOCK</name>
              <description>Secure boot loader lock. Always resets to 1, write 1 to clear. Enables system visibility to bootloader until set.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Disable the secure boot lock</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROTLOCK</name>
              <description>Flash protection lock. Always resets to 1, write 1 to clear. Enables writes to flash protection register set.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBRLOCK</name>
              <description>Secure boot ROM lock. Always resets to 1, write 1 to clear. Enables system visibility to bootloader until set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD0</name>
              <description>This field is reserved and must not be modified.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SHADOWVALID</name>
          <description>Register to indicate whether the shadow registers have been successfully loaded from the Flash Information Space.</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00001FDB</resetMask>

          <fields>
            <field>
              <name>OTPBOOTFAULT</name>
              <description>OTP interrupt status during shadow copy</description>
              <bitRange>[12:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>power_fault</name>
                  <description>Indicate OTP Power fault</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>output_data</name>
                  <description>Conflict on OTP output data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input_parity</name>
                  <description>input parity check error</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>metal_shielding</name>
                  <description>metal shielding fault</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fsm_error</name>
                  <description>fsm parity error</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>reg_error</name>
                  <description>critical reg  parity error</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_error</name>
                  <description>No OTP interrupt happens during boot stage</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTPREADY</name>
              <description>Whether OTP is ready for access</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Indicate OTP is ready for access</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INFO0SELOTP</name>
              <description>Select OTP Info0 or MRAM Info0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Indicate select OTP Info0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value, Select MRAM Info0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INFO1SELOTP</name>
              <description>Select OTP Info1 or MRAM Info1.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Indicate selector OTP Info1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value, Indicate select MRAM Info1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPINORSLEEPn</name>
              <description>Indicates whether the bootloader should sleep or spin if no image loaded.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPIN</name>
                  <description>Bootloader will spin when there is no image loaded.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Bootloader will go to normal sleep when there is no image loaded.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Indicates whether the shadow registers contain valid data from the Flash Information Space.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Flash information space contains valid data.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH0</name>
          <description>Scratch register that is not reset by any reset</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SCRATCH0</name>
              <description>Scratch register 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

