AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH1</name>
          <description>Scratch register that is not reset by any reset</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SCRATCH1</name>
              <description>Scratch register 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DBGR1</name>
          <description>Read-only debug 1</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12345678</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ONETO8</name>
              <description>Read-only register for communication validation</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DBGR2</name>
          <description>Read-only debug 2</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC001C0DE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>COOLCODE</name>
              <description>Read-only register for communication validation</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WICCONTROL</name>
          <description>This register is responsible for WIC Control and Configuration</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DEEPISWIC</name>
              <description>Indicates SLEEPDEEP is WIC SLEEP or Normal SLEEP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEPDEEP_IS_REGULAR_SLEEP</name>
                  <description>When de-asserted, SCR.SLEEPDEEP is set and the processor core is in sleep, the processor does not enter WIC sleep, and the processor must stay powered-up.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEPDEEP_IS_WIC_SLEEP</name>
                  <description>When asserted, SCR.SLEEPDEEP is set and the processor core is in sleep, the processor enters WIC sleep and the clock and power can both be removed from the processor.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug subsystem Control. Determines the debug components enable and clk frequency.</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00004105</resetValue>
          <resetMask>0x0000710F</resetMask>

          <fields>
            <field>
              <name>DBGTSCLKSEL</name>
              <description>This field selects the frequency of the ARM M55 dbg ts port.</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWPWR</name>
                  <description>Low power state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV2</name>
                  <description>Selects HFRC divided by 2 as the source dbg ts clk</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV8</name>
                  <description>Selects HFRC divided by 8 as the source dbg ts clk</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV16</name>
                  <description>Selects HFRC divided by 16 as the source dbg ts clk</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCDIV32</name>
                  <description>Selects HFRC divided by 32 as the source dbg ts clk</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGETBENABLE</name>
              <description>Debug subsystem ETB enable to store the trace data.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable ETB.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable ETB.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGTPIUCLKSEL</name>
              <description>This field selects the frequency of the ARM TPIU port.</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Low power state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>Selects HFRC 48Mhz as the source TPIU clk</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>Selects HFRC 96Mhz as the source TPIU clk</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>Selects HFRC 192Mhz as the source TPIU clk</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>Selects HFRC2 125Mhz as the source TPIU clk. Note that this setting requires CLKGEN.MISC.HFRC2 be enabled</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>Selects HFRC2 250Mhz as the source TPIU clk. Note that this setting requires CLKGEN.MISC.HFRC2 be enabled</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGTPIUTRACEENABLE</name>
              <description>TPIU TRACE Enable field. When set, the Cayenne TPIU is enabled and data can be streamed out trace data from ARM ITM and ETM modules through TRACEDATA ports</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the TPIU TRACE.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the TPIU TRACE.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTAPOINTER</name>
          <description>OTA (Over the Air) Update Pointer/Status. Reset only by POA</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OTAPOINTER</name>
              <description>Flash page pointer with updated OTA image</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>

