AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>VDDFRXCOMPEN</name>
              <description>Enable the VDDS rail.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCRXCOMPEN</name>
              <description>Enable the VDDC rail.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK1</name>
          <description>1. Control the even division of 3 clocks: refresh, low power and TONCLK. 2. Control gap bewteen secondary switches. 3. Debug features: control the amount of time TONCLK is on, and the time before snubber asserts for each buck sequence. 4. Enable or disable the observation bus. 5. Select the buck sequence operation mode. 6. Control delay between primary Pmos and Nmos transitions.</description>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKHPTRIMEN</name>
              <description>Enable the simobuck HP mode trim</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIMOBUCK_HP_OFF</name>
                  <description>Disable simobuck hp trim.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMOBUCK_HP_ON</name>
                  <description>Enable simobuck hp trim.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMOBUCKOBSEN</name>
              <description>Enable the simobuck observation bus output.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIMO_DATA_OFF</name>
                  <description>Disable simobuck data output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMO_DATA_ON</name>
                  <description>Enable simobuck data output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUCKMODE</name>
              <description>The buck sequence can operate in two buck sequence modes: default (zxcomp) and backup. Set before simobuck comes up.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZXCOMP</name>
                  <description>Select default (ZXCOMP) sequence operating mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOZXCOMP</name>
                  <description>Select backup sequence operating mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEBUCKOFF</name>
              <description>Control the buck sequence stopping point before snubber asserts. Set before simobuck comes up.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VARIED_CYCLES</name>
                  <description>Stop point will vary depending on operating mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_CYCLE</name>
                  <description>Stop exactly 1 TONCLK cycle before snubber asserts.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPNDTRIM</name>
              <description>Control delay between primary Pmos and Nmos transitions.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TONCLKTRIM</name>
              <description>This divides the 100 MHz ton clock. Even divides are supported only. This value represents the division amount minus 1.</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WSELVDDSBSMODE</name>
              <description>DEPRECATED</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WSELDELAYTRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSCHEDULINGCODE</name>
              <description>DEPRECATED</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OBSMODE</name>
              <description>Choose from 4 modes of operation</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCLKLPTRIM</name>
              <description>This divides the 32 kHz low power clock. Even divides are supported only. This value represents the division amount minus 1.</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>

