AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RXCLKACTTRIM</name>
              <description>This divides the 5 MHz refresh clock. Even divides are supported only. This value represents the division amount minus 1.</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCLKACTSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LPFBEN</name>
              <description>DEPRECATED</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCETONCLKEN</name>
              <description>TONCLK is active only when needed to save power. This keeps the clock always on (AON). Set before simobuck comes up.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_TONCLK</name>
                  <description>TONCLK will be active only when needed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_TONCLK</name>
                  <description>TONCLK is always on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMMODEEN</name>
              <description>DEPRECATED</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COARSESEL</name>
              <description>DEPRECATED</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACTFBEN</name>
              <description>DEPRECATED</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK2</name>
          <description>SIMO Buck Muxed VDDC Active Sequence Trim Control</description>
          <addressOffset>0x00000344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FF0FFC3</resetMask>

          <fields>
            <field>
              <name>VDDCACTLOWTONTRIM</name>
              <description>VDDC active high ton trim control for Buck sequence.</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCACTLOWTOFFTRIM</name>
              <description>VDDC active low toff trim control for Buck sequence.</description>
              <bitRange>[24:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCACTHIGHTONTRIM</name>
              <description>VDDC active high ton trim control for Buck sequence.</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCACTHIGHTOFFTRIM</name>
              <description>VDDC active high toff trim control for Buck sequence.</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCACTDRVSTRTRIM</name>
              <description>VDDC active trim control for drive strength.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK3</name>
          <description>SIMO Buck Muxed VDDC low power Sequence Trim Control</description>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDCLPLOWTONTRIM</name>
              <description>VDDC LP low ton trim control for Buck sequence.</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPLOWTOFFTRIM</name>
              <description>VDDC LP low toff trim control for Buck sequence.</description>
              <bitRange>[26:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPHIGHTONTRIM</name>
              <description>VDDC LP high ton trim control for Buck sequence.</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPHIGHTOFFTRIM</name>
              <description>VDDC LP high toff trim control for Buck sequence.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPDRVSTRTRIM</name>
              <description>VDDC LP trim control for drive strength.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

