AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>VDDCLEAKAGETRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK4</name>
          <description>SIMO Buck Muxed VDDC LV Active Sequence Trim Control</description>
          <addressOffset>0x0000034C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDCLVINPREFSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTLOWTONTRIM</name>
              <description>VDDC LV active low ton trim control for Buck sequence.</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTLOWTOFFTRIM</name>
              <description>VDDC LV active low trim control for a 500 MHz clock inside the simobuck analog design.</description>
              <bitRange>[24:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTHIGHTONTRIM</name>
              <description>VDDC LV active high ton trim control for Buck sequence.</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTHIGHTOFFTRIM</name>
              <description>VDDC LV active high toff trim control for Buck sequence.</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVACTDRVSTRTRIM</name>
              <description>VDDC LV active trim control for drive strength.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK5</name>
          <description>SIMO Buck Muxed VDDC LV Low PowerSequence Trim Control</description>
          <addressOffset>0x00000350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDCLVLPLOWTONTRIM</name>
              <description>VDDC LV low power high ton trim control for Buck sequence.</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLPLOWTOFFTRIM</name>
              <description>VDDC LV low power low toff trim control for Buck sequence.</description>
              <bitRange>[26:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLPLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLPHIGHTONTRIM</name>
              <description>VDDC LV low power high ton trim control for Buck sequence.</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLPHIGHTOFFTRIM</name>
              <description>VDDC LV low power high toff trim control for Buck sequence.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLPHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLPDRVSTRTRIM</name>
              <description>VDDC LV low power trim control for drive strength.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLEAKAGETRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK6</name>
          <description>SIMO Buck Muxed VDDF Active Sequence Trim Control</description>
          <addressOffset>0x00000354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDFLEAKAGETRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFINPREFSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTTRIM</name>
              <description>VDDF active trim.</description>
              <bitRange>[28:23]</bitRange>
              <access>read-write</access>

