AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>VDDFACTINPREFSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTHIGHTONTRIM</name>
              <description>VDDF active high ton trim control for Buck sequence.</description>
              <bitRange>[21:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTHIGHTOFFTRIM</name>
              <description>VDDF active high toff trim control for Buck sequence.</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTFBTRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[7:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTDRVSTRTRIM</name>
              <description>VDDF active high toff trim for drive strength.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK7</name>
          <description>SIMO Buck Muxed VDDF active Sequence Trim Control</description>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDFLPTRIM</name>
              <description>VDDF low power trim.</description>
              <bitRange>[30:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPINPREFSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[24:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ZXCOMPZXTRIM</name>
              <description>Zxcomp trim. Feedthrough to analog.</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPFBCDACTRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPFBCDACEN</name>
              <description>DEPRECATED</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPDRVSTRTRIM</name>
              <description>VDDF active trim control for drive strength.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTLOWTONTRIM</name>
              <description>VDDF active low ton trim control for Buck sequence.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTLOWTOFFTRIM</name>
              <description>VDDF active low toff trim control for Buck sequence.</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK8</name>
          <description>SIMO Buck Muxed VDDF Low Power Sequence Trim Control</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDFLPLOWTONTRIM</name>
              <description>VDDF low power low ton trim control for Buck sequence.</description>
              <bitRange>[27:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPLOWTOFFTRIM</name>
              <description>VDDF low power low toff trim control for Buck sequence.</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[17:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPHIGHTONTRIM</name>
              <description>VDDF low power high ton trim control for Buck sequence.</description>
              <bitRange>[13:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPHIGHTOFFTRIM</name>
              <description>VDDF low power high toff trim control for Buck sequence.</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK9</name>
          <description>SIMO Buck Muxed VDDS Active Sequence Trim Control</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDSLEAKAGETRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

