AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>VDDSACTLOWTONTRIM</name>
              <description>VDDS active low ton trim control for Buck sequence.</description>
              <bitRange>[27:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTINPREFSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTHIGHTONTRIM</name>
              <description>VDDS active high ton trim control for Buck sequence.</description>
              <bitRange>[21:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTHIGHTOFFTRIM</name>
              <description>VDDS active high toff trim control for Buck sequence.</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTFBTRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[7:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTDRVSTRTRIM</name>
              <description>simobuck_vdds_act_drvstr_trim</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK10</name>
          <description>SIMO Buck Muxed VDDS active Sequence Trim Control</description>
          <addressOffset>0x00000364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDSLPHIGHTOFFTRIM</name>
              <description>VDDS low power high toff trim control for a Buck sequence.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPHIGHTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPFBTRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPFBCDACTRIM</name>
              <description>DEPRECATED</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPFBCDACEN</name>
              <description>DEPRECATED</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPDRVSTRTRIM</name>
              <description>VDDS low power trim control for drive strength.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTLOWTOFFTRIM</name>
              <description>VDDS active low toff trim control for Buck sequence.</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSACTLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK11</name>
          <description>SIMO Buck Muxed Sequence Trim Control</description>
          <addressOffset>0x00000368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENBRNOUT</name>
              <description>Enable each individual rail counter.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRIMCHANGEDLYPOST</name>
              <description>Delay used on the trims valid assertion after trims are changed.</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRIMCHANGEDLYPRE</name>
              <description>Delay used on the trims valid de-assertion before trims are changed.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPLOWTONTRIM</name>
              <description>VDDS low power low ton trim control for a Buck sequence.</description>
              <bitRange>[19:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPLOWTOFFTRIM</name>
              <description>VDDS low power low toff trim control for a Buck sequence.</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPLOWTOFFTRIMFINE</name>
              <description>DEPRECATED.</description>
              <bitRange>[9:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLPINPREFSEL</name>
              <description>DEPRECATED</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

