AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>VDDSLPHIGHTONTRIM</name>
              <description>VDDS low power high ton trim control for a Buck sequence.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK12</name>
          <description>SIMO Buck Compare, Brown out, Active, Low power Trim Control</description>
          <addressOffset>0x0000036C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPTRIMVDDF</name>
              <description>Low power VDDF trim.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACTTRIMVDDF</name>
              <description>Active VDDF trim.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVBRNOUTTRIM</name>
              <description>Digital brown out max counter value for VDDC LV rail.</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVCOMPTRIMPLUS</name>
              <description>Static trim to allow separation when low power GT active rail.</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVCOMPTRIMMINUS</name>
              <description>Static trim to allow separation between low power and active rail.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK13</name>
          <description>SIMO Buck Compare, Brown out, Active, Low power Trim Control</description>
          <addressOffset>0x00000370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPTRIMVDDS</name>
              <description>Low power VDDS trim.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACTTRIMVDDS</name>
              <description>Active VDDS trim.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSBRNOUTTRIM</name>
              <description>Digital brown out max counter value for VDDS rail.</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSCOMPTRIMPLUS</name>
              <description>Static trim to allow separation when low power GT active rail.</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSCOMPTRIMMINUS</name>
              <description>Static trim to allow separation between low power and active rail.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK14</name>
          <description>SIMO Buck Compare, Brown out, Active, Low power and Leakage Trim Control</description>
          <addressOffset>0x00000374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VDDCLKGEN</name>
              <description>Leakage vddc rail enable. Set before simobuck comes up.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLKGTRIM</name>
              <description>Leakage trim for vddc.</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLKGEN</name>
              <description>Leakage vddf rail enable. Set before simobuck comes up.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLKGTRIM</name>
              <description>Leakage trim for vddf.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLKGEN</name>
              <description>Leakage vdds rail enable. Set before simobuck comes up.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSLKGTRIM</name>
              <description>Leakage trim for vdds.</description>
              <bitRange>[24:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLKGEN</name>
              <description>Leakage vddc lv rail enable. Set before simobuck comes up.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVLKGTRIM</name>
              <description>Leakage trim for vddc lv.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

