AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>VDDFBRNOUTTRIM</name>
              <description>Digital Brown out max counter value for VDDF rail.</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFCOMPTRIMPLUS</name>
              <description>Static trim to allow separation when low power GT active rail.</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFCOMPTRIMMINUS</name>
              <description>Static trim to allow separation between low power and active rail.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK15</name>
          <description>SIMO Buck Compare, Brown out, Active and Low power Trim Control</description>
          <addressOffset>0x00000378</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFFFFFF</resetMask>

          <fields>
            <field>
              <name>TRIMLATCHOVER</name>
              <description>Override / Bypass the simobuck trim latch to enable on-the-fly trimming for VDDF and VDDS active and LP trims</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ZXCOMPOFFSETTRIM</name>
              <description>Zxcomp offset trim. Feedthrough to analog.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCRXCOMPTRIMEN</name>
              <description>Enable the VDDC rail. If not enabled, the rail will not be regulated. This must be done before simobuck comes up.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFRXCOMPTRIMEN</name>
              <description>Enable the VDDF rail. If not enabled, the rail will not be regulated. This must be done before simobuck comes up.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDSRXCOMPTRIMEN</name>
              <description>Enable the VDDS rail. If not enabled, the rail will not be regulated. This must be done before simobuck comes up.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLVRXCOMPTRIMEN</name>
              <description>Enable the VDDC LV rail. If not enabled, the rail will not be regulated. This must be done before simobuck comes up.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCBRNOUTTRIM</name>
              <description>Digital brown out max counter value for VDDC rail.</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCCOMPTRIMPLUS</name>
              <description>Static trim to allow separation when low power GT active rail.</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCCOMPTRIMMINUS</name>
              <description>Static trim to allow separation between low power and active rail.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRSW0</name>
          <description>PWRSW Control 0</description>
          <addressOffset>0x0000037C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0xEF0380FF</resetMask>

          <fields>
            <field>
              <name>PWRSWVDDRCPUOVERRIDE</name>
              <description>override enable for pwrsw_vddrcpu_dynsel and pgn</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRCPUSTATSEL</name>
              <description>VDDRCPU power switch static select</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS</name>
                  <description>Select VDDS rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRCPUPGN</name>
              <description>override value for pwrsw_vddrcpu_pgn</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRCPUDYNSEL</name>
              <description>override value for pwrsw_vddrcpu_dynsel</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMLOVERRIDE</name>
              <description>override enable for pwrsw_vddml_dynsel</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

