AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PWRSWVDDMLSTATSEL</name>
              <description>VDDML power switch static select</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>Select VDDF rail</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDMLDYNSEL</name>
              <description>override value for pwrsw_vddml_dynsel</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMCPUOVERRIDE</name>
              <description>override enable for pwrsw_vddmcpu_dynsel</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMCPUSTATSEL</name>
              <description>VDDMCPU power switch static select</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>Select VDDF rail</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDMCPUDYNSEL</name>
              <description>override value for pwrsw_vddmcpu_dynsel</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCAORPGN</name>
              <description>override enable for pwrsw_vddcaor_pgn</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCAOROVERRIDE</name>
              <description>override enable for pwrsw_vddcaor_dynsel</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCAORDYNSEL</name>
              <description>override value for pwrsw_vddcaor_dynsel</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCPUOVERRIDE</name>
              <description>override enable for pwrsw_vddcpu_dynsel and pgn</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCPUPGN</name>
              <description>override value for pwrsw_vddcpu_pgn</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCPUDYNSEL</name>
              <description>override value for pwrsw_vddcpu_dynsel</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRSW1</name>
          <description>PWRSW Control 1</description>
          <addressOffset>0x00000380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFC0FFC00</resetMask>

          <fields>
            <field>
              <name>SHORTVDDFVDDSORVAL</name>
              <description>pwrsw short override value for vddf/vdds</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHORTVDDFVDDSOREN</name>
              <description>pwrsw short override select for vddf/vdds</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHORTVDDCVDDCLVORVAL</name>
              <description>pwrsw short override value for vddc/vddclv</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHORTVDDCVDDCLVOREN</name>
              <description>pwrsw short override select for vddc/vddclv</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEVDDRMOFF</name>
              <description>Setting this bit forces VDDRM to be open when Flash is off. This is valid for only normal operational mode (i.e. without overrides).</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEVDDRMVDDF</name>
              <description>Setting this bit selects VDDF for VDDRM when Flash is off. This is valid for only normal operational mode (i.e. without overrides).</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDLOVERRIDE</name>
              <description>override enable for pwrsw_vddl_pgn</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

