AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PWRSWVDDLPGN</name>
              <description>override value for pwrsw_vddl_pgn</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRMOVERRIDE</name>
              <description>override enable for pwrsw_vddrm_dynsel and pgn</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRMSTATSEL</name>
              <description>VDDRM power switch static select</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS</name>
                  <description>Select VDDS rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRMPGN</name>
              <description>override value for pwrsw_vddrm_pgn</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRMDYNSEL</name>
              <description>override value for pwrsw_vddrm_dynsel</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRLOVERRIDE</name>
              <description>override enable for pwrsw_vddrl_dynsel and pgn</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRLSTATSEL</name>
              <description>VDDRL power switch static select</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDS</name>
                  <description>Select VDDS rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRLPGN</name>
              <description>override value for pwrsw_vddrl_pgn</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRLDYNSEL</name>
              <description>override value for pwrsw_vddrl_dynsel</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>USBRSTCTRL</name>
          <description>USB Reset Startup Control</description>
          <addressOffset>0x00000388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>USBUTMIRSTRELEASE</name>
              <description>Set this bit to '1' after USB power domain is up.  This will release the reset override condition</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBPORRSTRELEASE</name>
              <description>Set this bit to '1' after USB power domain is up.  This will release the reset override condition</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBRSTENABLE</name>
              <description>This bit enables this register control. If set to '1', the reset release bits will be active.  If set to '0', this register is not controlling the USB override bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHWPROT0</name>
          <description>These bits write-protect flash in 16KB chunks, but cpu still can excute from that that memory.</description>
          <addressOffset>0x000003A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FW0BITS</name>
              <description>Write protect flash 0x00000000 - 0x0007FFFF. Each bit provides write protection for 16KB chunks of flash data space. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHWPROT1</name>
          <description>These bits write-protect flash in 16KB chunks, but cpu still can excute from that that memory.</description>
          <addressOffset>0x000003AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FW1BITS</name>
              <description>Write protect flash 0x00080000 - 0x000FFFFF. Each bit provides write protection for 16KB chunks of flash data space. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

