AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMWPROT1</name>
          <description>These bits write-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMWPROT1</name>
              <description>Write protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMWPROT2</name>
          <description>These bits write-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMWPROT2</name>
              <description>Write protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMWPROT3</name>
          <description>These bits write-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMWPROT3</name>
              <description>Write protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMWPROT4</name>
          <description>These bits write-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMWPROT4</name>
              <description>Write protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMWPROT5</name>
          <description>These bits write-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMWPROT5</name>
              <description>Write protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMRPROT0</name>
          <description>These bits read-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMRPROT0</name>
              <description>Read protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMRPROT1</name>
          <description>These bits read-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMRPROT1</name>
              <description>Read protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMRPROT2</name>
          <description>These bits read-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMRPROT2</name>
              <description>Read protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

