AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMRPROT3</name>
          <description>These bits read-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMRPROT3</name>
              <description>Read protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMRPROT4</name>
          <description>These bits read-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMRPROT4</name>
              <description>Read protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMRPROT5</name>
          <description>These bits read-protect system SRAM from non-cpu access in 16KB chunks.</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMRPROT5</name>
              <description>Read protect SRAM from non-cpu access. Each bit provides write protection for an 16KB region of memory. When set to 1, the region will be protected from non-cpu reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUDADCPWRCTRL</name>
          <description>Audio ADC Power Control</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007D73F</resetMask>

          <fields>
            <field>
              <name>AUDADCKEEPOUTEN</name>
              <description>Audio ADC reference keeper out en</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCRFBUFSLWEN</name>
              <description>Audio ADC reference buffer slew enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCINBUFEN</name>
              <description>Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE bit is set )</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCINBUFSEL</name>
              <description>Audio ADC input buffer mux select</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCVBATDIVEN</name>
              <description>Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE bit is set )</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDAUDADCRESETN</name>
              <description>RESETN signal for Power Switched SAR and Digital Controller (when global power switch is off and if the AUDADCPWRCTRLSWE bit is set)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASSERT</name>
                  <description>Resetn is asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEASSERT</name>
                  <description>Resetn is de-asserted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDAUDADCDIGISOLATE</name>
              <description>ISOLATE signal for audio ADC Digital Contoller ( when AUDADCAPSEN is switched off and if the AUDADCPWRCTRLSWE bit is set)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No Isolation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Isolate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDAUDADCSARISOLATE</name>
              <description>ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN is switched off )</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No Isolation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Isolate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDREFKEEPPEN</name>
              <description>Reference Buffer Keeper Power Switch Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Reference Buffer Keeper Power Switch disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Reference Buffer Keeper Power Switch enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDREFBUFPEN</name>
              <description>Reference Buffer Power Switch Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Reference Buffer Power Switch disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Reference Buffer Power Switch enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDBGTPEN</name>
              <description>Bandgap and Temperature Sensor Power Switch Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Bandgap and temperature sensor disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Bandgap and temperature sensor enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCBPSEN</name>
              <description>Enable the Analog, IO and SAR Digital logic Power Switch on when set to 1 if the AUDADCPWRCTRLSWE bit is set.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>AUDADC power switch software power disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>AUDADC power switch software power enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCAPSEN</name>
              <description>Enable the Global audio ADC Power Switch on when set to 1 if the AUDADCPWRCTRLSWE bit is set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>AUDADC power switch software power disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>AUDADC power switch software power enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCPWRCTRLSWE</name>
              <description>Audio ADC Power Control Software Override Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>Audio ADC temperature sensor and bandgap Software Override Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>Audio ADC temperature sensor and bandgap Software Override Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDIO1</name>
          <description>Audio trims 1</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x003D0000</resetValue>
          <resetMask>0x003F1FFF</resetMask>

          <fields>
            <field>
              <name>PGAADCIFCCOMPTRIM</name>
              <description>pgaadcif_ccomp_trim</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

