AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PGAADCIFIBIASOUTTRIM</name>
              <description>pgaadcif_ibias_out_trim</description>
              <bitRange>[19:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFIBIASINTRIM</name>
              <description>pgaadcif_ibias_in_trim</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MICBIASPDNB</name>
              <description>micbias_pdnb</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MICBIASVOLTAGETRIM</name>
              <description>micbias_voltage_trim</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MICBIASMISCTRIM</name>
              <description>micbias_misc_trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PGAADCIFCTRL</name>
          <description>PGA ADCIF control</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>

          <fields>
            <field>
              <name>PGAADCIFVCOMPSEL</name>
              <description>pgaadcif_vcomp_sel</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFVCOMPEN</name>
              <description>pgaadcif_vcomp_en</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFTESTPADSEL</name>
              <description>pgaadcif_testpad_sel</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFTESTPADEN</name>
              <description>pgaadcif_testpad_en</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHBPDNB</name>
              <description>pgaadcif_chB_pdnb</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHBACTIVE</name>
              <description>pgaadcif_chB_active</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHAPDNB</name>
              <description>pgaadcif_chA_pdnb</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHAACTIVE</name>
              <description>pgaadcif_chA_active</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL1</name>
          <description>PGA control 1</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xBFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PGAGAINAOVRD</name>
              <description>Apply BYPASS and GAIN bits from this register (for channel A) instead of automatically via audio ADC.  Note that audio ADC FIFO meta data will not reflect dB gain as used when configuring audio ADC.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VCOMPSELPGA</name>
              <description>d2a_vcomp_sel_pga_vddh</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAVREFGENQUICKSTARTEN</name>
              <description>d2a_pga_vrefgen_quickstart_en_vddh</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAVREFGENPDNB</name>
              <description>d2a_pga_vrefgen_pdnb_vddh</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAIREFGENPDNB</name>
              <description>d2a_pga_irefgen_pdnb_vddh</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAVCMGENQCHARGEEN</name>
              <description>d2a_pga_chA_vcmgen_qcharge_en_vddh</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAVCMGENPDNB</name>
              <description>d2a_pga_chA_vcmgen_pdnb_vddh</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAOPAMPOUTPDNB</name>
              <description>d2a_pga_chA_opamp_out_pdnb_vddh</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAOPAMPINPDNB</name>
              <description>d2a_pga_chA_opamp_in_pdnb_vddh</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

