AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PGACHABYPASSEN</name>
              <description>d2a_pga_chA_bypass_en_vddh</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA1GAIN2SEL</name>
              <description>d2a_pga_chA1_gain2_sel_vddh</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA1GAIN2DIV2SEL</name>
              <description>d2a_pga_chA1_gain2_div2_sel_vddh</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA1GAIN1SEL</name>
              <description>d2a_pga_chA1_gain1_sel_vddh</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA0GAIN2SEL</name>
              <description>d2a_pga_chA0_gain2_sel_vddh</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA0GAIN2DIV2SEL</name>
              <description>d2a_pga_chA0_gain2_div2_sel_vddh</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA0GAIN1SEL</name>
              <description>d2a_pga_chA0_gain1_sel_vddh</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL2</name>
          <description>PGA control 2</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x83FFFFFF</resetMask>

          <fields>
            <field>
              <name>PGAGAINBOVRD</name>
              <description>Apply BYPASS and GAIN bits from this register (for channel B) instead of automatically via audio ADC.  Note that audio ADC FIFO meta data will not reflect dB gain as used when configuring audio ADC.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBVCMGENQCHARGEEN</name>
              <description>d2a_pga_chB_vcmgen_qcharge_en_vddh</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBVCMGENPDNB</name>
              <description>d2a_pga_chB_vcmgen_pdnb_vddh</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBOPAMPOUTPDNB</name>
              <description>d2a_pga_chB_opamp_out_pdnb_vddh</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBOPAMPINPDNB</name>
              <description>d2a_pga_chB_opamp_in_pdnb_vddh</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBBYPASSEN</name>
              <description>d2a_pga_chB_bypass_en_vddh</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB1GAIN2SEL</name>
              <description>d2a_pga_chB1_gain2_sel_vddh</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB1GAIN2DIV2SEL</name>
              <description>d2a_pga_chB1_gain2_div2_sel_vddh</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB1GAIN1SEL</name>
              <description>d2a_pga_chB1_gain1_sel_vddh</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB0GAIN2SEL</name>
              <description>d2a_pga_chB0_gain2_sel_vddh</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB0GAIN2DIV2SEL</name>
              <description>d2a_pga_chB0_gain2_div2_sel_vddh</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB0GAIN1SEL</name>
              <description>d2a_pga_chB0_gain1_sel_vddh</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUDADCPWRDLY</name>
          <description>Audio ADC Power Up Delay Control</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>AUDADCPWR1</name>
              <description>ADC Reference Keeper enable delay in 16 ADC CLK increments for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCPWR0</name>
              <description>ADC Reference Buffer Power Enable delay in 64 ADC CLK increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

