AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO0CTRL</name>
          <description>SDIO0/eMMC Control</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001080</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>SDIO0DATOPENDRAINEN</name>
              <description>SDIO0 DAT line configured as open-drian. 0: Push-pull mode, 1: Open-drain mode</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0CMDOPENDRAINEN</name>
              <description>SDIO0 CMD line configured as open-drian. 0: Push-pull mode, 1: Open-drain mode</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0XINCLKSEL</name>
              <description>Select clock source for SDIO0 xin_clk.</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO0ASYNCWKUPENA</name>
              <description>SDIO0 asynchronous wakeup mode. 0: Synchronous wakeup mode, 1: Asynchronous wakeup mode</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0OTAPDLYSEL</name>
              <description>Selects one of the 16 Taps on the sdcard_clk. This is effective only when otapdlyena is asserted.</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0OTAPDLYENA</name>
              <description>Used to enable the selective Tap delay on the sdcard_clk so as to generate the delayed sdcard_clk. This is used to latch the CMD/DAT outputs to generate delay on them w.r.t CLK going out. This signal along with otapdlysel[3:0] selects the amount of delay to be inserted on the Clock line. This signal should not be asserted when operating in DS mode.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0ITAPDLYSEL</name>
              <description>Selects one of the 32 Taps on the rxclk_in line. This is effective only when itapdlyena is asserted and Tuning is not enabled.</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0ITAPDLYENA</name>
              <description>Used to enable selective Tap delay line on the Looped back SD Clock (rxclk_in). This signal along with the itapdlysel[4:0] selects the the amount of delay to be inserted on the line. When Tuning is enabled (for SDR104 and optionally for SDR50), this signal is ignored and internalcontrols are used instead. This should not be asserted when operating in DS mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0ITAPCHGWIN</name>
              <description>This is used to gate the output of the Tap Delay lines so as to avoid glithches being propagated into the Core. This signal should be asserted few clocks before the itapdlysel changes and should be asserted for few clocks after.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0XINCLKEN</name>
              <description>SDIO0 serial clock source enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO0SYSCLKEN</name>
              <description>SDIO0 system clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SDIO1CTRL</name>
          <description>SDIO1/eMMC Control</description>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001080</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>SDIO1DATOPENDRAINEN</name>
              <description>SDIO1 DAT line configured as open-drian. 0: Push-pull mode, 1: Open-drain mode</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1CMDOPENDRAINEN</name>
              <description>SDIO1 CMD line configured as open-drian. 0: Push-pull mode, 1: Open-drain mode</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1XINCLKSEL</name>
              <description>Select clock source for SDIO1 xin_clk.</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO1ASYNCWKUPENA</name>
              <description>SDIO1 asynchronous wakeup mode. 0: Synchronous wakeup mode, 1: Asynchronous wakeup mode</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

