AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>SDIO1OTAPDLYSEL</name>
              <description>Selects one of the 16 Taps on the sdcard_clk. This is effective only when otapdlyena is asserted.</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1OTAPDLYENA</name>
              <description>Used to enable the selective Tap delay on the sdcard_clk so as to generate the delayed sdcard_clk. This is used to latch the CMD/DAT outputs to generate delay on them w.r.t CLK going out. This signal along with otapdlysel[3:0] selects the amount of delay to be inserted on the Clock line. This signal should not be asserted when operating in DS mode.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1ITAPDLYSEL</name>
              <description>Selects one of the 32 Taps on the rxclk_in line. This is effective only when itapdlyena is asserted and Tuning is not enabled.</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1ITAPDLYENA</name>
              <description>Used to enable selective Tap delay line on the Looped back SD Clock (rxclk_in). This signal along with the itapdlysel[4:0] selects the the amount of delay to be inserted on the line. When Tuning is enabled (for SDR104 and optionally for SDR50), this signal is ignored and internalcontrols are used instead. This should not be asserted when operating in DS mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1ITAPCHGWIN</name>
              <description>This is used to gate the output of the Tap Delay lines so as to avoid glithches being propagated into the Core. This signal should be asserted few clocks before the itapdlysel changes and should be asserted for few clocks after.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1XINCLKEN</name>
              <description>SDIO1 serial clock source enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIO1SYSCLKEN</name>
              <description>SDIO1 system clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PDMCTRL</name>
          <description>PDM Control</description>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>PDMGLOBALEN</name>
              <description>PDM global enable to allow all PDMs to have synchronized interface clocks and FIFO sampling.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSIBIST</name>
          <description>DPHY BIST register for the Analog testing</description>
          <addressOffset>0x000004A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000404</resetValue>
          <resetMask>0xF800FF0F</resetMask>

          <fields>
            <field>
              <name>DSIBISTDONE</name>
              <description>Status of the BIST engine, indicates the completion as well as error conditions.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSIBISTERRRXESC</name>
              <description>Indicates the normal error conditions in LP mode. Also indicates the RxClkEsc mode error.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSIBISTERRRXESCSYNC</name>
              <description>Indicates the sync error conditions in LP mode.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSIBISTERRRXHS</name>
              <description>Indicates the normal error conditions in HS mode.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSIBISTERRRXHSSYNC</name>
              <description>Indicates the sync error conditions in HS mode.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSIBISTSEED</name>
              <description>bist_seed in hardware</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSIBISTMODE</name>
              <description>{bist_en_esc_lp, bist_en_esc_hs} in hardware.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSMODE</name>
                  <description>HS mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPMODE</name>
                  <description>LP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXCLKESCMODE</name>
                  <description>RxClkEsc mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSIBISTFORCEERR</name>
              <description>bist_force_error in hardware</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

