AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHRPROT4</name>
          <description>These bits read-protect flash in 16KB chunks, but cpu still can excute from that that memory.</description>
          <addressOffset>0x000004B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FR4BITS</name>
              <description>Copy (read) protect flash 0x00200000 - 0x0027FFFF. Each bit provides read protection for 16KB chunks of flash. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHRPROT5</name>
          <description>These bits read-protect flash in 16KB chunks, but cpu still can excute from that that memory.</description>
          <addressOffset>0x000004BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FR5BITS</name>
              <description>Copy (read) protect flash 0x00280000 - 0x002FFFFF. Each bit provides read protection for 16KB chunks of flash. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHRPROT6</name>
          <description>These bits read-protect flash in 16KB chunks, but cpu still can excute from that that memory.</description>
          <addressOffset>0x000004C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FR6BITS</name>
              <description>Copy (read) protect flash 0x00300000 - 0x0037FFFF. Each bit provides read protection for 16KB chunks of flash. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHRPROT7</name>
          <description>These bits read-protect flash in 16KB chunks, but cpu still can excute from that that memory.</description>
          <addressOffset>0x000004C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FR7BITS</name>
              <description>Copy (read) protect flash 0x00380000 - 0x003FFFFF. Each bit provides read protection for 16KB chunks of flash. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRSW2</name>
          <description>PWRSW Control 2</description>
          <addressOffset>0x000004C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>PWRSWVDDGFXOVERRIDE</name>
              <description>override enable for pwrsw_vddgfx_dynsel and pgn</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDGFXSTATSEL</name>
              <description>override value for pwrsw_vddgfx_statsel</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDGFXDYNSEL</name>
              <description>override value for pwrsw_vddgfx_dynsel</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CPUCFG</name>
          <description>CPU config</description>
          <addressOffset>0x000004CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>

          <fields>
            <field>
              <name>CFGNSSTCALIB</name>
              <description>CFGNSST calib value</description>
              <bitRange>[29:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INITL1RSTDIS</name>
              <description>Init L1 reset diable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INITPAHBDIS</name>
              <description>InitPAHB disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INITTCMDIS</name>
              <description>INIT TCM disable</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

