AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCTL0</name>
          <description>This register controls power down and enable for various features of the system PLL</description>
          <addressOffset>0x000004D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC000001F</resetValue>
          <resetMask>0xE000033F</resetMask>

          <fields>
            <field>
              <name>SYSPLLVDDFPDNB</name>
              <description>System PLL VDDF enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>VDDF power up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>VDDF disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSPLLVDDHPDNB</name>
              <description>System PLL VDDH enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>VDDH power up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>VDDH disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSPLLPDB</name>
              <description>System PLL enable. When the PLL is enabled, SW must ensure that the PLL receives adequate current by forcing the LDO to be in active mode:&emsp; SIMOBUCKACTIVE = 1 (in BUCK mode)&emsp; MEMLDOACTIVE = 1 (in LDO mode).</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>PLL power down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>PLL enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCOSELECT</name>
              <description>System PLL VCO range select, connected to PLL pin VCOSEL</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VCOLO</name>
                  <description>VCO operates in the range 60MHz - 240MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCOHI</name>
                  <description>VCO operates in the range 240MHz - 960MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>System PLL bypass, connected to PLL pin BYPASS</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>FREF is bypassed to FOUTPOSTDIV</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREFSEL</name>
              <description>System PLL reference clock select, connected to PLL pin FREF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL32MHz</name>
                  <description>Select high frequency crystal oscillator output (e.g. 32 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFCLK</name>
                  <description>Select external reference clock (from GPIO)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACPD</name>
              <description>System PLL noise canceling DAC power down, connected to PLL pin DACPD</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Noise canceling DAC is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Power down noise canceling DAC (test mode only)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSMPD</name>
              <description>System PLL DSM (delta-sigma modulator) power down, connected to PLL pin DSMPD</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DSM is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>DSM is powered down</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUT4PHASEPD</name>
              <description>System PLL 4-phase clock generator power down, connected to PLL pin FOUT4PHASEPD</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Four phase clock generator and outputs are enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Four phase clock generator and outputs are disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUTPOSTDIVPD</name>
              <description>System PLL post divider power down, connected to PLL pin FOUTPOSTDIVPD. Must enable when using 4-phase outputs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Post divider enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Post divider disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUTVCOPD</name>
              <description>System PLL VCO rate output clock power down, connected to PLL pin FOUTVCOPD</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Rate output enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Rate output disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLDIV0</name>
          <description>This register sets the fractional portion of the feedback divider when the system PLL is in fractional mode. Refer to the PLLTS22ULPHVLPFRACA datasheet for more details</description>
          <addressOffset>0x000004DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>FRAC</name>
              <description>System PLL feedback divide value (fractional portion), connected to PLL pin FRAC[23:0]. Do not change FRAC while the clock is in use as it can make the clock unstable. First disable the clock, change FRAC, and then enable the clock</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

