AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PLLDIV1</name>
          <description>This register sets the integer portion of the feedback divider along with the other dividers in the system PLL. Refer to the PLLTS22ULPHVLPFRACA datasheet for more details</description>
          <addressOffset>0x000004E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF773F</resetMask>

          <fields>
            <field>
              <name>FBDIV</name>
              <description>System PLL feedback divide value, connected to PLL pin FBDIV[11:0]. Valid range is 4 to 960 in integer mode, 10 to 96 in fractional mode. Do not change FBDIV while the clock is in use as it can make the clock unstable. First disable the clock, change FBDIV, and then enable the clock</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POSTDIV1</name>
              <description>System PLL post divide 1 setting, connected to PLL pin POSTDIV1[2:0]. Valid range is 1 to 7. A setting of 0 will send 1 to the PLL. Total post divide is POSTDIV1*POSTDIV2</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POSTDIV2</name>
              <description>System PLL post divide 2 setting, connected to PLL pin POSTDIV2[2:0]. Valid range is 1 to 7. A setting of 0 will send 1 to the PLL. Total post divide is POSTDIV1*POSTDIV2. The value of POSTDIV1 should be maximized before enabling POSTDIV2.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFDIV</name>
              <description>System PLL reference divide value, connnected to PLL pin REFDIV[5:0]. Valid range is 1 to 63. A setting of 0 will send 1 to the PLL</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PLLSTAT</name>
          <description>This register indicates the system PLL status</description>
          <addressOffset>0x000004E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LOCK</name>
              <description>System PLL lock signal, connected to PLL pin LOCK. Indicates no cycle slip between the feedback clock and FPFD for 128 consecutive cycles</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PLLMUXCTL</name>
          <description>This register selects clock sources for the clocks that may be driven by the system PLL</description>
          <addressOffset>0x000004E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000BA</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>I2S1PLLCLKSEL</name>
              <description>I2S1 PLL clock select</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLLFOUT4</name>
                  <description>FOUTPOSTDIV divide by 8 from PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLFOUT3</name>
                  <description>FOUTPOSTDIV divide by 6 from PLL</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGEN</name>
                  <description>I2S1 clock from CLKGEN</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S0PLLCLKSEL</name>
              <description>I2S0 PLL clock select</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLLFOUT4</name>
                  <description>FOUTPOSTDIV divide by 8 from PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLFOUT3</name>
                  <description>FOUTPOSTDIV divide by 6 from PLL</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGEN</name>
                  <description>I2S0 clock from CLKGEN</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPLLCLKSEL</name>
              <description>USB PLL clock select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>FOUTPOSTDIV from PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGEN</name>
                  <description>USB PHY clock from CLKGEN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCPLLCLKSEL</name>
              <description>AUDADC PLL clock select</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>FOUTPOSTDIV from PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>48MHz HFRC clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGEN</name>
                  <description>AUDADC clock from CLKGEN</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMPLLCLKSEL</name>
              <description>PDM PLL clock select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>FOUTPOSTDIV from PLL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC</name>
                  <description>48MHz HFRC clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKGEN</name>
                  <description>PDM clock from CLKGEN</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
