AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PADSET1</name>
              <description>Only applicable on mspi1. When set, use  gpio95 .. gpio 104 as the pads. This extra set of pads is to run mspi0 on HEX and mspi1 concurrently. Note that the timing of this extra pads may not be as good as the origianl pads.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTEN</name>
              <description>Output pad enable configuration. Indicates which pads should be driven. Bits [3:0] are Quad0 data. Bits [7:4] are Quad1 data. Bit [8] is clock. Bit [9] is BM/DQS. Bit [10:17] are data for 16-bit. Bit[18] is BM/DQS for 16-bit.</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUAD0</name>
                  <description>Quad0 (4 data + 1 clock)</description>
                  <value>271</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD1</name>
                  <description>Quad1 (4 data + 1 clock)</description>
                  <value>496</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL</name>
                  <description>Octal (8 data + 1 clock)</description>
                  <value>1023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL0</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>259</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL1</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>304</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEX</name>
                  <description>Octal (16 data + 1 clock + 2 bytemask)</description>
                  <value>524287</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADOVEREN</name>
          <description>Enables PIO-like pad override control</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>OVERRIDEEN</name>
              <description>Output pad override enable. Bit mask for pad outputs. When set to 1, the values in the OVERRIDE field are driven on the pad (output enable is implicitly set in this mode). [7:0]=data[7:0] [8]=clock [9]=DM [18:11]=data[15:8]</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PADOVER</name>
          <description>Override data value</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>OVERRIDE</name>
              <description>Output pad override value. [7:0]=data [8]=clock [9]=DM</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Clock control</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>CLKSEL</name>
              <description>MSPI io Clock select</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_750KHz</name>
                  <description>750KHz sourced from the HFRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_1p5MHz</name>
                  <description>1.5MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_3MHz</name>
                  <description>3MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHz</name>
                  <description>6MHz sourced from the HFRC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_12MHz</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>192MHz sourced from the HFRC</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>125MHz sourced from the HFRC2</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>250MHz sourced from the HFRC2</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKEN</name>
              <description>MSPI io Clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable mspi io clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable mspi io clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV0AXI</name>
          <description>Specifies the base address and aperture range of the device as mapped onto the AXI bus</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFF001F</resetMask>

          <fields>
            <field>
              <name>BASE0</name>
              <description>XIPEN has to be enabled to enable aperture. The BASE address needs to be SIZE aligned.</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>

