AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>READONLY0</name>
              <description>Indicates the AXI aperture is read-only</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>Indicates AXI aperture only supports read operations</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>Indicates AXI aperture supports read and write operations</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE0</name>
              <description>Indicates the AXI aperture size</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE64K</name>
                  <description>64KB Aperture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128K</name>
                  <description>128KB Aperture</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256K</name>
                  <description>256KB Aperture</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512K</name>
                  <description>512KB Aperture</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1M</name>
                  <description>1MB Aperture</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2M</name>
                  <description>2MB Aperture</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE4M</name>
                  <description>4MB Aperture</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE8M</name>
                  <description>8MB Aperture</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE16M</name>
                  <description>16MB Aperture</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE32M</name>
                  <description>32MB Aperture</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE64M</name>
                  <description>64MB Aperture</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128M</name>
                  <description>128MB Aperture</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256M</name>
                  <description>256MB Aperture</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512M</name>
                  <description>512MB Aperture</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV0CFG</name>
          <description>Command formatting for PIO based transactions (initiated by writes to CTRL register)</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WRITELATENCY0</name>
              <description>Number of write Latency cycles. Qualified by ENTURN bit field.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SEPIO0</name>
              <description>Separate IO configuration. This bit should be set when the target device has separate MOSI and MISO pins. Respective IN/OUT bits below should be set to map pins.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXNEG0</name>
              <description>Launches TX data a half clock cycle (~10ns) early. This should normally be programmed to zero (NORMAL).</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>TX launched from posedge internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>TX data launched from negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXNEG0</name>
              <description>Adjusts the RX capture phase to the negedge of the 48MHz internal clock (~10ns early). For normal operation, it is expected that RXNEG will be set to 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX data sampled on posedge of internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>RX data sampled on negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCAP0</name>
              <description>Controls RX data capture phase. A setting of 0 (NORMAL) captures read data at the normal capture point relative to the internal clock launch point. However, to accomodate chip/pad/board delays, a setting of RXCAP of 1 is expected to be used to align the capture point with the return data window. This bit is used in conjunction with RXNEG to provide 4 unique capture points, all about 10ns apart.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX Capture phase aligns with CPHA setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY</name>
                  <description>RX Capture phase is delayed from CPHA setting by one clock edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV0</name>
              <description>Clock Divider. Allows dividing main MSPI core clock (125MHz/96MHz) by integer multiples. Enumerations are provided for common frequency, but any integer divide from 96 MHz is allowed. Odd divide ratios will result in a 33/66 percent duty cycle with a long low clock pulse (to allow longer round-trip for read data).</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKDIV1</name>
                  <description>Core Clock dividied by 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV2</name>
                  <description>Core Clock dividied by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV3</name>
                  <description>Core Clock dividied by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV4</name>
                  <description>Core Clock dividied by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV6</name>
                  <description>Core Clock dividied by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV8</name>
                  <description>Core Clock dividied by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV12</name>
                  <description>Core Clock dividied by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV16</name>
                  <description>Core Clock dividied by 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV24</name>
                  <description>Core Clock dividied by 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV32</name>
                  <description>Core Clock dividied by 32</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL0</name>
              <description>Serial clock polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Clock inactive state is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Clock inactive state is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA0</name>
              <description>Serial clock phase.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Clock toggles in middle of data bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Clock toggles at start of data bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURNAROUND0</name>
              <description>Number of turnaound cycles (for TX->RX transitions). Qualified by ENTURN bit field.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

