AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RXDQSDELAYHI0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default) for 2nd DQS on HEX mode.</description>
              <bitRange>[25:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAYNEGEN0</name>
              <description>When 1, RXDQSDELAYNEG is used for falling edge of the clock.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAYNEG0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default) of falling edge.</description>
              <bitRange>[19:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAY0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default)</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDQSDELAY0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default)</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLEFINEDELAY0</name>
              <description>Enables use of delay line to provide fine control over traditional RX capture clock.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DQSSYNCNEG0</name>
              <description>Use negative edge of clock for DDR data sync</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLEDQS0</name>
              <description>In EMULATEDDR mode, enable DQS for read capture</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>QUADDDR0</name>
              <description>Deprecated. No effect on RevC.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMULATEDDR0</name>
              <description>Drive external clock at 1/2 rate to emulate DDR mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0CFG1</name>
          <description>Timing and mode configuration bits for the MSPI module.</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008200</resetValue>
          <resetMask>0xE007FFBF</resetMask>

          <fields>
            <field>
              <name>DDREN0</name>
              <description>New DDR mode/logic enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDR250EN0</name>
              <description>Enable MSPI core logic to run at the same frequency as its input clock. This bit has no effect when DDREN is 1</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDATADELAY0</name>
              <description>Delay TXDATA output by 1 clock cycle</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CELATENCY0</name>
              <description>Mem CE assertion latency before the first Mem transfer clock</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>1 clock cycle before first mem transfer clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD1</name>
                  <description>2 clock cycles before first mem transfer clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD2</name>
                  <description>3 clock cycles before first mem transfer clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD3</name>
                  <description>4 clock cycles before first mem transfer clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSTURN0</name>
              <description>In DQS mode, the internal cycle count to enable DQS path.</description>
              <bitRange>[16:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXHI0</name>
              <description>Force st_rx to start at clock high of mspi_clk</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TAFOURTH0</name>
              <description>Add 1/4th mspi_clk in DDR to turnaround. Recommended set this to 1 when EMULATEDDR is set in non-DQS mode (ENABLEDQS = 0).</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

