AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DEV0SCRAMBLING</name>
          <description>Enables data scrambling for the specified range external flash addresses. Scrambling does not impact flash access performance.</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFF1FFF</resetMask>

          <fields>
            <field>
              <name>SCRENABLE0</name>
              <description>Enables Data Scrambling Region. When 1 reads and writes to the range will be scrambled. When 0, data will be read/written unmodified. Address range is specified in 64K granularity and the START/END ranges are included within the range.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCREND0</name>
              <description>Scrambling region end address [28:16] (64K block granularity). The END block is the LAST block included in the scrambled address range.</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCRSTART0</name>
              <description>Scrambling region start address [28:16] (64K block granularity). The START block is the FIRST block included in the scrambled address range.</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0XIPMISC</name>
          <description>Miscellaneous XIP control registers for AXI logic</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000900A</resetValue>
          <resetMask>0x0020FFFF</resetMask>

          <fields>
            <field>
              <name>APNDODD0</name>
              <description>Append dummy byte to odd number of write</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No appending byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Append one dummy byte</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPBOUNDARY0</name>
              <description>Deprecated. No effect on RevC.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEON0</name>
              <description>Byte enable always on for all lanes</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Byte enable is calculated on the fly</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Byte enable of all bytes are always on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEPOL0</name>
              <description>byte mask polarity to MSPI xfer</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPODD0</name>
              <description>Convert odd starting address to word-aligned starting address with byte-enables for holes. For example, an AXI transaction with wstrb of 0x0600 results in mspi transaction of addr=8 and BE=0b1001 ( active low ).</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the conversion</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEBREAK0</name>
              <description>Number of clock cycles for CE deassertion time</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0XIPCPURQ</name>
          <description>XIP CPU Read Queue Configuration for AXI logic</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000219</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>GQARB0</name>
              <description>Arbitration Bias between General (Non-CPU) and CPU Rd Queue</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B0</name>
                  <description>1:1 Simple round robin access grant</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1</name>
                  <description>2:1 access grant to General:CPU queue</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2</name>
                  <description>3:1 access grant to General:CPU queue</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B3</name>
                  <description>4:1 access grant to General:CPU queue</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RID7MASK0</name>
              <description>CPU Read ID 7 will in included in CPU Read Queue (if CPURQEN=1)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

