AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RID6MASK0</name>
              <description>CPU Read ID 6 will in included in CPU Read Queue (if CPURQEN=1)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RID5MASK0</name>
              <description>CPU Read ID 5 will in included in CPU Read Queue (if CPURQEN=1)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RID4MASK0</name>
              <description>CPU Read ID 4 will in included in CPU Read Queue (if CPURQEN=1)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RID3MASK0</name>
              <description>CPU Read ID 3 will in included in CPU Read Queue (if CPURQEN=1)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RID2MASK0</name>
              <description>CPU Read ID 2 will in included in CPU Read Queue (if CPURQEN=1)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RID1MASK0</name>
              <description>CPU Read ID 1 will in included in CPU Read Queue (if CPURQEN=1) (Invalid for CM55 system)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RID0MASK0</name>
              <description>CPU Read ID 0 will in included in CPU Read Queue (if CPURQEN=1) (Invalid for CM55 system)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPURQEN0</name>
              <description>Enable CPU Read Queue</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>CPU Read Queue is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>CPU Read Queue is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV0DDRDLYEXT</name>
          <description>DDR RX DQS Delayline MSB bits extenstion for DEV0DDR</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010101</resetMask>

          <fields>
            <field>
              <name>RXDQS1NDLYEXT0</name>
              <description>MSB extension to DEV0DDR.RXDQSDELAYNEGHI0</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQS1PDLYEXT0</name>
              <description>MSB extension to DEV0DDR.RXDQSDELAYHI0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQS0NDLYEXT0</name>
              <description>MSB extension to DEV0DDR.RXDQSDELAYNEG0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQS0PDLYEXT0</name>
              <description>MSB extension to DEV0DDR.RXDQSDELAY0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV1AXI</name>
          <description>Specifies the base address and aperture range of the device as mapped onto the AXI bus</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFF001F</resetMask>

          <fields>
            <field>
              <name>BASE1</name>
              <description>XIPEN has to be enabled to enable aperture. The BASE address needs to be SIZE aligned.</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>READONLY1</name>
              <description>Indicates the AXI aperture is read-only</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>Indicates AXI aperture only supports read operations</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>Indicates AXI aperture supports read and write operations</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE1</name>
              <description>Indicates the AXI aperture size</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE64K</name>
                  <description>64KB Aperture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128K</name>
                  <description>128KB Aperture</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256K</name>
                  <description>256KB Aperture</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512K</name>
                  <description>512KB Aperture</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1M</name>
                  <description>1MB Aperture</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2M</name>
                  <description>2MB Aperture</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE4M</name>
                  <description>4MB Aperture</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE8M</name>
                  <description>8MB Aperture</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE16M</name>
                  <description>16MB Aperture</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE32M</name>
                  <description>32MB Aperture</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE64M</name>
                  <description>64MB Aperture</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128M</name>
                  <description>128MB Aperture</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256M</name>
                  <description>256MB Aperture</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512M</name>
                  <description>512MB Aperture</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV1CFG</name>
          <description>Command formatting for PIO based transactions (initiated by writes to CTRL register)</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WRITELATENCY1</name>
              <description>Number of write Latency cycles. Qualified by ENTURN bit field.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

