AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>SEPIO1</name>
              <description>Separate IO configuration. This bit should be set when the target device has separate MOSI and MISO pins. Respective IN/OUT bits below should be set to map pins.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXNEG1</name>
              <description>Launches TX data a half clock cycle (~10ns) early. This should normally be programmed to zero (NORMAL).</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>TX launched from posedge internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>TX data launched from negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXNEG1</name>
              <description>Adjusts the RX capture phase to the negedge of the 48MHz internal clock (~10ns early). For normal operation, it is expected that RXNEG will be set to 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX data sampled on posedge of internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>RX data sampled on negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCAP1</name>
              <description>Controls RX data capture phase. A setting of 0 (NORMAL) captures read data at the normal capture point relative to the internal clock launch point. However, to accomodate chip/pad/board delays, a setting of RXCAP of 1 is expected to be used to align the capture point with the return data window. This bit is used in conjunction with RXNEG to provide 4 unique capture points, all about 10ns apart.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX Capture phase aligns with CPHA setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY</name>
                  <description>RX Capture phase is delayed from CPHA setting by one clock edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV1</name>
              <description>Clock Divider. Allows dividing main MSPI core clock (125MHz/96MHz) by integer multiples. Enumerations are provided for common frequency, but any integer divide from 96 MHz is allowed. Odd divide ratios will result in a 33/66 percent duty cycle with a long low clock pulse (to allow longer round-trip for read data).</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKDIV1</name>
                  <description>Core Clock dividied by 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV2</name>
                  <description>Core Clock dividied by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV3</name>
                  <description>Core Clock dividied by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV4</name>
                  <description>Core Clock dividied by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV6</name>
                  <description>Core Clock dividied by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV8</name>
                  <description>Core Clock dividied by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV12</name>
                  <description>Core Clock dividied by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV16</name>
                  <description>Core Clock dividied by 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV24</name>
                  <description>Core Clock dividied by 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKDIV32</name>
                  <description>Core Clock dividied by 32</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL1</name>
              <description>Serial clock polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Clock inactive state is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Clock inactive state is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA1</name>
              <description>Serial clock phase.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Clock toggles in middle of data bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Clock toggles at start of data bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURNAROUND1</name>
              <description>Number of turnaound cycles (for TX->RX transitions). Qualified by ENTURN bit field.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

