AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>ISIZE1</name>
              <description>Instruction Size</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I8</name>
                  <description>Instruction is 1 byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I16</name>
                  <description>Instruction is 2 bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASIZE1</name>
              <description>Address Size. Address bytes to send from ADDR register</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A1</name>
                  <description>Send one address byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>Send two address bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>Send three address bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>Send four address bytes</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVCFG1</name>
              <description>Flash configuration for XIP and AUTO DMA operations. Controls value for SER (Slave Enable) for XIP operations and address generation for DMA/XIP modes. Also used to configure SPIFRF (frame format).</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SERIAL0</name>
                  <description>Single bit SPI flash on chip select 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL1</name>
                  <description>Single bit SPI flash on chip select 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL0</name>
                  <description>Dual SPI flash on chip select 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL1</name>
                  <description>Dual bit SPI flash on chip select 1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD0</name>
                  <description>Quad SPI flash on chip select 0</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD1</name>
                  <description>Quad SPI flash on chip select 1</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL0</name>
                  <description>Octal SPI flash on chip select 0</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL1</name>
                  <description>Octal SPI flash on chip select 1</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUADPAIRED</name>
                  <description>Dual Quad SPI flash on chip selects 0/1.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUADPAIRED_SERIAL</name>
                  <description>Dual Quad SPI flash on chip selects 0/1, but transmit in serial mode for initialization operations</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEX0</name>
                  <description>Hex SPI flash on chip selects 0.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEX1</name>
                  <description>Hex SPI flash on chip selects 1.</description>
                  <value>18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV1DDR</name>
          <description>Timing configuration bits for DDR operation of the MSPI module.</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RXDQSDELAYHIEN1</name>
              <description>When 1, RXDQSDELAYHI and RXDQSDELAYNEGHI is used for falling edge of the clock.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAYNEGHI1</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default) of falling edge for 2nd DQS on HEX mode.</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>

