AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>HYPERIO1</name>
              <description>When using Windbond, set this bit to 1 to generate CA[47:0] in hardware.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSMP1</name>
              <description>Sampling edge based on sclk edge. No effect when div1</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RBX1</name>
              <description>Enable the support of RBX ( page boundary crossing  on read )</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WBX1</name>
              <description>Enable the support of WBX ( page boundary crossing  on write )</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCLKRXHALT1</name>
              <description>Halt sclk based on xfer_count</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCAPEXT1</name>
              <description>Specify the number of apb_clk of RX capture phse {RXCAPEXT, RXCAP}</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SFTURN1</name>
              <description>Subtract from internal counter of write latency and turnaround</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV1XIP</name>
          <description>When any SPI flash is configured, this register must be properly programmed before XIP or AUTO DMA operations commence.</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFD</resetMask>

          <fields>
            <field>
              <name>XIPWRITELATENCY1</name>
              <description>Number of write Latency cycles. Qualified by XIPENWLAT bit field.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPTURNAROUND1</name>
              <description>Number of turnaound cycles (for TX->RX transitions). Qualified by XIPENTURN bit field.</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENWLAT1</name>
              <description>Enable Write Latency counter for XIP write transactions</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENDCX1</name>
              <description>Enable DCX signal on data [1] for XIP/DMA operations</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPMIXED1</name>
              <description>Provides override controls for data operations where instruction, address, and data may transfer in different rates.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Transfers all proceed using the settings in DEVCFG register (everything in the same data rate)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <description>Data operations proceed in dual data rate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD2</name>
                  <description>Address and Data operations proceed in dual data rate</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <description>Data operations proceed in quad data rate</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD4</name>
                  <description>Address and Data operations proceed in quad data rate</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8</name>
                  <description>Data operations proceed in octal data rate</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD8</name>
                  <description>Address and Data operations proceed in octal data rate</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPSENDI1</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an instruction (see READINSTR field and ISIZE field in CFG)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPSENDA1</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an an address phase (see DMADEVADDR register and ASIZE field in CFG)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

