AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>XIPENTURN1</name>
              <description>Indicates whether XIP/AUTO DMA operations should enable TX->RX turnaround cycles</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPBIGENDIAN1</name>
              <description>Indicates whether XIP/AUTO DMA data transfers are in big or little endian format</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPACK1</name>
              <description>Controls transmission of Micron XIP acknowledge cycles (Micron Flash devices only)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACK</name>
                  <description>No acknowledege sent. Data IOs are tristated the first turnaround cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>Positive acknowledege sent. Data IOs are driven to 0 the first turnaround cycle to acknowledge XIP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMINATE</name>
                  <description>Negative acknowledege sent. Data IOs are driven to 1 the first turnaround cycle to terminate XIP mode. XIPSENDI should be reenabled for the next transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPEN1</name>
              <description>Enable the XIP (eXecute In Place) function which effectively enables the address decoding of the MSPI device in the flash/cache address space at address 0x04000000-0x07FFFFFF.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV1INSTR</name>
          <description>When any SPI flash is configured, this register must be properly programmed before XIP or AUTO DMA operations commence.</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000B0006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>READINSTR1</name>
              <description>Read command sent to flash for DMA/XIP operations</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WRITEINSTR1</name>
              <description>Write command sent for DMA operations</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV1BOUNDARY</name>
          <description>Allows large transfers to be broken up into smaller ones in hardware to accommodate needs of external devices and allow XIP/XIPMM. Only applicable for memory-mapped devices (PSRAM, Flash, etc) where address can be retransmitted without side effects.</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DMABOUND1</name>
              <description>DMA Address boundary</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Disable DMA address boundary breaks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK32</name>
                  <description>Break at 32 byte boundary (0x20 increments)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK64</name>
                  <description>Break at 64 byte boundary (0x40 increments)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK128</name>
                  <description>Break at 128 byte boundary (0x80 increments)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK256</name>
                  <description>Break at 256 byte boundary (0x100 increments)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK512</name>
                  <description>Break at 512 byte boundary (0x200 increments)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK1K</name>
                  <description>Break at 1KB boundary (0x400 increments)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK2K</name>
                  <description>Break at 2KB boundary (0x800 increments)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK4K</name>
                  <description>Break at 4KB boundary (0x1000 increments)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK8K</name>
                  <description>Break at 8KB boundary (0x2000 increments)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK16K</name>
                  <description>Break at 16KB boundary (0x4000 increments)</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMATIMELIMIT1</name>
              <description>DMA time limit. Can be used to limit the transaction time on the MSPI bus. The count is in ~100 ns increments for the 96 MHz clock input. A value of 0 disables the counter.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

