AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>FORBID</name>
              <description>PTM locked</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>PTM is locked</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>PTM is not locked</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCORRECT</name>
              <description>PTM data is not correctly set</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BAD</name>
                  <description>PTM data is incorrect</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GOOD</name>
                  <description>PTM data good</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WARNING</name>
              <description>PTM is re-run or not initialized</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCCURRED</name>
                  <description>PTM is re-run or not initialized.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No PTM warning</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERROR</name>
              <description>PTM Error.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>No PTM error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>PTM error occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>Controller Busy.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>OTP controller is idle and ready for a new command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTMBUSY</name>
                  <description>OTP controller is busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>PDM0</name>
      <version>1.0</version>
      <description>PDM Audio</description>
      <!-- <groupName>GROUP_PDM</groupName> -->
      <baseAddress>0x40201000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000254</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDM0</name>
        <description>PDM0_IRQ</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>PDM Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CLKGATEMODE</name>
              <description>Clock gating mode. 0 = clock always enabled when DMA is enabled. 1 = clock is enabled when there is actual DMA transfer</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EN</name>
              <description>PDM enable register</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PDM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PDM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCMPACK</name>
              <description>Enable PCM packing. Only 24-bit unpacked mode supported.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PCM packing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PCM packing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset IP core. 0 puts the core in reset; 1 takes the core out of reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Put the core in reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Core not in reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>PDM Master Clock select (24.576MHz).</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC2_31MHz</name>
                  <description>31MHz sourced from the HFRC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS</name>
                  <description>High Frequency XTAL</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS_DIV2</name>
                  <description>High Frequency XTAL Divide by 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS_DIV4</name>
                  <description>High Frequency XTAL Divide by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFCLK</name>
                  <description>External reference clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Static 0</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKEN</name>
              <description>PDM Clock enable.
If multiple clocks are enabled, priority is HFRC2, HF XTAL, HFRC.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable serial clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable serial clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CORECFG0</name>
          <description>PDM to PCM Core Configuration</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x21080F64</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

