AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
          <fields>
            <field>
              <name>PGAR</name>
              <description>Right Channel PGA Gain:
+1.5dB/step, -12dB ~ +34.5dB;</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M12_0DB</name>
                  <description>Right channel PGA gain = -12.0 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M10_5DB</name>
                  <description>Right channel PGA gain = -10.5 dB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M9_0DB</name>
                  <description>Right channel PGA gain = -9.0 dB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_5DB</name>
                  <description>Right channel PGA gain = -7.5 dB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6_0DB</name>
                  <description>Right channel PGA gain = -6.0 dB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_5DB</name>
                  <description>Right channel PGA gain = -4.5 dB</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_0DB</name>
                  <description>Right channel PGA gain = -3.0 dB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_5DB</name>
                  <description>Right channel PGA gain = -1.5 dB</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>Right channel PGA gain = 0 DB</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_5DB</name>
                  <description>Right channel PGA gain = 1.5 dB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_0DB</name>
                  <description>Right channel PGA gain = 3.0 dB</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4_5DB</name>
                  <description>Right channel PGA gain = 4.5 dB</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6_0DB</name>
                  <description>Right channel PGA gain = 6.0 DB</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7_5DB</name>
                  <description>Right channel PGA gain = 7.5 dB</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9_0DB</name>
                  <description>Right channel PGA gain = 9.0 dB</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10_5DB</name>
                  <description>Right channel PGA gain = 10.5 dB</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12_0DB</name>
                  <description>Right channel PGA gain = 12.0 DB</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P13_5DB</name>
                  <description>Right channel PGA gain = 13.5 dB</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15_0DB</name>
                  <description>Right channel PGA gain = 15.0 dB</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P16_5DB</name>
                  <description>Right channel PGA gain = 16.5 dB</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P18_0DB</name>
                  <description>Right channel PGA gain = 18.0 DB</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P19_5DB</name>
                  <description>Right channel PGA gain = 19.5 dB</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P21_0DB</name>
                  <description>Right channel PGA gain = 21.0 dB</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P22_5DB</name>
                  <description>Right channel PGA gain = 22.5 dB</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P24_0DB</name>
                  <description>Right channel PGA gain = 24.0 DB</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P25_5DB</name>
                  <description>Right channel PGA gain = 25.5 dB</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P27_0DB</name>
                  <description>Right channel PGA gain = 27.0 dB</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P28_5DB</name>
                  <description>Right channel PGA gain = 28.5 dB</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30_0DB</name>
                  <description>Right channel PGA gain = 30.0 DB</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P31_5DB</name>
                  <description>Right channel PGA gain = 31.5 dB</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P33_0DB</name>
                  <description>Right channel PGA gain = 33.0 dB</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P34_5DB</name>
                  <description>Right channel PGA gain = 34.5 dB</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAL</name>
              <description>Left Channel PGA Gain:
               +1.5dB/step, -12dB ~ +34.5dB;
enum
   name    =   M12_0DB
   value   =   0x0
   desc    =   Left channel PGA gain = -12.0 dB</description>
              <bitRange>[25:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M10_5DB</name>
                  <description>Left channel PGA gain = -10.5 dB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M9_0DB</name>
                  <description>Left channel PGA gain = -9.0 dB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_5DB</name>
                  <description>Left channel PGA gain = -7.5 dB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6_0DB</name>
                  <description>Left channel PGA gain = -6.0 dB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_5DB</name>
                  <description>Left channel PGA gain = -4.5 dB</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_0DB</name>
                  <description>Left channel PGA gain = -3.0 dB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_5DB</name>
                  <description>Left channel PGA gain = -1.5 dB</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>Left channel PGA gain = 0 DB</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_5DB</name>
                  <description>Left channel PGA gain = 1.5 dB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_0DB</name>
                  <description>Left channel PGA gain = 3.0 dB</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4_5DB</name>
                  <description>Left channel PGA gain = 4.5 dB</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6_0DB</name>
                  <description>Left channel PGA gain = 6.0 DB</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7_5DB</name>
                  <description>Left channel PGA gain = 7.5 dB</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9_0DB</name>
                  <description>Left channel PGA gain = 9.0 dB</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10_5DB</name>
                  <description>Left channel PGA gain = 10.5 dB</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12_0DB</name>
                  <description>Left channel PGA gain = 12.0 DB</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P13_5DB</name>
                  <description>Left channel PGA gain = 13.5 dB</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15_0DB</name>
                  <description>Left channel PGA gain = 15.0 dB</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P16_5DB</name>
                  <description>Left channel PGA gain = 16.5 dB</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P18_0DB</name>
                  <description>Left channel PGA gain = 18.0 DB</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P19_5DB</name>
                  <description>Left channel PGA gain = 19.5 dB</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P21_0DB</name>
                  <description>Left channel PGA gain = 21.0 dB</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P22_5DB</name>
                  <description>Left channel PGA gain = 22.5 dB</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P24_0DB</name>
                  <description>Left channel PGA gain = 24.0 DB</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P25_5DB</name>
                  <description>Left channel PGA gain = 25.5 dB</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P27_0DB</name>
                  <description>Left channel PGA gain = 27.0 dB</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P28_5DB</name>
                  <description>Left channel PGA gain = 28.5 dB</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30_0DB</name>
                  <description>Left channel PGA gain = 30.0 DB</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P31_5DB</name>
                  <description>Left channel PGA gain = 31.5 dB</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P33_0DB</name>
                  <description>Left channel PGA gain = 33.0 dB</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P34_5DB</name>
                  <description>Left channel PGA gain = 34.5 dB</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINCRATE</name>
              <description>Sinc decimation rate.
SINC_RATE = OSR /2. OSR = Fsin / Fsout.
Must be even.
16 to 64 allowed.
96 allowed for special configuration.</description>
              <bitRange>[20:14]</bitRange>
              <access>read-write</access>

