AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>MCLKDIV</name>
              <description>PDMA_CKO frequency divisor.
MCLKDIV > 0. MCLKDIV = 0 PROHIBITED.
MCLKDIV = (PDM_CLK /Fsin / (DIVMCLKQ + 1)) -1</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCHPD</name>
              <description>Disable high pass filter when = 1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable high pass filter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable high pass filter.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPGAIN</name>
              <description>Adjust High Pass filter coefficients</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCYCLES</name>
              <description>Set number of PDMA_CKO cycles during gain setting changes or soft mute</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0CYCLES</name>
                  <description>Zero PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1CYCLES</name>
                  <description>One PDMA_CK0 clock cycle during gain setting changes or soft mute.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Two PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3CYCLES</name>
                  <description>Three PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Four PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5CYCLES</name>
                  <description>Five PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CYCLES</name>
                  <description>Six PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7CYCLES</name>
                  <description>Seven PDMA_CK0 clock cycles during gain setting changes or soft mute.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFTMUTE</name>
              <description>Soft mute enable when = 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LRSWAP</name>
              <description>Left/Right channel swap when = 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable left/right channel swapping.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable left/right channel swapping.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CORECFG1</name>
          <description>PDM to PCM Extra Configuration</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SELSTEP</name>
              <description>Fine grain step size for smooth PGA or Softmute attenuation transition
0: 0.13dB
1: 0.26dB</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_13DB</name>
                  <description>0.13dB fine grain step size.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0_26DB</name>
                  <description>0.26dB fine grain step size.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKODLY</name>
              <description>PDMA_CKO clock phase delay in terms of PDMCLK period to internal sampler</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0CYCLES</name>
                  <description>No extra PDMCLK cycle delays.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1CYCLES</name>
                  <description>One xtra PDMCLK cycle delay.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CYCLES</name>
                  <description>Two extra PDMCLK cycle delays.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3CYCLES</name>
                  <description>Three extra PDMCLK cycle delays.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CYCLES</name>
                  <description>Four extra PDMCLK cycle delays.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5CYCLES</name>
                  <description>Five extra PDMCLK cycle delays.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CYCLES</name>
                  <description>Six extra PDMCLK cycle delays.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7CYCLES</name>
                  <description>Seven extra PDMCLK cycle delays.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVMCLKQ</name>
              <description>Divide down ratio for generating internal master MCLKQ.
DIVMCLKQ > 0. DIVMCLKQ = 0 PROHIBITED.
Recommend value of 1.
Fmclkq = Fpdmclk/(DIVMCLKQ+1).</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

