AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA completed a transfer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UNDFL</name>
              <description>This is the FIFO underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVF</name>
              <description>This is the FIFO overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>This is the FIFO threshold interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error receieved</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMP</name>
              <description>DMA completed a transfer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UNDFL</name>
              <description>This is the FIFO underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVF</name>
              <description>This is the FIFO overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>This is the FIFO threshold interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error receieved</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMP</name>
              <description>DMA completed a transfer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UNDFL</name>
              <description>This is the FIFO underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVF</name>
              <description>This is the FIFO overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>This is the FIFO threshold interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATRIGEN</name>
          <description>DMA Trigger Enable</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DTHR90</name>
              <description>Trigger DMA at FIFO 90 percent full. This signal is also used internally for AUTOHIP function</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTHR</name>
              <description>Trigger DMA upon when FIFO iss filled to level indicated by the FIFO THRESHOLD,at granularity of 16 bytes only</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATRIGSTAT</name>
          <description>DMA Trigger Status</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DTHR90STAT</name>
              <description>Triggered DMA from FIFO reaching 90 percent full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTHRSTAT</name>
              <description>Triggered DMA from FIFO reaching threshold</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>DMA Configuration</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000F05</resetMask>

          <fields>
            <field>
              <name>NEXTDMAEN</name>
              <description>Next DMA Request Feature Enable. When set, SW shall not program TOTCOUNT and TARGADDR. Instead, SW shall program TOTCOUNTNEXT and TARGADDRNEXT, and load them into HW DMA request pipeline using DMAENNEXT bit.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

