AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDSSPWREN</name>
          <description>This enables various power domains in audio subsystem.</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000004C4</resetMask>

          <fields>
            <field>
              <name>PWRENAUDADC</name>
              <description>Power up audio subsystem ADC domain</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up AUDADC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down AUDADC</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENI2S1</name>
              <description>Power up audio subsystem I2S1 domain</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up I2S1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down I2S1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENI2S0</name>
              <description>Power up audio subsystem I2S0 domain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up I2S0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down I2S0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENPDM0</name>
              <description>Power up audio subsystem PDM0 domain</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up PDM0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down PDM0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDSSPWRSTATUS</name>
          <description>This provides the power status for the peripheral domains controlled through AUDSSPWREN register. Value of 1 means the device is powred up and ready to be used and 0 means its not powered up.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000004C4</resetMask>

          <fields>
            <field>
              <name>PWRSTAUDADC</name>
              <description>Power Status audio subsystem ADC domain</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTI2S1</name>
              <description>Power Status audio subsystem I2S1 domain</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTI2S0</name>
              <description>Power Status audio subsystem I2S0 domain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTPDM0</name>
              <description>Power Status audio subsystem PDM0 domain</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the MEMRETCFG register. If this register is not set, then power will always be disabled to the memory bank.  Also, in case on NVM, To enable NVM1, NVM0 must also be enabled. And, Disabling power to NVM0, also disables power for NVM1.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>PWRENROM</name>
              <description>Power up ROM.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up ROM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down ROM</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENNVM1</name>
              <description>Power up NVM1. PWRENNVM (Bit 3) MUST ALSO BE SET to 0x1.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up NVM1. NVM1 can only be enabled if NVM0 is Enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down only NVM1. Independently power down NVM1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENNVM</name>
              <description>Power up NVM</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up NVM0. This bit must be set to power up NVM1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down NVM0 and NVM1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENTCM</name>
              <description>Power up Combination of DTCM and ITCM. Only 3 Combinations are allowed - 0x1, 0x3 and 0x7. And, Setting 0x2 selects ITCM128K_DTCM256K, Setting 0x4, 0x5, 0x6 selects ITCM256K_DTCM512K.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable power to any TCMs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM32K_DTCM128K</name>
                  <description>Power ON only 32k of ITCM and 128k of DTCM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM128K_DTCM256K</name>
                  <description>Power ON only 128k of ITCM and 256k of DTCM</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM256K_DTCM512K</name>
                  <description>Power ON 256k of ITCM and 512k of DTCM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWRSTATUS</name>
          <description>It provides the power status for all the memory banks including- caches, nvm (0 and 1) and all the SRAM groups. The status here should reflect the enable provided by the MEMPWREN register. There may be a lag time between setting the bits in MEMPWREN register and MEMPWRSTATUS register, due to the need to cycle the power gate and isolation seqeunces to the memory banks.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000DF</resetValue>
          <resetMask>0x000000DF</resetMask>

          <fields>
            <field>
              <name>PWRSTROM</name>
              <description>This bit is 1 if power is supplied to ROM</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

