AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PWRSTNVM1</name>
              <description>This bit is 1 if power is supplied to NVM 1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTCACHE</name>
              <description>This bit is 1 if power is supplied to Cache</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTNVM0</name>
              <description>This bit is 1 if power is supplied to NVM 0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTTCM</name>
              <description>Power status for xTCM. Each bit corresponds to one of the TCMs. bit0=TCM0_0, bit1=TCM0_1, bit2=TCM1.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable power to any DTCMs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM32K_DTCM128K</name>
                  <description>Only lower 32k of ITCM and 128k of DTCM is powered up</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM128K_DTCM256K</name>
                  <description>Only lower 128k of ITCM and 256k of DTCM is powered up</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM256K_DTCM512K</name>
                  <description>All 256k of ITCM and 512k of DTCM is powered up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMRETCFG</name>
          <description>This controls the power down of the SRAM banks in deep sleep mode. If this is set, then the power for that SRAM bank will be gated when the core goes into deep sleep. Upon wake, the data within the SRAMs will be erased. If this is not set, retention voltage will be applied to the SRAM bank when the core goes into deep sleep. Upon wake, the data within the SRAMs are retained. Do not set this if the SRAM bank is used as the target for DMA transfer while CPU in deepsleep.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>NVMPWDSLP</name>
              <description>Powerdown NVM in deep sleep</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>NVM is powered down during deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>NVM is kept powered on during deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCMPWDSLP</name>
              <description>Retention Control for All TCM. Upto 256K ITCM + 512K DTCM. This works in combination with SKUITCM and SUDTCM (in MCUCTRL) and MEMPWREN Settings.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RETAIN</name>
                  <description>All Enabled TCM retained.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORETAIN</name>
                  <description>No TCM retained.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPWRSTATUS</name>
          <description>Power ON Status for domains that are not part of devpwrstatus or mempwrstatus</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xE0000003</resetMask>

          <fields>
            <field>
              <name>SYSDEEPSLEEP</name>
              <description>Indicates all device domains powered down and MCU entered DEEPSLEEP state since it was last cleared. Write 1 to to clear it.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREDEEPSLEEP</name>
              <description>Indicates MCU entered DEEPSLEEP state since it was last cleared. Write 1 to to clear it.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORESLEEP</name>
              <description>Indicates MCU entered SLEEP state since it was last cleared. Write 1 to to clear it.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTMCUH</name>
              <description>Power Domain status for MCUH</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

