AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>PWRSTMCUL</name>
              <description>Power Domain status for MCUL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SSRAMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the SSRAMRETCFG register. If this register is not set, then power will always be disabled to the memory bank.</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>PWRENSSRAM</name>
              <description>Power up SRAM groups</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not power ON any of the SRAM banks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power ON only SRAM0 group (lower 1M)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power ON only SRAM1 group (middle 1M)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>Power ON only SRAM2 group (upper 1M)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All shared SRAM banks (SSRAM0 1M + SSRAM1 1M + SSRAM2 1M) powered ON</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSRAMPWRST</name>
          <description>It provides the power status for shared sram banks. The status here should reflect the enable provided by the SSRAMPWREN register.</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SSRAMPWRST</name>
              <description>Each bit corresponds to one 1M SSRAM group.  Power Status- 1:ON, 0:OFF  See SSRAMPWREN PWRENSSRAM for bit mapping. For example, a value of 2 in this field would mean that SSRAM1 is powered up and SSRAM0 is powered down.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SSRAMRETCFG</name>
          <description>This controls the power down of the Shared SRAM banks in deep sleep mode. If this is set, then the power for that SRAM bank will be gated when the core goes into deep sleep. Upon wake, the data within the SRAMs will be erased. If this is not set, retention voltage will be applied to the SRAM bank when none of the CPU agents are in powered up and active mode. Do not set this if the SRAM bank is used as the target for DMA transfer while CPU in deepsleep.</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007E38</resetValue>
          <resetMask>0x00007E3F</resetMask>

          <fields>
            <field>
              <name>SSRAMACTDISP</name>
              <description>Keep the memory domain active based on DISP state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e. when DISP is powered up)</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSRAMACTGFX</name>
              <description>Keep the memory domain active based on GFX state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e. when GFX is powered up)</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSRAMACTMCU</name>
              <description>Keep the memory domain active based on MCU state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Wakeup on demand (i.e. when MCU is powered up)</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSRAMPWDSLP</name>
              <description>Selects which shared SRAM banks are powered down in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All banks retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power down only SRAM group0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power down only SRAM group1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2</name>
                  <description>Power down only SRAM group1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All shared SRAM banks powered down</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVPWREVENTEN</name>
          <description>This register controls which feature trigger will result in an event to the CPU. It includes all the power on status for the core domains. If any bits are set, then if the domain is turned on, it will result in an event to the ARM core.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FBF</resetMask>

          <fields>
            <field>
              <name>PDMEVEN</name>
              <description>Control PDM power-on status event</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PDM power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PDM power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI3EVEN</name>
              <description>Control MSPI3 power-on status event</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MSPI3 power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MSPI3 power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI2EVEN</name>
              <description>Control MSPI2 power-on status event</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MSPI2 power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MSPI2 power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPI1EVEN</name>
              <description>Control MSPI1 power-on status event</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MSPI1 power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MSPI1 power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPIEVEN</name>
              <description>Control MSPI power-on status event</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MSPI power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MSPI power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDEVEN</name>
              <description>Control AUD power-on status event</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable AUD power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable AUD power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCEVEN</name>
              <description>Control ADC power-on status event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable ADC power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable ADC power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPCEVEN</name>
              <description>Control HCPC power-on status event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPC power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPC power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPBEVEN</name>
              <description>Control HCPB power-on status event</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPB power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPB power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPAEVEN</name>
              <description>Control HCPA power-on status event</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPA power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPA power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCUHEVEN</name>
              <description>Control MCUH power-on status event</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCHU power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCUH power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCULEVEN</name>
              <description>Control MCUL power-on status event</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCUL power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCUL power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREVENTEN</name>
          <description>This register controls which power enable for the memories will result in an event to the CPU. It includes all the power on status for the memory domains. If any bits are set, then if the domain is turned on, it will result in an event to the ARM core.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>NVM0EN</name>
              <description>Control NVM power-on status event</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable NVM status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables NVM status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCMEN</name>
              <description>Enable DTCM power-on status event</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable DTCM power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0EN</name>
                  <description>Enable GROUP0_DTCM0 power on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1EN</name>
                  <description>Enable GROUP0_DTCM1 power on status event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0EN</name>
                  <description>Enable DTCMs in group0 power on status event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1EN</name>
                  <description>Enable DTCMs in group1 power on status event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable all DTCM power on status event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMSOVERRIDE</name>
          <description>Power domain behavior overrides related to MMS ( Multimedia System ).</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001B0C</resetValue>
          <resetMask>0x00003F0F</resetMask>

