AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
          <fields>
            <field>
              <name>MMSOVRSSRAMRETGFX</name>
              <description>If set, retention equation doesn't consider GFX. Each bit corresponds to a domain.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSON</name>
                  <description>When PD_GFX is off, retention is always okay for PD_GFX domain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGSTATE</name>
                  <description>When PD_GFX is off, retention is okay based on the state of PD_GFX domain and SSRAMRETCFG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRSSRAMRETDISP</name>
              <description>If set, retention equation doesn't consider DISP. Each bit corresponds to a domain.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSON</name>
                  <description>When PD_DISP is off, retention is always okay for PD_DISP domain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGSTATE</name>
                  <description>When PD_DISP is off, retention is okay based on the state of PD_DISP domain and SSRAMRETCFG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRSSRAMGFX</name>
              <description>MMS override for SSRAM power state by PD_GFX power setting.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOGFX</name>
                  <description>SSRAM power state is not affected by PD_GFX setting.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_GFX</name>
                  <description>SSRAM power state set by SSRAMPWREN_PWRENSSRAM is overridden by PD_GFX setting.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRSSRAMDISP</name>
              <description>MMS override for SSRAM power state by PD_DISP power setting.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODISP</name>
                  <description>SSRAM power state is not affected by PD_DISP setting.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_DISP</name>
                  <description>SSRAM power state set by SSRAMPWREN_PWRENSSRAM is overridden by PD_DISP setting.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRMCULGFX</name>
              <description>MMS override for MCUL on by PD_GFX setting. NOTE: THIS BIT MUST ALWAYS BE SET TO 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCULON</name>
                  <description>When PD_GFX is on, MCUL is forced on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCULOFF</name>
                  <description>PD_GFX Does not affect the state of PD_MCUL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRMCULDISP</name>
              <description>MMS override for MCUL on by PD_DISP setting.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCULON</name>
                  <description>When PD_DISP is on, MCUL is on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCULOFF</name>
                  <description>When PD_DISP is on, MCUL is still off.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUPWRCTRL</name>
          <description>This register contains override settings to override legacy_mode trim bit setting</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001EFC</resetMask>

          <fields>
            <field>
              <name>DISFUNCRETMODE</name>
              <description>SW Override to disable FUNC_RET mode</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>FUNC_RET mode is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_FUNC_RET</name>
                  <description>FUNC_RET mode is disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGCLKSTATE</name>
              <description>DBG Clock state</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Clock follows normal HW sequencing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_ON</name>
                  <description>Clock stays enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCLKSTATE</name>
              <description>FCLK Clock state</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Clock follows normal HW sequencing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_ON</name>
                  <description>Clock stays enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUCLKSTATE</name>
              <description>PMU Clock state</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Clock follows normal HW sequencing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_ON</name>
                  <description>Clock stays enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWICCLKSTATE</name>
              <description>IWIC Clock state</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Clock follows normal HW sequencing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_ON</name>
                  <description>Clock stays enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPUCLKOVREN</name>
              <description>CPU clock override enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_OFF</name>
                  <description>CPU Clocks follow normal HW sequencing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_ON</name>
                  <description>Clock state will be overriden by above bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPUPWRSTATE</name>
              <description>EPU Power State</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNUSED</name>
                  <description>This value is reserved</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPU_RET</name>
                  <description>EPU in retention</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPU_ON</name>
                  <description>EPU is ON</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPUMODEOVREN</name>
              <description>EPU Mode override</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPU_NORM</name>
                  <description>EPU follows normal CPU transitions as per legacy or P channel mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPU_OVERRIDE</name>
                  <description>Override EPU state to match EPUPWRSTATE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEPMODE</name>
              <description>Control to select between Ambiq sleep and ARM sleep</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMBIQ_SLEEP</name>
                  <description>PMU gates off CLKIN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_SLEEP</name>
                  <description>PMU does not gate off CLKIN, uses M55 internal clock gating</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCTRLMODESTATUS</name>
          <description>This register indicates power control operational mode</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LEGACYMODEST</name>
              <description>Legacy Mode value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEGACY_MODE_ON</name>
                  <description>Power control works in legacy mode (As per sleeping and sleepdeep signals from M55 Core)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGACY_MODE_OFF</name>
                  <description>Power control works according to P/Q channel interface signals coming from PMU</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUPWRSTATUS</name>
          <description>This register indicates the accepted power state request sent to pwr_ctrl</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00800006</resetValue>
          <resetMask>0x7FF8000F</resetMask>

          <fields>
            <field>
              <name>MEMRETNOCACHE</name>
              <description>Indicates M55 entered the MEM_RET (NO Cache) power state, Write 1 to clear</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

