AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>ONNOCACHE</name>
              <description>Indicates M55 entered the ON (NO Cache) power state, Write 1 to clear</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EPUOFFNOCACHE</name>
              <description>Indicates M55 entered the EPU_OFF (NO Cache) power state, Write 1 to clear</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNCRETNOCACHE</name>
              <description>Indicates M55 entered the FUNC_RET (NO Cache) power state, Write 1 to clear</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOGICRETNOCACHE</name>
              <description>Indicates M55 entered the LOGIC_RET (NO Cache) power state, Write 1 to clear</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FULLRETNOCACHE</name>
              <description>Indicates M55 entered the FULL_RET (NO Cache) power state, Write 1 to clear</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMRETCACHE</name>
              <description>Indicates M55 entered the MEM_RET (Cache) power state, Write 1 to clear</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONCACHE</name>
              <description>Indicates M55 entered the ON (Cache) power state, Write 1 to clear</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EPUOFFCACHE</name>
              <description>Indicates M55 entered the EPU_OFF (Cache) power state, Write 1 to clear</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNCRETCACHE</name>
              <description>Indicates M55 entered the FUNC_RET (Cache) power state, Write 1 to clear</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOGICRETCACHE</name>
              <description>Indicates M55 entered the LOGIC_RET (Cache) power state, Write 1 to clear</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FULLRETCACHE</name>
              <description>Indicates M55 entered the FULL_RET (Cache) power state, Write 1 to clear</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPUHP</name>
              <description>Indicates M55 entered HP mode.  Write 1 to clear</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPULP</name>
              <description>Indicates M55 entered LP mode.  Write 1 to clear</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPUAMBIQSLEEP</name>
              <description>Indicates M55 entered Ambiq SLEEP mode (clkin gated).  Write 1 to clear</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPUARMSLEEP</name>
              <description>Indicates M55 entered ARM SLEEP mode (clkin ungated, internal M55 clock gating via Q-channel signaling).  Write 1 to clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRACKOVR</name>
          <description>This register contains override bit fields for various power domain power switch acknowledge notification. As a part of power up sequnce, Power controller will look for power switch ack to advance power up sequence. It is possible for power controller to be a forever wait state in case of a unforeseen HW bug. This register defines a bit fileds to work around if needed in such a situation.  The default behavior is to use HW power switch ack. Software can set it to override this feature for each power switch.</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFDFFF</resetMask>

          <fields>
            <field>
              <name>PWRACKOVERRIDEMSPI3</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMSPI2</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMSPI1</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMSPI</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEROM</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMCUE</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEOTP</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDESDIO1</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEPDM</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEUSBPHY</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEUSB</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDESDIO0</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMCUL</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEIOS</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEHCPC</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEHCPB</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEHCPA</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEGFX</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEDISPPHY</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEDISP</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEDBG</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDECRYPTO</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEAUDADC</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
