AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEAUD</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEADC</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCNTDEFVAL</name>
          <description>This register contains programmble dealy values for various state michines.  Fields contain dev st machine default value, SIMOBUCK state machine wait delay counter etc.</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000208</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>PWRACKWAITDELSIMOSTMC</name>
              <description>Default counter max for buck ST MC</description>
              <bitRange>[15:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRDEFVALDEVSTMC</name>
              <description>Default count max value for dev ST MC</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GFXPERFREQ</name>
          <description>This register provides the performance mode knobs for GFX.</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>GFXPERFREQ</name>
              <description>GFX Performance mode request</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_96MHz</name>
                  <description>GFX to be run in LP mode (freq=96MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_192MHz</name>
                  <description>GFX to be run in HP1 mode (freq=192MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz</name>
                  <description>GFX to be run in HP2 mode (freq=125MHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_250MHz</name>
                  <description>GFX to be run in HP3 mode (freq=250MHz)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GFXPWRSWSEL</name>
          <description>This register provides the performance mode knobs for GFX.</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>GFXVDDSEL</name>
              <description>GFX VDD select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>GFX VDD select VDDC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>GFX VDD select VDDF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPURETCFG</name>
          <description>This controls the retention of EPU in system deep sleep mode. If this is set, when core goes into deepsleep mode, EPU flops will be in logic retention. When this is not set, EPU will be powered down when core goes into deepsleep.</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EPURETSLP</name>
              <description>EPU retention select</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>EPU will be in retention when core is in deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>EPU will be powered down when core is in deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VRCTRL</name>
          <description>This register includes additional debug control bits. This is an internal Ambiq-only register. Customers should not attempt to change this or else functionality cannot be guaranteed.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKEN</name>
              <description>Enables and Selects the SIMO Buck as the supply for the low-voltage power domains. It takes the initial value from the bit set in Customer INFO space.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the SIMO Buck</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the SIMO Buck</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LEGACYVRLPOVR</name>
          <description>When an override is set for a power domain, VR logic will ignore that power domain state in making a decision to go into lp state.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FC7FBF</resetMask>

          <fields>
            <field>
              <name>IGNOREPDM</name>
              <description>Ignore PDM</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

