AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>IGNOREMSPI3</name>
              <description>Ignore MSPI</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREMSPI2</name>
              <description>Ignore MSPI</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREMSPI1</name>
              <description>Ignore MSPI</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREMSPI</name>
              <description>Ignore MSPI</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREMCUE</name>
              <description>Ignore MCUE</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREOTP</name>
              <description>Ignore OTP</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNORESDIO1</name>
              <description>Ignore SDIO1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDBG</name>
              <description>Ignore DBG</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREAUD</name>
              <description>Ignore AUD</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREUSBPHY</name>
              <description>Ignore USB PHY</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREUSB</name>
              <description>Ignore USB Control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNORESDIO0</name>
              <description>Ignore SDIO0</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNORECRYPTO</name>
              <description>Ignore CRYPTO</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDISPPHY</name>
              <description>Ignore DISP PHY</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDISP</name>
              <description>Ignore DISP Control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREGFX</name>
              <description>Ignore GFX</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPE</name>
              <description>Ignore HCPE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPD</name>
              <description>Ignore HCPD</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPC</name>
              <description>Ignore HCPC</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPB</name>
              <description>Ignore HCPB</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPA</name>
              <description>Ignore HCPA</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREIOS</name>
              <description>Ignore IOS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRSTATUS</name>
          <description>Provides BUCK and LDOs status.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKST</name>
              <description>Indicates SIMO BUCK status. bit[1] indicates ON/OFF and bit[0] indicates ACT/LP</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the SIMO BUCK is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Indicates the the SIMO BUCK is ON and in LP mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Indicates the the SIMO BUCK is ON and in ACT mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMLDOST</name>
              <description>Indicates MEMLDO status. bit[1] indicates ON/OFF and bit[0] indicates ACT/LP.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the MEMLDO is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Indicates the the MEMLDO is ON and in LP mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Indicates the the MEMLDO is ON and in ACT mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORELDOST</name>
              <description>Indicates CORELDO status. bit[1] indicates ON/OFF and bit[0] indicates ACT/LP.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the CORELDO is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Indicates the the CORELDO is ON and in LP mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Indicates the the CORELDO is ON and in ACT mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>This register provides additional fine-tune power management controls for the SRAMs and the SRAM controller. This includes enabling light sleep for the SRAM and TCM banks, and clock gating for reduced dynamic power.</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF06</resetMask>

          <fields>
            <field>
              <name>SRAMLIGHTSLEEP</name>
              <description>Light Sleep enable for each TCM/SRAM bank. When 1, corresponding bank will be put into light sleep. For optimal power, banks should be put into light sleep while the system is active but the bank has minimal or no accesses.</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable LIGHT SLEEP for ALL SRAMs</description>
                  <value>4095</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables LIGHT SLEEP for ALL SRAMs</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMMASTERCLKGATE</name>
              <description>This bit is 1 when the master clock gate is enabled (top-level clock gate for entire SRAM block)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Master SRAM Clock Gate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Master SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMCLKGATE</name>
              <description>This bit is 1 if clock gating is allowed for individual system SRAMs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Individual SRAM Clock Gating</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Individual SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSTATUS</name>
          <description>This provides the power status for various blocks within the ADC. These status comes directly from the ADC module and is captured through this interface.</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>REFBUFPWD</name>
              <description>This bit indicates that the ADC REFBUF is powered down</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

