AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>REFKEEPPWD</name>
              <description>This bit indicates that the ADC REFKEEP is powered down</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VBATPWD</name>
              <description>This bit indicates that the ADC VBAT resistor divider is powered down</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VPTATPWD</name>
              <description>This bit indicates that the ADC temperature sensor input buffer is powered down</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTPWD</name>
              <description>This bit indicates that the ADC Band Gap is powered down</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCPWD</name>
              <description>This bit indicates that the ADC is powered down</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUDADCSTATUS</name>
          <description>This provides the power status for various blocks within the audio ADC. These status comes directly from the audio ADC module and is captured through this interface.</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>AUDREFBUFPWD</name>
              <description>This bit indicates that the ADC REFBUF is powered down</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDREFKEEPPWD</name>
              <description>This bit indicates that the ADC REFKEEP is powered down</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDVBATPWD</name>
              <description>This bit indicates that the ADC VBAT resistor divider is powered down</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDVPTATPWD</name>
              <description>This bit indicates that the ADC temperature sensor input buffer is powered down</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDBGTPWD</name>
              <description>This bit indicates that the ADC Band Gap is powered down</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCPWD</name>
              <description>This bit indicates that the ADC is powered down</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TONCNTRCTRL</name>
          <description>Controls each of the ton counters</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1F03</resetMask>

          <fields>
            <field>
              <name>FCNT</name>
              <description>frame width for ton counters</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKDIV</name>
              <description>frame width for ton counters</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LPMODESWOVR</name>
              <description>lp mode sw override</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLELPOVR</name>
              <description>vdds lp mode override enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LPOVRTHRESHVDDS</name>
          <description>Low power override threshold for VDDS</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPOVRTHRESHVDDS</name>
              <description>vdds lp override threshold for ton counter comparator</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LPOVRHYSTCNT</name>
          <description>Low power override hysteresis count</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPOVRHYSTCNT</name>
              <description>lp hysteresis count</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

