AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LPOVRTHRESHVDDF</name>
          <description>Low power override for VDDF</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPOVRTHRESHVDDF</name>
              <description>vddf lp override threshold for ton counter comparator</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LPOVRTHRESHVDDC</name>
          <description>Low power override for VDDC</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPOVRTHRESHVDDC</name>
              <description>vddc lp override threshold for ton counter comparator</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LPOVRTHRESHVDDCLV</name>
          <description>Low power override for VDDC_LV</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LPOVRTHRESHVDDCLV</name>
              <description>vddc_lv lp override threshold for ton counter comparator</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LPOVRSTAT</name>
          <description>Low power override status register</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LPOVRTRIG</name>
              <description>VDDS LP override has been triggered; write 1 to clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MRAMEXTCTRL</name>
          <description>MRAM control register</description>
          <addressOffset>0x000001C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>MRAMLPRDYNAMIC</name>
              <description>bypass lpr dynamic mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAMHARDRECALL</name>
              <description>over write send recall command from hardware side</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAMAUTOWAKEUPCTRL</name>
              <description>over write rst_auto_wk for TMC IP. auto wake up is enabled at default. write 0x3 to this field to disable the auto wake up.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAMTMCCLKGATDIS</name>
              <description>disable last tmc_clk/tmc_clk_inv clock gate</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCTRL</name>
          <description>Controls each of the energy monitor conuters</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clear the counter. Each bit corresponds to a counter. 0: Let the counter run run on its input clk. 1: Clear the counter</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FREEZE</name>
              <description>Freeze the counter. Each bit corresponds to a counter. 0: Let the counter run. 1: Stop the counter.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG0</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL0</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG1</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL1</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG2</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL2</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG3</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL3</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG4</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL4</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG5</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL5</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG6</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL6</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG7</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL7</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT0</name>
          <description>Energy Monitor count value for counter 0</description>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT0</name>
              <description>Energy Monitor count value counter 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

