AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT1</name>
          <description>Energy Monitor count value for counter 1</description>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT1</name>
              <description>Energy Monitor count value counter 1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT2</name>
          <description>Energy Monitor count value for counter 2</description>
          <addressOffset>0x00000230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT2</name>
              <description>Energy Monitor count value counter 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT3</name>
          <description>Energy Monitor count value for counter 3</description>
          <addressOffset>0x00000234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT3</name>
              <description>Energy Monitor count value counter 3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT4</name>
          <description>Energy Monitor count value for counter 4</description>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT4</name>
              <description>Energy Monitor count value counter 4</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT5</name>
          <description>Energy Monitor count value for counter 5</description>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT5</name>
              <description>Energy Monitor count value counter 5</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT6</name>
          <description>Energy Monitor count value for counter 6</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT6</name>
              <description>Energy Monitor count value counter 6</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT7</name>
          <description>Energy Monitor count value for counter 7</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT7</name>
              <description>Energy Monitor count value counter 7</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EMONSTATUS</name>
          <description>Energy Monitor status</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONOVERFLOW7</name>
              <description>Energy Monitor counter7 overflow</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMONOVERFLOW6</name>
              <description>Energy Monitor counter6 overflow</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMONOVERFLOW5</name>
              <description>Energy Monitor counter5 overflow</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMONOVERFLOW4</name>
              <description>Energy Monitor counter4 overflow</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMONOVERFLOW3</name>
              <description>Energy Monitor counter3 overflow</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

