AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>EMONOVERFLOW2</name>
              <description>Energy Monitor counter2 overflow</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMONOVERFLOW1</name>
              <description>Energy Monitor counter1 overflow</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMONOVERFLOW0</name>
              <description>Energy Monitor counter0 overflow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>RSTGEN</name>
      <version>1.0</version>
      <description>MCU Reset Generator</description>
      <!-- <groupName>GROUP_RSTGEN</groupName> -->
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00008860</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FP</name>
        <description>FP_IRQ</description>
        <value>133</value>
      </interrupt>      <interrupt>
        <name>OTP</name>
        <description>OTP_IRQ</description>
        <value>134</value>
      </interrupt>      <interrupt>
        <name>RSVD_LAST</name>
        <description>RSVD_LAST_IRQ</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>MAX</name>
        <description>Not a valid IRQ. The maximum IRQ is this value - 1.</description>
        <value>144</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>Reset configuration register. This controls the reset enables for brownout condition, choice of brownout method and for the expiration of the watch dog timer.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>WDREN</name>
              <description>Watchdog Timer Reset Enable. NOTE: The WDT module must also be configured for WDT reset. This includes enabling the RESEN bit in WDTCFG register in Watch dog timer block.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODHREN</name>
              <description>Brown out high (2.1v) reset enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SWPOI</name>
          <description>This is the software POI reset. writing the key value to this register will trigger a POI to the system. This will cause a reset to all blocks except for registers in clock gen, RTC and the stimer.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPOIKEY</name>
              <description>0x1B generates a software POI reset. This is a write-only register. Reading from this register will yield only all 0s.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0x1B key value generates a software POI reset.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPOR</name>
          <description>This is the software POR reset. Writing the key value to this register will trigger a POR to the system. This will cause a reset to all blocks except for registers in clock gen, RTC, power management unit, the stimer, and the power management unit.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWPORKEY</name>
              <description>0xD4 generates a software POR reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>Writing 0xD4 key value generates a software POR reset.</description>
                  <value>212</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBODM</name>
          <description>This register unmasks the individual digital detection brownout bits into the interrupt block</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>DIGBOECLV</name>
              <description>Enable the gate into the interrupt block for the digital brownout detection on VDDC_LV. Note: The interrupt block must also be unmasked for ISR and interrupt status to be set</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOM</name>
                  <description>Mask the VDDC_LV digital brownout detection into the interrupt block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOE</name>
                  <description>Enable brown VDDC_LV digital brownout detection into the interrupt block.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGBOES</name>
              <description>Enable the gate into the interrupt block for the digital brownout detection on VDDS. Note: The interrupt block must also be unmasked for ISR and interrupt status to be set</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOM</name>
                  <description>Mask the VDDS digital brownout detection into the interrupt block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOE</name>
                  <description>Enable the VDDS digital brownout detection into the interrupt block.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGBOEF</name>
              <description>Enable the gate into the interrupt block for the digital brownout detection on VDDF. Note: The interrupt block must also be unmasked for ISR and interrupt status to be set</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOM</name>
                  <description>Mask the VDDF digital brownout detection into the interrupt block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOE</name>
                  <description>Enable the VDDF digital brownout detection into the interrupt block.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGBOEC</name>
              <description>Enable the gate into the interrupt block for the digital brownout detection on VDDC. Note: The interrupt block must also be unmasked for ISR and interrupt status to be set</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOA</name>
                  <description>Enable brown out detection for VDDF using the analog method.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD</name>
                  <description>Enable brown out detection for VDDF using the digital method.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRESET</name>
          <description>Software reset register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>SWRSTSYSTICK</name>
              <description>Software reset for SysTick</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMALOP</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Hold SysTick feature in reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTTPIU</name>
              <description>Software reset for TPIU</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMALOP</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Hold TPIU feature in reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTEWIC</name>
              <description>Reserved field.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

