AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>BODDIGF</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGC</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BODDIGCLV</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC_LV</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGS</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGF</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGC</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>This register contains information about the status of and causes for resets and brownouts. NOTE 1: The bootrom and/or the secure bootloader maintain and update this register with appropriate status after each reset event. NOTE 2: While this register is intended to be read-only, all bits in this register, including reserved bits, are in fact writable. Therefore SW should take great care to never write this register.</description>
          <addressOffset>0x0000885C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF9FFF</resetMask>

          <fields>
            <field>
              <name>SBLRCVYSUCCESS</name>
              <description>SBL recovery was successful by Secure Bootrom.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SBLRCVYFAIL</name>
              <description>SBL recovery was attempted but failed.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMRCVYSUCCESS</name>
              <description>OEM recovery was successful.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMRCVYFAIL</name>
              <description>OEM recovery was attempted but failed.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMNVIMAGELOAD</name>
              <description>OEM recovery detailed status: NV Image Load was successful.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMNVOTA</name>
              <description>OEM recovery detailed status: NV OTA was successful.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMWIREDLOAD</name>
              <description>OEM recovery detailed status: wired load was successful.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMWIREDOTA</name>
              <description>OEM recovery detailed status: wired OTA was successful.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SBLNVIMAGELOAD</name>
              <description>SBL recovery detailed status: NV Image Load was successful.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SBLNVOTA</name>
              <description>SBL recovery detailed status: NV OTA was successful.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

