AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>SBLWIREDLOAD</name>
              <description>SBL recovery detailed status: wired load was successful.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SBLWIREDOTA</name>
              <description>SBL recovery detailed status: wired OTA was successful.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RCVYINITIATED</name>
              <description>A recovery event was initiated by one of the following: APP, GPIO, or certificate error.</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OEM</name>
                  <description>Recovery was initiated because OEM certification failed.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICV</name>
                  <description>Recovery was initiated because ICV certification failed.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>Recovery was initiated by GPIO.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APPREQ</name>
                  <description>Recovery was requested by the application.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCVYSPILOAD</name>
              <description>The recovery image loaded via SPI.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RCVYUARTLOAD</name>
              <description>The recovery image loaded via UART.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RCVYINPROGRESS</name>
              <description>An MRAM recovery operation is in progress.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AIRCRSTAT</name>
              <description>System reset request (SYSRESETREQ from CM55)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOCLVSTAT</name>
              <description>VDDC_LV Analog Brownout Event occurred.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOSSTAT</name>
              <description>VDDS Analog Brownout Event occurred.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOFSTAT</name>
              <description>VDDF Analog Brownout Event occurred.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOCSTAT</name>
              <description>VDDC Analog Brownout Event occurred.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOUSTAT</name>
              <description>An Unregulated Supply Brownout Event occurred.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WDRSTAT</name>
              <description>Reset was initiated by a Watchdog Timer Reset.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBGRSTAT</name>
              <description>Reset was a initiated by Debugger Reset.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POIRSTAT</name>
              <description>Reset was a initiated by Software POI Reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SWRSTAT</name>
              <description>Reset was a initiated by SW POR Reset.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BORSTAT</name>
              <description>Reset was initiated by a Brown-Out Reset. Following powerup, this bit may be inadvertantly set due to the Brown-Out signals powering up in a unusual sequence. It is recommended to clear this bit after initial powerup.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POASTAT</name>
              <description>Reset was initiated by a Power-On Analog (POA) Reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EXRSTAT</name>
              <description>Reset was initiated by an External Reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>RTC</name>
      <version>1.0</version>
      <description>Real Time Clock</description>
      <!-- <groupName>GROUP_RTC</groupName> -->
      <baseAddress>0x40004800</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC_IRQ</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>RTCCTL</name>
          <description>This is the register control for the RTC module. It enables counter writes and sets the alarm repeat interval.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>HR1224</name>
              <description>Hours Counter mode Only 24HR mode supported</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24HR</name>
                  <description>Hours in 24 hour mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable the 24 hour mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTOP</name>
              <description>RTC input clock control</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow the RTC input clock to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop the RTC input clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPT</name>
              <description>Alarm repeat interval</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Alarm interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YEAR</name>
                  <description>Interrupt every year</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONTH</name>
                  <description>Interrupt every month</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEEK</name>
                  <description>Interrupt every week</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAY</name>
                  <description>Interrupt every day</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HR</name>
                  <description>Interrupt every hour</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Interrupt every minute</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Interrupt every second/10th/100th</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRTC</name>
              <description>Counter write control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter writes are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter writes are enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSTAT</name>
          <description>This is the register status for the RTC module.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>WRITEBUSY</name>
              <description>Indicates that an RTC update (write) is still in progress. Writes are initiated by writing the CTTLOW register - CTRUP must be written before CTRLOW to be updated (otherwise it will retain its current value)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

