AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLOW</name>
          <description>This counter contains the values for hour, minutes, seconds and 100ths of a second Counter.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <resetMask>0x3F7F7FFF</resetMask>

          <fields>
            <field>
              <name>CTRHR</name>
              <description>Hours Counter. Contains the current value for hour.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRMIN</name>
              <description>Minutes Counter. Contains the current value for minutes.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRSEC</name>
              <description>Seconds Counter. Contains the current value for seconds.</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTR100</name>
              <description>100ths of a second Counter. Contains the current value for hundredths of a second.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRUP</name>
          <description>This register contains the day, month and year information. It contains which day in the week, and the century as well. The information of the century can also be derived from the year information. The 31st bit contains the error bit. See description in the register bit for condition when error is triggered.</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xB7FF1F3F</resetMask>

          <fields>
            <field>
              <name>CTERR</name>
              <description>Counter read error status. Error is triggered when software reads the lower word of the counters, and fails to read the upper counter within 1/100 second. This is because when the lower counter is read, the upper counter is held off from incrementing until it is read so that the full time stamp can be read.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No read error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDERR</name>
                  <description>Read error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEB</name>
              <description>Century enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the Century bit from changing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Century bit to change</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CB</name>
              <description>Century Bit. This bit will be toggled when the Years register rolls over from 99 to 00 if the CEB bit is a 1. CB=0 assumes the century it 19xx or 21xx, and CB=1 assumes it is 20xx for leap year calculations.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2000</name>
                  <description>Century is 2000s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1900_2100</name>
                  <description>Century is 1900s/2100s</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRWKDY</name>
              <description>Weekdays Counter. Contains the current value for weekdays.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRYR</name>
              <description>Years Counter. Contains the current value for year.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRMO</name>
              <description>Months Counter. Contains the current value for months.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRDATE</name>
              <description>Date Counter. Contains the current value for date.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALMLOW</name>
          <description>This register is the Alarm settings for hours, minutes, second and 1/100th seconds settings.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F7F7FFF</resetMask>

          <fields>
            <field>
              <name>ALMHR</name>
              <description>Hours Alarm. Contains the current value for hour alarm.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

