AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
          <fields>
            <field>
              <name>SWRSTDAT</name>
              <description>Only part of data circuit is reset. The following registers and bits are cleared by this bit: Buffer Data Port Register Buffer is cleared and Initialized. Present State register Buffer read Enable Buffer write Enable Read Transfer Active Write Transfer Active DAT Line Active Command Inhibit (DAT) Block Gap Control register Continue Request Stop At Block Gap Request Normal Interrupt Status register Buffer Read Ready Buffer Write Ready Block Gap Event Transfer Complete</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTCMD</name>
              <description>Only part of command circuit is reset. The following registers and bits are cleared by this bit: Present State register Command Inhibit (CMD) Normal Interrupt Status register Command Complete</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTALL</name>
              <description>This reset affects the entire HC except for the card detection circuit. Register bits of type ROC, RW, RW1C, RWAC are cleared to 0. During its initialization, the HD shall set this bit to 1 to reset the HC. The HC shall reset this bit to 0 when capabilities registers are valid and the HD can read them. Additional use of Software Reset For All may not affect the value of the Capabilities registers. If this bit is set to 1, the SD card shall reset itself and must be re initialized by the HD. A reset pulse is generated when writing 1 to each bit of this register. After completing the reset, the HC shall clear each bit. Because it takes some time to complete software reset, the SD Host Driver shall confirm that these bits are 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTCNT</name>
              <description>This value determines the interval by which DAT line time-outs are detected. Refer to the Data Time-out Error in the Error Interrupt Status register for information on factors that dictate time-out generation. Time-out clock frequency will be generated by dividing the sdclockTMCLK by this value. When setting this register, prevent inadvertent time-out events by clearing the Data Time-out Error Status Enable (in the Error Interrupt Status Enable register) At the initialization of the HC, the HD shall set the Data Time-out Counter Value according to the Capabilities register. The general formula is TIMEOUT = 2 ^ (TIMEOUTCNT + 13).</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>27</name>
                  <description>TMCLK * 2^27</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>TMCLK * 2^26</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>TMCLK * 2^25</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>TMCLK * 2^24</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>23</name>
                  <description>TMCLK * 2^23</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>TMCLK * 2^22</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>21</name>
                  <description>TMCLK * 2^21</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>TMCLK * 2^20</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>19</name>
                  <description>TMCLK * 2^19</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18</name>
                  <description>TMCLK * 2^18</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>TMCLK * 2^17</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>TMCLK * 2^16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15</name>
                  <description>TMCLK * 2^15</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>TMCLK * 2^14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13</name>
                  <description>TMCLK * 2^13</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQSEL</name>
              <description>This register is used to select the frequency of the SDCLK pin. The frequency is not programmed directly; rather this register holds the divisor of the Base Clock Frequency For SD clock in the capabilities register. Only the following settings are allowed. (1) 8-bit Divided Clock Mode Setting 00h specifies the highest frequency of the SD Clock. When setting multiple bits, the most significant bit is used as the divisor. But multiple bits should not be set. The two default divider values can be calculated by the frequency that is defined by the Base Clock Frequency For SD Clock in the Capabilities register. 1) 25 MHz divider value 2) 400 KHz divider value The frequency of the SDCLK is set by the following formula: Clock Frequency = (Baseclock) / divisor. Thus choose the smallest possible divisor which results in a clock frequency that is less than or equal to the target frequency. Maximum Frequency for SD = 50Mhz (base clock) Maximum Frequency for MMC = 52Mhz (base clock) Minimum Frequency = 195.3125Khz (50Mhz / 256), same calculation for MMC also (2) 10-bit Divided Clock Mode Host Controller Version 3.00 supports this mandatory mode instead of the 8-bit Divided Clock Mode. The length of divider is extended to10 bits and all divider values shall be supported. 3FFh --1/2046 Divided Clock N -------1/2N Divided Clock (Duty 50%) 002h -- 1/4 Divided Clock 001h ---1/2 Divided Clock 000h --- Base Clock (10MHz-254MHz)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>base clock divided by 256</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>base clock divided by 128</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>base clock divided by 64</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>base clock divided by 32</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>base clock divided by 16</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>base clock divided by 8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>base clock divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>base clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECLK</name>
                  <description>Base clock (10MHz - 63MHz)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPRCLKDIV</name>
              <description>Bit 07-06 is assigned to bit 09-08 of clock divider in SDCLK Frequency Select</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

