AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TGTRESPERRHOSTERRSTATEN</name>
              <description>Desc</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TUNINGERRORSTATUS</name>
              <description>enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCMD12ERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CURRENTLIMITERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATAENDBITERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATACRCERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATATIMEOUTERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COMMANDINDEXERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COMMANDENDBITERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COMMANDCRCERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COMMANDTIMEOUTERRORSTATUSENABLE</name>
              <description>Desc</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIXEDTO0</name>
              <description>The HC shall control error Interrupts using the Error Interrupt Status Enable register.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOOTTERMINATE</name>
              <description>Boot is terminated?</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOOTACKRCVENABLE</name>
              <description>Interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RETUNINGEVENTSTATUSENABLE</name>
              <description>Interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTCSTATUSENABLE</name>
              <description>If this bit is set to 0, the Host Controller shall clear the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_C and may set this bit again after all interrupt requests to INT_C pin are cleared to prevent inadvertent interrupts. Interrupt enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTBSTATUSENABLE</name>
              <description>If this bit is set to 0, the Host Controller shall clear the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_B and may set this bit again after all interrupt requests to INT_B pin are cleared to prevent inadvertent interrupts.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTASTATUSENABLE</name>
              <description>If this bit is set to 0, the Host Controller shall clear the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_A and may set this bit again after all interrupt requests to INT_A pin are cleared to prevent inadvertent interrupts.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CARDINTERRUPTSTATUSENABLE</name>
              <description>If this bit is set to 0, the HC shall clear Interrupt request to the System. The Card Interrupt detection is stopped when this bit is cleared and restarted when this bit is set to 1. The HD may clear the Card Interrupt Status Enable before servicing the Card Interrupt and may set this bit again after all Interrupt requests from the card are cleared to prevent inadvertent Interrupts.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CARDREMOVALSTATUSENABLE</name>
              <description>Description</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

