AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTTOCTRL</name>
          <description>Boot Data Timeout control</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BOOTDATATO</name>
              <description>This value determines the interval by which DAT line time-outs are detected during boot operation for eMMC card. The value is in number of sd clock.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VENDOR</name>
          <description>Vendor</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DLYDIS</name>
              <description>Chicken bit added to enable/disable the rtl fix made to delay the sampling of cmd_in and data_in.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the rtl fix made to delay the sampling of cmd_in and data_in</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the rtl fix made to delay the sampling of cmd_in and data_in</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATESDCLKEN</name>
              <description>If this bit is 0, SD_CLK to card will not be gated automatically, when there is no transfer. If this bit set to 1, SD_CLK to card will be gated automatically,when there is no transfer.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GATE</name>
                  <description>SD_CLK to card will be gated automatically when there is no transfer.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOGATE</name>
                  <description>SD_CLK to card will NOT be gated automatically when there is no transfer.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOTSTAT</name>
          <description>Slot interrupt status</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0A020000</resetValue>
          <resetMask>0xFFFF0001</resetMask>

          <fields>
            <field>
              <name>VENDORVER</name>
              <description>The Vendor Version Number is set to 0x10 (1.0)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPECVER</name>
              <description>The Host Controller Version Number is set to 0x02 (SD Host Specification Version 3.00).</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTSLOT0</name>
              <description>This status bit indicates the OR of Interrupt signal and Wakeup signal for slot</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKOUTCFG</name>
          <description>clkout configure</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>WIDEN</name>
              <description>narrow or widen the high portion</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W</name>
                  <description>widen</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N</name>
                  <description>narrow</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STEP</name>
              <description>tune step</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>disable clock duty cycle tuning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1STEP</name>
                  <description>clock duty cycle tuning with amount of 1 step</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2STEP</name>
                  <description>clock duty cycle tuning with amount of 2 steps</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3STEP</name>
                  <description>clock duty cycle tuning with amount of 3 steps</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4STEP</name>
                  <description>clock duty cycle tuning with amount of 4 steps</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5STEP</name>
                  <description>clock duty cycle tuning with amount of 5 steps</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6STEP</name>
                  <description>clock duty cycle tuning with amount of 6 steps</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7STEP</name>
                  <description>clock duty cycle tuning with amount of 7 steps</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8STEP</name>
                  <description>clock duty cycle tuning with amount of 8 steps</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9STEP</name>
                  <description>clock duty cycle tuning with amount of 9 steps</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10STEP</name>
                  <description>clock duty cycle tuning with amount of 10 steps</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11STEP</name>
                  <description>clock duty cycle tuning with amount of 11 steps</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12STEP</name>
                  <description>clock duty cycle tuning with amount of 12 steps</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13STEP</name>
                  <description>clock duty cycle tuning with amount of 13 steps</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14STEP</name>
                  <description>clock duty cycle tuning with amount of 14 steps</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15STEP</name>
                  <description>clock duty cycle tuning with amount of 15 steps</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
