AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1</name>
          <description>Key1</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>KEY1</name>
              <description>Bits [63:32] of the 128-bit key should be written to this register. To protect key values, the register always returns 0x00000000.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>KEY2</name>
          <description>Key2</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>KEY2</name>
              <description>Bits [95:64] of the 128-bit key should be written to this register. To protect key values, the register always returns 0x00000000.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>KEY3</name>
          <description>Key3</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>KEY3</name>
              <description>Bits [127:96] of the 128-bit key should be written to this register. To protect key values, the register always returns 0x00000000.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>SSC</name>
      <version>1.0</version>
      <description>System security control</description>
      <!-- <groupName>GROUP_SSC</groupName> -->
      <baseAddress>0x40025000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000008</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>SRLOCKS</name>
          <description>Security resource locks</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>LOCKSSRAMPROT</name>
              <description>Write 1 to disables writes to the SSRAMxPROT register from software, any master, or from any debug agent. Once set, it remains locked until the next system reset. Write 0 has no effect.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKSVTAIRCR</name>
              <description>Write 1 to disable writes to the following secure registers from software or from a debug agent that is connected to the processor: VTOR_S/AIRCR.PRIS/AIRCR.BFHFNMINS. Write 0 has no effect.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKNSVTOR</name>
              <description>Write 1 to disable writes to the VTOR_NS register. Write 0 has no effect.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKSMPU</name>
              <description>Write 1 to disable writes to registers that are associated with the Secure Memory Protection Unit (MPU) region from software or from a debug agent connected to the processor. Write 0 has no effect.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKNSMPU</name>
              <description>Write 1 to disable writes to registers that are associated with the Non-secure MPU region from software or from a debug agent connected to the processor.  Write 0 has no effect.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKSAU</name>
              <description>Write 1 to disable writes to registers that are associated with the SAU region from software or from a debug agent connected to the processor.  Write 0 has no effect.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKTCM</name>
              <description>Write 1 to disable writes to registers that are associated with the TCM region from software or from a debug agent connected to the processor.  Write 0 has no effect.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKITGU</name>
              <description>Write 1 to disable writes to registers that are associated with the ITCM interface security gating from software or from a debug agent connected to the processor.  Write 0 has no effect.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKDTGU</name>
              <description>Write 1 to disable writes to registers that are associated with the DTCM interface security gating from software or from a debug agent connected to the processor. Write 0 has no effect.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

