AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>LOCKPAHB</name>
              <description>Write 1 to disable writes to the PAHBCR register from software or from a debug agent connected to the processor. Write 0 has no effect.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCKDCAIC</name>
              <description>Write 1 to disable access to the instruction cache direct cache access registers DCAICLR and DCAICRR.  Write 0 has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SSLOCKS</name>
          <description>System Security locks</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>TCMALLSECDISABLE</name>
              <description>Write 1 to disables TCM all secure access override. Once set, it remains locked until the next system reset. Write 0 has no effect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>STIMER</name>
      <version>1.0</version>
      <description>Counter/Timer</description>
      <!-- <groupName>GROUP_STIMER</groupName> -->
      <baseAddress>0x40008800</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>STIMER_CMPR0</name>
        <description>STIMER_CMPR0_IRQ</description>
        <value>32</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR1</name>
        <description>STIMER_CMPR1_IRQ</description>
        <value>33</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR2</name>
        <description>STIMER_CMPR2_IRQ</description>
        <value>34</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR3</name>
        <description>STIMER_CMPR3_IRQ</description>
        <value>35</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR4</name>
        <description>STIMER_CMPR4_IRQ</description>
        <value>36</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR5</name>
        <description>STIMER_CMPR5_IRQ</description>
        <value>37</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR6</name>
        <description>STIMER_CMPR6_IRQ</description>
        <value>38</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR7</name>
        <description>STIMER_CMPR7_IRQ</description>
        <value>39</value>
      </interrupt>      <interrupt>
        <name>STIMER_OVF</name>
        <description>STIMER_OVF_IRQ</description>
        <value>40</value>
      </interrupt>
      <registers>
        <register>
          <name>STCFG</name>
          <description>The STIMER Configuration Register contains the software control for selecting the clock divider and source feeding the system timer.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xC000FF0F</resetMask>

          <fields>
            <field>
              <name>FREEZE</name>
              <description>Set this bit to one to freeze the clock input to the COUNTER register. Once frozen, the value can be safely written from the MCU. Unfreeze to resume.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THAW</name>
                  <description>Let the COUNTER register run on its input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Stop the COUNTER register for loading.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLEAR</name>
              <description>Set this bit to one to clear the System Timer register. If this bit is set to '1', the system timer register will stay cleared. It needs to be set to '0' for the system timer to start running.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Let the COUNTER register run on its input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Stop the COUNTER register for loading.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREHEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare H disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare H enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREGEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare G disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare G enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREFEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare F disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare F enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREEEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare E disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare E enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREDEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare D disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare D enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARECEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare C disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare C enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREBEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare B disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare B enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREAEN</name>
              <description>Selects whether compare is enabled for the corresponding SCMPR register. If compare is enabled, the interrupt status is set once the comparision is met.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Compare A disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Compare A enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Selects an appropriate clock source and divider to use for the System Timer clock.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLK</name>
                  <description>No clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_6MHZ</name>
                  <description>6MHz from the HFRC clock divider.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_375KHZ</name>
                  <description>375KHz from the HFRC clock divider.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_32KHZ</name>
                  <description>32768Hz from the crystal oscillator.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_16KHZ</name>
                  <description>16384Hz from the crystal oscillator.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_1KHZ</name>
                  <description>1024Hz from the crystal oscillator.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_1KHZ</name>
                  <description>Approximately 1KHz from the LFRC oscillator (uncalibrated).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0</name>
                  <description>Use CTIMER 0 for the clock source (allows prescaling from other system clocks).</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1</name>
                  <description>Use CTIMER 1 for the clock source (allows prescaling from other system clocks).</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STTMR</name>
          <description>The COUNTER Register contains the running count of time as maintained by incrementing for every rising clock edge of the clock source selected in the configuration register. It is this counter value that captured in the capture registers and it is this counter value that is compared against the various compare registers. This register cannot be written, but can be cleared to 0 for a deterministic value. Use the FREEZE bit will stop this counter from incrementing.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>STTMR</name>
              <description>Value of the 32-bit counter as it ticks over.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

