AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TMR21INT</name>
              <description>Counter/Timer 2 interrupt based on CMP1.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR20INT</name>
              <description>Counter/Timer 2 interrupt based on CMP0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR11INT</name>
              <description>Counter/Timer 1 interrupt based on CMP1.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR10INT</name>
              <description>Counter/Timer 1 interrupt based on CMP0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR01INT</name>
              <description>Counter/Timer 0 interrupt based on CMP1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR00INT</name>
              <description>Counter/Timer 0 interrupt based on CMP0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TMR151INT</name>
              <description>Counter/Timer 15 interrupt based on CMP1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR150INT</name>
              <description>Counter/Timer 15 interrupt based on CMP0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR141INT</name>
              <description>Counter/Timer 14 interrupt based on CMP1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR140INT</name>
              <description>Counter/Timer 14 interrupt based on CMP0.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR131INT</name>
              <description>Counter/Timer 13 interrupt based on CMP1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR130INT</name>
              <description>Counter/Timer 13 interrupt based on CMP0.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR121INT</name>
              <description>Counter/Timer 12 interrupt based on CMP1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR120INT</name>
              <description>Counter/Timer 12 interrupt based on CMP0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR111INT</name>
              <description>Counter/Timer 11 interrupt based on CMP1.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR110INT</name>
              <description>Counter/Timer 11 interrupt based on CMP0.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR101INT</name>
              <description>Counter/Timer 10 interrupt based on CMP1.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR100INT</name>
              <description>Counter/Timer 10 interrupt based on CMP0.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR91INT</name>
              <description>Counter/Timer 9 interrupt based on CMP1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR90INT</name>
              <description>Counter/Timer 9 interrupt based on CMP0.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR81INT</name>
              <description>Counter/Timer 8 interrupt based on CMP1.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR80INT</name>
              <description>Counter/Timer 8 interrupt based on CMP0.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR71INT</name>
              <description>Counter/Timer 7 interrupt based on CMP1.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

