AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TMR150INT</name>
              <description>Counter/Timer 15 interrupt based on CMP0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR141INT</name>
              <description>Counter/Timer 14 interrupt based on CMP1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR140INT</name>
              <description>Counter/Timer 14 interrupt based on CMP0.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR131INT</name>
              <description>Counter/Timer 13 interrupt based on CMP1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR130INT</name>
              <description>Counter/Timer 13 interrupt based on CMP0.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR121INT</name>
              <description>Counter/Timer 12 interrupt based on CMP1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR120INT</name>
              <description>Counter/Timer 12 interrupt based on CMP0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR111INT</name>
              <description>Counter/Timer 11 interrupt based on CMP1.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR110INT</name>
              <description>Counter/Timer 11 interrupt based on CMP0.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR101INT</name>
              <description>Counter/Timer 10 interrupt based on CMP1.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR100INT</name>
              <description>Counter/Timer 10 interrupt based on CMP0.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR91INT</name>
              <description>Counter/Timer 9 interrupt based on CMP1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR90INT</name>
              <description>Counter/Timer 9 interrupt based on CMP0.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR81INT</name>
              <description>Counter/Timer 8 interrupt based on CMP1.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR80INT</name>
              <description>Counter/Timer 8 interrupt based on CMP0.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR71INT</name>
              <description>Counter/Timer 7 interrupt based on CMP1.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR70INT</name>
              <description>Counter/Timer 7 interrupt based on CMP0.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR61INT</name>
              <description>Counter/Timer 6 interrupt based on CMP1.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR60INT</name>
              <description>Counter/Timer 6 interrupt based on CMP0.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR51INT</name>
              <description>Counter/Timer 5 interrupt based on CMP1.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR50INT</name>
              <description>Counter/Timer 5 interrupt based on CMP0.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR41INT</name>
              <description>Counter/Timer 4 interrupt based on CMP1.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR40INT</name>
              <description>Counter/Timer 4 interrupt based on CMP0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR31INT</name>
              <description>Counter/Timer 3 interrupt based on CMP1.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR30INT</name>
              <description>Counter/Timer 3 interrupt based on CMP0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

