AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
          <fields>
            <field>
              <name>OUTCFG183</name>
              <description>Counter/Timer or System Timer output selection for GPIO183.  Select an output of any timer to be output on this GPIO.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER00</name>
                  <description>Output is Timer 0, output 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER01</name>
                  <description>Output is Timer 0, output 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER10</name>
                  <description>Output is Timer 1, output 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER11</name>
                  <description>Output is Timer 1, output 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER20</name>
                  <description>Output is Timer 2, output 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER21</name>
                  <description>Output is Timer 2, output 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER30</name>
                  <description>Output is Timer 3, output 0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER31</name>
                  <description>Output is Timer 3, output 1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER40</name>
                  <description>Output is Timer 4, output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER41</name>
                  <description>Output is Timer 4, output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER50</name>
                  <description>Output is Timer 5, output 0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER51</name>
                  <description>Output is Timer 5, output 1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER60</name>
                  <description>Output is Timer 6, output 0</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER61</name>
                  <description>Output is Timer 6, output 1</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER70</name>
                  <description>Output is Timer 7, output 0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER71</name>
                  <description>Output is Timer 7, output 1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER80</name>
                  <description>Output is Timer 8, output 0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER81</name>
                  <description>Output is Timer 8, output 1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER90</name>
                  <description>Output is Timer 9, output 0</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER91</name>
                  <description>Output is Timer 9, output 1</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER100</name>
                  <description>Output is Timer 10, output 0</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER101</name>
                  <description>Output is Timer 10, output 1</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER110</name>
                  <description>Output is Timer 11, output 0</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER111</name>
                  <description>Output is Timer 11, output 1</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER120</name>
                  <description>Output is Timer 12, output 0</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER121</name>
                  <description>Output is Timer 12, output 1</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER130</name>
                  <description>Output is Timer 13, output 0</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER131</name>
                  <description>Output is Timer 13, output 1</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER140</name>
                  <description>Output is Timer 14, output 0</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER141</name>
                  <description>Output is Timer 14, output 1</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER150</name>
                  <description>Output is Timer 15, output 0</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER151</name>
                  <description>Output is Timer 15, output 1</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER0</name>
                  <description>Output is STimer 0</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER1</name>
                  <description>Output is STimer 1</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER2</name>
                  <description>Output is STimer 2</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER3</name>
                  <description>Output is STimer 3</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER4</name>
                  <description>Output is STimer 4</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER5</name>
                  <description>Output is STimer 5</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER6</name>
                  <description>Output is STimer 6</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER7</name>
                  <description>Output is STimer 7</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Output is disabled</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTCFG182</name>
              <description>Counter/Timer or System Timer output selection for GPIO182.  Select an output of any timer to be output on this GPIO.</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER00</name>
                  <description>Output is Timer 0, output 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER01</name>
                  <description>Output is Timer 0, output 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER10</name>
                  <description>Output is Timer 1, output 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER11</name>
                  <description>Output is Timer 1, output 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER20</name>
                  <description>Output is Timer 2, output 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER21</name>
                  <description>Output is Timer 2, output 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER30</name>
                  <description>Output is Timer 3, output 0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER31</name>
                  <description>Output is Timer 3, output 1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER40</name>
                  <description>Output is Timer 4, output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER41</name>
                  <description>Output is Timer 4, output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER50</name>
                  <description>Output is Timer 5, output 0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER51</name>
                  <description>Output is Timer 5, output 1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER60</name>
                  <description>Output is Timer 6, output 0</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER61</name>
                  <description>Output is Timer 6, output 1</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER70</name>
                  <description>Output is Timer 7, output 0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER71</name>
                  <description>Output is Timer 7, output 1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER80</name>
                  <description>Output is Timer 8, output 0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER81</name>
                  <description>Output is Timer 8, output 1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER90</name>
                  <description>Output is Timer 9, output 0</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER91</name>
                  <description>Output is Timer 9, output 1</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER100</name>
                  <description>Output is Timer 10, output 0</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER101</name>
                  <description>Output is Timer 10, output 1</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER110</name>
                  <description>Output is Timer 11, output 0</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER111</name>
                  <description>Output is Timer 11, output 1</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER120</name>
                  <description>Output is Timer 12, output 0</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER121</name>
                  <description>Output is Timer 12, output 1</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER130</name>
                  <description>Output is Timer 13, output 0</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER131</name>
                  <description>Output is Timer 13, output 1</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER140</name>
                  <description>Output is Timer 14, output 0</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER141</name>
                  <description>Output is Timer 14, output 1</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER150</name>
                  <description>Output is Timer 15, output 0</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER151</name>
                  <description>Output is Timer 15, output 1</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER0</name>
                  <description>Output is STimer 0</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER1</name>
                  <description>Output is STimer 1</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER2</name>
                  <description>Output is STimer 2</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER3</name>
                  <description>Output is STimer 3</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER4</name>
                  <description>Output is STimer 4</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER5</name>
                  <description>Output is STimer 5</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER6</name>
                  <description>Output is STimer 6</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER7</name>
                  <description>Output is STimer 7</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Output is disabled</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTCFG181</name>
              <description>Counter/Timer or System Timer output selection for GPIO181.  Select an output of any timer to be output on this GPIO.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER00</name>
                  <description>Output is Timer 0, output 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER01</name>
                  <description>Output is Timer 0, output 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER10</name>
                  <description>Output is Timer 1, output 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER11</name>
                  <description>Output is Timer 1, output 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER20</name>
                  <description>Output is Timer 2, output 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER21</name>
                  <description>Output is Timer 2, output 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER30</name>
                  <description>Output is Timer 3, output 0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER31</name>
                  <description>Output is Timer 3, output 1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER40</name>
                  <description>Output is Timer 4, output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER41</name>
                  <description>Output is Timer 4, output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER50</name>
                  <description>Output is Timer 5, output 0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER51</name>
                  <description>Output is Timer 5, output 1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER60</name>
                  <description>Output is Timer 6, output 0</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER61</name>
                  <description>Output is Timer 6, output 1</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER70</name>
                  <description>Output is Timer 7, output 0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER71</name>
                  <description>Output is Timer 7, output 1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER80</name>
                  <description>Output is Timer 8, output 0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER81</name>
                  <description>Output is Timer 8, output 1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER90</name>
                  <description>Output is Timer 9, output 0</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER91</name>
                  <description>Output is Timer 9, output 1</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER100</name>
                  <description>Output is Timer 10, output 0</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER101</name>
                  <description>Output is Timer 10, output 1</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER110</name>
                  <description>Output is Timer 11, output 0</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER111</name>
                  <description>Output is Timer 11, output 1</description>
                  <value>23</value>
                </enumeratedValue>
