AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>TMR7CMP0</name>
          <description>This contains the Compare limits for timer 7. This is the primary comparator that can be used to mark the END of a timer cycle (and thus restart the timer for repeat modes)</description>
          <addressOffset>0x000002E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TMR7CMP0</name>
              <description>Counter/Timer 7 End Compare Register. For MEASURE mode indicates the high phase sample count.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TMR7CMP1</name>
          <description>This comparator is used as a secondary compare count for modes that generate pulses. For MEASURE mode indicates the low phase sample count.</description>
          <addressOffset>0x000002EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TMR7CMP1</name>
              <description>Holds the secondary comparator that can be used to generate a PWM or generate secondary pulses. CMP0 should ALWAYS be used first.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MODE7</name>
          <description>The mode register contains optional mode controls for the timer</description>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FF00</resetMask>

          <fields>
            <field>
              <name>TMR7TRIGSEL</name>
              <description>Counter/Timer 7 Trigger Source Selection</description>
              <bitRange>[16:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR00</name>
                  <description>Trigger source is TIMER 0 Output 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR01</name>
                  <description>Trigger source is TIMER 0 Output 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR10</name>
                  <description>Trigger source is TIMER 1 Output 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR11</name>
                  <description>Trigger source is TIMER 1 Output 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR20</name>
                  <description>Trigger source is TIMER 2 Output 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR21</name>
                  <description>Trigger source is TIMER 2 Output 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR30</name>
                  <description>Trigger source is TIMER 3 Output 0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR31</name>
                  <description>Trigger source is TIMER 3 Output 1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR40</name>
                  <description>Trigger source is TIMER 4 Output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR41</name>
                  <description>Trigger source is TIMER 4 Output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR50</name>
                  <description>Trigger source is TIMER 5 Output 0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR51</name>
                  <description>Trigger source is TIMER 5 Output 1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR60</name>
                  <description>Trigger source is TIMER 6 Output 0</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR61</name>
                  <description>Trigger source is TIMER 6 Output 1</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR70</name>
                  <description>Trigger source is TIMER 7 Output 0</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR71</name>
                  <description>Trigger source is TIMER 7 Output 1</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR80</name>
                  <description>Trigger source is TIMER 8 Output 0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR81</name>
                  <description>Trigger source is TIMER 8 Output 1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR90</name>
                  <description>Trigger source is TIMER 9 Output 0</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR91</name>
                  <description>Trigger source is TIMER 9 Output 1</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR100</name>
                  <description>Trigger source is TIMER 10 Output 0</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR101</name>
                  <description>Trigger source is TIMER 10 Output 1</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR110</name>
                  <description>Trigger source is TIMER 11 Output 0</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR111</name>
                  <description>Trigger source is TIMER 11 Output 1</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR120</name>
                  <description>Trigger source is TIMER 12 Output 0</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR121</name>
                  <description>Trigger source is TIMER 12 Output 1</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR130</name>
                  <description>Trigger source is TIMER 13 Output 0</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR131</name>
                  <description>Trigger source is TIMER 13 Output 1</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR140</name>
                  <description>Trigger source is TIMER 14 Output 0</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR141</name>
                  <description>Trigger source is TIMER 14 Output 1</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR150</name>
                  <description>Trigger source is TIMER 15 Output 0</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR151</name>
                  <description>Trigger source is TIMER 15 Output 1</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP00</name>
                  <description>Trigger source is STIMER Compare 0</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP10</name>
                  <description>Trigger source is STIMER Compare 1</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP20</name>
                  <description>Trigger source is STIMER Compare 2</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP30</name>
                  <description>Trigger source is STIMER Compare 3</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP40</name>
                  <description>Trigger source is STIMER Compare 4</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP50</name>
                  <description>Trigger source is STIMER Compare 5</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP60</name>
                  <description>Trigger source is STIMER Compare 6</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCMP70</name>
                  <description>Trigger source is STIMER Compare 7</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCAP00</name>
                  <description>Trigger source is STIMER Capture 0</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCAP10</name>
                  <description>Trigger source is STIMER Capture 1</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCAP20</name>
                  <description>Trigger source is STIMER Capture 2</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STMRCAP30</name>
                  <description>Trigger source is STIMER Capture 3</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO0</name>
                  <description>Trigger source is GPIO #0</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOn</name>
                  <description>GPIO #n is trigger source where n ranges from 0-223. The values for GPIO0 - GPIO223 are in the range 0x100 - 0x1DF, i.e. GPIO0 + n.</description>
                  <value>257</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO223</name>
                  <description>Trigger source is GPIO #223 (b)</description>
                  <value>479</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR7LMTVAL</name>
          <description>This is an internal counter in the hardware that counts down from TMR_LMT to 1</description>
          <addressOffset>0x000002F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>TMR7LMTVAL</name>
              <description>Counter/Timer 7 Limit Readback</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

