AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL9</name>
          <description>This includes the Control bit fields for timer 9.</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF07FFFF</resetMask>

          <fields>
            <field>
              <name>TMR9LMT</name>
              <description>This field decides the number of iterations of Counter/Timer 9. For Single/Repeat Patterns, it indicates number of bits to be shifted out and so, max value is 63.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR9TMODE</name>
              <description>Counter/Timer 9 Trigger Mode</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Trigger not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Trigger on rising edge of TRIGSEL source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Trigger on falling edge of TRIGSEL source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Trigger on either edge of TRIGSEL source</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9CLK</name>
              <description>Counter/Timer 9 Clock Select. Note: Any GPIO can be used as a clock source.</description>
              <bitRange>[16:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Clock source is the HFRC / 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Clock source is HFRC / 16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV64</name>
                  <description>Clock source is HFRC / 64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>Clock source is HFRC / 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV1024</name>
                  <description>Clock source is HFRC / 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4K</name>
                  <description>Clock source is HFRC / 4096</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>Clock source is LFRC</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2</name>
                  <description>Clock source is LFRC / 2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32</name>
                  <description>Clock source is LFRC / 32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV1K</name>
                  <description>Clock source is LFRC / 1024</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT</name>
                  <description>Clock source is the XT (uncalibrated).</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2</name>
                  <description>Clock source is XT / 2</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV4</name>
                  <description>Clock source is XT / 4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8</name>
                  <description>Clock source is XT / 8</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV16</name>
                  <description>Clock source is XT / 16</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV32</name>
                  <description>Clock source is XT / 32</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV128</name>
                  <description>Clock source is XT / 128</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_100HZ</name>
                  <description>Clock source is 100 Hz from the current RTC oscillator.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_512Hz</name>
                  <description>Clock source is XT / 64</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz_DIV8</name>
                  <description>HFRC2_16MHz</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz_DIV16</name>
                  <description>HFRC2_8MHz</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz_DIV32</name>
                  <description>HFRC2_4MHz</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz_DIV64</name>
                  <description>HFRC2_2MHz</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz_DIV128</name>
                  <description>HFRC2_1MHz</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_125MHz_DIV256</name>
                  <description>HFRC2_512KHz</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS</name>
                  <description>HF XTAL 32MHz</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS_DIV2</name>
                  <description>HF XTAL 16MHz</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_HS_DIV4</name>
                  <description>HF XTAL 8MHz</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKC</name>
                  <description>Clock source is Buck VDDC TON pulses.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKF</name>
                  <description>Clock source is Buck VDDF TON pulses.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKS</name>
                  <description>Clock source is Buck VDDS TON pulses.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKC_LV</name>
                  <description>Clock source is Buck VDDC_LV TON pulses.</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR00</name>
                  <description>Clock source is TIMER 0 Output 0</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR01</name>
                  <description>Clock source is TIMER 0 Output 1</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR10</name>
                  <description>Clock source is TIMER 1 Output 0</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR11</name>
                  <description>Clock source is TIMER 1 Output 1</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR20</name>
                  <description>Clock source is TIMER 2 Output 0</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR21</name>
                  <description>Clock source is TIMER 2 Output 1</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR30</name>
                  <description>Clock source is TIMER 3 Output 0</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR31</name>
                  <description>Clock source is TIMER 3 Output 1</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR40</name>
                  <description>Clock source is TIMER 4 Output 0</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR41</name>
                  <description>Clock source is TIMER 4 Output 1</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR50</name>
                  <description>Clock source is TIMER 5 Output 0</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR51</name>
                  <description>Clock source is TIMER 5 Output 1</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR60</name>
                  <description>Clock source is TIMER 6 Output 0</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR61</name>
                  <description>Clock source is TIMER 6 Output 1</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR70</name>
                  <description>Clock source is TIMER 7 Output 0</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR71</name>
                  <description>Clock source is TIMER 7 Output 1</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR80</name>
                  <description>Clock source is TIMER 8 Output 0</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR81</name>
                  <description>Clock source is TIMER 8 Output 1</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR90</name>
                  <description>Clock source is TIMER 9 Output 0</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR91</name>
                  <description>Clock source is TIMER 9 Output 1</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR100</name>
                  <description>Clock source is TIMER 10 Output 0</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR101</name>
                  <description>Clock source is TIMER 10 Output 1</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR110</name>
                  <description>Clock source is TIMER 11 Output 0</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR111</name>
                  <description>Clock source is TIMER 11 Output 1</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR120</name>
                  <description>Clock source is TIMER 12 Output 0</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR121</name>
                  <description>Clock source is TIMER 12 Output 1</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR130</name>
                  <description>Clock source is TIMER 13 Output 0</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR131</name>
                  <description>Clock source is TIMER 13 Output 1</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR140</name>
                  <description>Clock source is TIMER 14 Output 0</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR141</name>
                  <description>Clock source is TIMER 14 Output 1</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR150</name>
                  <description>Clock source is TIMER 15 Output 0</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR151</name>
                  <description>Clock source is TIMER 15 Output 1</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO0</name>
                  <description>GPIO #0 is clock source.</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOn</name>
                  <description>GPIO #n is clock source where n ranges from 0-223. The values for GPIO0 - GPIO223 are in the range 0x100 - 0x1DF, i.e. GPIO0 + n.</description>
                  <value>257</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO223</name>
                  <description>GPIO #223 is clock source.</description>
                  <value>479</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9FN</name>
              <description>Counter/Timer 9 Function Select. For all Functions, CMP0 marks the end of timer cycle, and thus restarts the timer.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>This Mode generates a single edge on OUT0/OUT1 when TIMER value hits CMP0/CMP1 respectively. OUT[0]=0, counter increments to CMP0, OUT[0]=1, counter stops. OUT[1] follows CMP1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPCOUNT</name>
                  <description>This mode is run up counter generating a pulse on CMP. OUT[0]/OUT[1] is pulsed for one source clock period when TIMER matches CMP0/CMP1 respectively. Timer repeats for TMR_LMT iterations.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM</name>
                  <description>PWM mode. OUT0 and OUT1 are waveforms, and not just one clock pulse. CMP1 dictates the low phase of the output and CMP0 dictates the period. OUT[1]=~OUT[0].</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPATTERN</name>
                  <description>Single pattern. OUT0=CMP0[TIMER], OUT1=CMP1[TIMER]. LMT field specifies length of pattern. When LMT GT 32 OUT0 and OUT1 is the same 64-bit pattern consisting of concatenated CMP1,CMP0. When LMT LT 32 OUT0 and OUT1 are independent. Both OUT0 and OUT1 can be inverted individually applications with POL0/POL1 = 0x1.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATPATTERN</name>
                  <description>Repeated pattern. Like SINGLEPATTERN mode, but pattern repeats after reaching LMT.</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9POL1</name>
              <description>Counter/Timer 9 output 1 polarity.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The polarity of the TMR9OUT1 pin is the same as the timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>The polarity of the TMR9OUT1 pin is the inverse of the timer output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9POL0</name>
              <description>Counter/Timer 9 output 0 polarity.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The polarity of the TMR9OUT0 pin is the same as the timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>The polarity of the TMR9OUT0 pin is the inverse of the timer output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9CLR</name>
              <description>Counter/Timer Clear bit.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>When written to a 1, the timer will automatically be cleared to its reset state # (0 for count up counter, CMP0 for down counter)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value set to 0. Timer works normally.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9EN</name>
              <description>Counter/Timer 9 Enable bit.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter/Timer 9 Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter/Timer 9 Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER9</name>
          <description>This register holds the running time or event count for timer 9.</description>
          <addressOffset>0x00000324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TIMER9</name>
              <description>Counter/Timer 9</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

