AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DMACPRIS</name>
              <description>This bit holds the DMA complete interrupt status.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OERIS</name>
              <description>This bit holds the overrun interrupt status. Returns the raw interrupt state of the UARTOEINTR interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BERIS</name>
              <description>This bit holds the break error interrupt status. Returns the raw interrupt state of the UARTBEINTR interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PERIS</name>
              <description>This bit holds the parity error interrupt status. Returns the raw interrupt state of the UARTPEINTR interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FERIS</name>
              <description>This bit holds the framing error interrupt status. Returns the raw interrupt state of the UARTFEINTR interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTRIS</name>
              <description>This bit holds the receive timeout interrupt status. Returns the raw interrupt state of the UARTRTINTR interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRIS</name>
              <description>This bit holds the transmit interrupt status. Returns the raw interrupt state of the UARTTXINTR interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXRIS</name>
              <description>This bit holds the receive interrupt status. Returns the raw interrupt state of the UARTRXINTR interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMRIS</name>
              <description>This bit holds the nUARTDSR modem interrupt status. Returns the raw interrupt state of the UARTDSRINTR interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMRIS</name>
              <description>This bit holds the nUARTDCD modem interrupt status. Returns the raw interrupt state of the UARTDCDINTR interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMRIS</name>
              <description>This bit holds the nUARTCTS modem interrupt status. Returns the raw interrupt state of the UARTCTSINTR interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMRIS</name>
              <description>This bit holds the modem TXCMP interrupt status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Masked Interrupt Status</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>DMAEMIS</name>
              <description>This bit holds the DMA error interrupt status masked.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPMIS</name>
              <description>This bit holds the DMA complete interrupt status masked.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEMIS</name>
              <description>This bit holds the overrun interrupt status masked. Returns the masked interrupt state of the UARTOEINTR interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BEMIS</name>
              <description>This bit holds the break error interrupt status masked. Returns the masked interrupt state of the UARTBEINTR interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEMIS</name>
              <description>This bit holds the parity error interrupt status masked. Returns the masked interrupt state of the UARTPEINTR interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEMIS</name>
              <description>This bit holds the framing error interrupt status masked. Returns the masked interrupt state of the UARTFEINTR interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTMIS</name>
              <description>This bit holds the receive timeout interrupt status masked. Returns the masked interrupt state of the UARTRTINTR interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

