AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TXMIS</name>
              <description>This bit holds the transmit interrupt status masked. Returns the masked interrupt state of the UARTTXINTR interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXMIS</name>
              <description>This bit holds the receive interrupt status masked. Returns the masked interrupt state of the UARTRXINTR interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMMIS</name>
              <description>This bit holds the nUARTDSR modem masked interrupt status. Returns the masked interrupt state of the UARTDSRINTR interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMMIS</name>
              <description>This bit holds the nUARTDCD modem masked interrupt status. Returns the masked interrupt state of the UARTDCDINTR interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMMIS</name>
              <description>This bit holds the nUARTCTS modem masked interrupt status. Returns the masked interrupt state of the UARTCTSINTR interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMMIS</name>
              <description>This bit holds the modem TXCMP interrupt status masked.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEC</name>
          <description>Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>DMAEIC</name>
              <description>This bit holds the DMA error interrupt clear.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPIC</name>
              <description>This bit holds the DMA complete interrupt clear.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEIC</name>
              <description>This bit holds the overrun interrupt clear. Clears the UARTOEINTR interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BEIC</name>
              <description>This bit holds the break error interrupt clear. Clears the UARTBEINTR interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEIC</name>
              <description>This bit holds the parity error interrupt clear. Clears the UARTPEINTR interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEIC</name>
              <description>This bit holds the framing error interrupt clear. Clears the UARTFEINTR interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTIC</name>
              <description>This bit holds the receive timeout interrupt clear. Clears the UARTRTINTR interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXIC</name>
              <description>This bit holds the transmit interrupt clear. Clears the UARTTXINTR interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXIC</name>
              <description>This bit holds the receive interrupt clear. Clears the UARTRXINTR interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMIC</name>
              <description>This bit holds the nUARTDSR modem interrupt clear. Clears the UARTDSRINTR interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMIC</name>
              <description>This bit holds the nUARTDCD modem interrupt clear. Clears the UARTDCDINTR interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMIC</name>
              <description>This bit holds the nUARTCTS modem interrupt clear. Clears the UARTCTSINTR interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMIC</name>
              <description>This bit holds the modem TXCMP interrupt clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>DMA Control</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000B</resetMask>

          <fields>
            <field>
              <name>DMAPRI</name>
              <description>This is DMA priority indicator.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD</name>
              <description>This bitfield is reserved for future use.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

