AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>TXDMAE</name>
              <description>Enable DMA Function when Uart transmit. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDMAE</name>
              <description>Enable DMA Function when Uart Receive. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TARGADDR</name>
          <description>DMA target address</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TARGADDR</name>
              <description>Bits [31:0] of the target byte address for source of DMA (either read or write). The address can be any byte alignment, and does not have to be word aligned. In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <description>Contains the number of bytes to be transferred for this DMA transaction.</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>TOTCOUNT</name>
              <description>Total Transfer Count in bytes.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <baseAddress>0x4003A000</baseAddress>
      <interrupt>
        <name>UART1</name>
        <description>UART1_IRQ</description>
        <value>16</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <baseAddress>0x4003B000</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2_IRQ</description>
        <value>17</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <baseAddress>0x4003C000</baseAddress>
      <interrupt>
        <name>UART3</name>
        <description>UART3_IRQ</description>
        <value>18</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>USBPHY</name>
      <version>1.0</version>
      <description>USBPHY device register descriptions.</description>
      <!-- <groupName>GROUP_USBPHY</groupName> -->
      <baseAddress>0x400B4000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000088</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>REG00</name>
          <description>Register description here</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF75</name>
              <description>Manually set the Rx Clock phase select. These bits will tune the HS RX path sample timing between digital and analog inside PHY: 3'b000 represents the earliest phase 3'b111 represents the latest phase The delay associated with each step is 256ps</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF43</name>
              <description>BG observation enable signal. Active low. When enabled, vref 400mV can be observed through USB0PP/USB0PN</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF20</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG04</name>
          <description>Register description here</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF76</name>
              <description>disconnect detector bias current tuning</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF55</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF43</name>
              <description>Squelch detector bias current tuning,  2'b00 represents the minimum bias current 2'b11 represents the maximum bias current</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF20</name>
              <description>Manually set the Tx Clock phase select. These bits will tune the HS TX path sample timing between digital and analog inside PHY 3'b000 represents the earliest phase 3'b111 represents the latest phase The delay associated with each step is 256ps</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

