AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>BF20</name>
              <description>Rx enable delay select. 3'b000: 4 clocks (480Mhz clock) 3'b001: 5 clocks  3'b010: 6 clocks  3'b011: 7 clocks  3'b100: 8 clocks  3'b101: 9 clocks  3'b110: 10 clocks  3'b111: 12 clocks</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG24</name>
          <description>Register description here</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF71</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>it0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG28</name>
          <description>Register description here</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG2C</name>
          <description>Register description here</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF75</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF44</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF33</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF22</name>
              <description>HS keep alive enable. 1'b1: HS keep alive enable 1'b0: HS keep alive disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF11</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>All port z bypass value. 1'b1: bypass enable 1'b0:bypass disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG30</name>
          <description>Register description here</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG34</name>
          <description>Register description here</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>FIXME (description needed).</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG38</name>
          <description>Register description here</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG3C</name>
          <description>Register description here</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF75</name>
              <description>Host disconnect filter select. 3'b100:6 clocks(480M clock) 3'b101:8 clocks 3'b111:disconnect disable Other: invalid</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

