AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DPktBufDis</name>
              <description>Double Packet Buffer Disable. This bit is used to control the use of Double Packet Buffering. It is ignored when Dynamic FIFO sizing is enabled. Clearing this bit does NOT necessarily enable Double Packet Buffering but rather allows Double Packet Buffering to be determined by the Endpoint's IDX2_INFIFOSZ setting and MAXPAYLOAD size relationship. Default is enabled.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_DPB</name>
                  <description>Clear to allow Double Packet Buffering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_DPB</name>
                  <description>Set to disable Double Packet Buffering regardless of the End Point FIFO size and MAXPAYLOAD size relationship.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D0</name>
              <description>Unused, always return 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IncompTxServiceSetupEnd</name>
              <description>Incomplete Transmission / Service Setup End. When CFG3_ENDPOINT is 1 to 5, this bit serves as the IncompTx field. When CFG3_ENDPOINT is 0, this bit serves as the ServiceSetupEnd field.If CFG3_ENDPOINT is 0x1-0x5, then this bit serves as the IncompTx field. If the endpoint is being used for high-bandwidth Isochronous transfers, this bit is set to indicate when a large packet has been split into 2 or 3 packets for transmission but insufficient IN tokens have been received to send all the parts. The remainder of the current packet is then flushed from the FIFO (but any second packet in the FIFO will remain). Note: In anything other than a high bandwidth Isochronous transfer, this bit will always return 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOP</name>
                  <description>This value is a NOP.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_SETUPEND</name>
                  <description>Set to clear the SetupEnd bit. This bit is cleared automatically.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClrDataTogServicedOutPktRdy</name>
              <description>Clear Data Toggle / Serviced OUT Packet Ready. When CFG3_ENDPOINT is 1 to 5, this bit serves as the ClrDataTog field. When CFG3_ENDPOINT is 0, this bit serves as the ServicedOutPktReady field.If CFG3_ENDPOINT is 0x1-0x5, this bit serves as the ClrDataTog field. Setting this bit resets the endpoint IN data toggle to 0.If CFG3_ENDPOINT is 0x0, this bit serves as the ServicedOutPktReady field. The CPU writes a 1 to this bit to clear the OutPktRdy bit. This bit is cleared automatically.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SentStallSendStall</name>
              <description>Sent Stall / Send Stall. When CFG3_ENDPOINT is 1 to 5, this bit serves as the SentStall field. When CFG3_ENDPOINT is 0, this bit serves as the SendStall function.If CFG3_ENDPOINT is 0x1-0x5, this bit serves as the SentStall field. It is set when a STALL handshake is transmitted. The FIFO is flushed and the InPktRdy bit is cleared. The CPU should clear this bit.If CFG3_ENDPOINT is 0x0, this bit serves as the SendStall field. The CPU sets this bit to terminate the current transaction. The STALL handshake will be transmitted and then this bit will be cleared automatically. Note: This behavior differs from that of the SendStall bits associated with additional IN/OUT endpoints, which need to be cleared by the CPU.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SendStallSetupEnd</name>
              <description>When CFG3_ENDPOINT is 1 to 5, this bit serves as the SendStall field. When CFG3_ENDPOINT is 0, this bit serves as the SetupEnd field.If CFG3_ENDPOINT is 0x1-0x5, this bit serves as the SendStall field. Setting this bit issues a STALL handshake to an IN token. The CPU clears this bit to terminate the stall condition.Note: This bit has no effect when the endpoint is being used for Isochronous transfers.If CFG3_ENDPOINT is 0x0, this bit serves as the SetupEnd field. It is set when a control transaction ends before the DataEnd bit has been set. An interrupt will be generated and the FIFO flushed at this time. The bit is cleared by the CPU writing a 1 to the ServicedSetupEnd bit.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FlushFIFODataEnd</name>
              <description>When CFG3_ENDPOINT is 1 to 5, this bit serves as the FlushFIFO field. When CFG3_ENDPOINT is 0, this bit serves as the DataEnd bit.If CFG3_ENDPOINT is 0x1-0x5, this bit serves as the FlushFIFO field. Setting this bit flushes the next packet to be transmitted from the endpoint IN FIFO. The FIFO pointer is reset and the InPktRdy bit is cleared. May be set simultaneously with InPktRdy to abort the packet that has just been loaded into the FIFO.Note 1: FlushFIFO should only be set when InPktRdy is set (at other times, it may cause data corruption).Note 2: If the FIFO contains two packets, FlushFIFO may need to be set twice to completely clear the FIFO.If CFG3_ENDPOINT is 0x0, this bit serves as the DataEnd bit. Set this bit when (1) setting InPktRdy for the last data packet, (2) clearing OutPktRdy after unloading the last data packet, or (3) setting InPktRdy for a zero length data packet.It is cleared automatically.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

