AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>DisNye</name>
              <description>Disable NYET Handshakes / PID Error. For Bulk/Interrupt transactions, this bit disable the sending of NYET handshakes. For Bulk/Interrupt transactions, indicates PID errors.If IDX1_ISO is 0x1, this field is read-only and, when set, indicates a PID error in the received packet for Isochronous transfers.If IDX1_ISO is 0x0, this field disables NYET Handshakes for Bulk/Interrupt transactions. Set this bit to disable the sending of NYET handshakes. When set, all successfully received OUT packets are ACK'd including at the point at which the FIFO becomes full.Note: This bit has an effect only in High-speed mode, when it should be set for all Interrupt endpoints.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAReqMode</name>
              <description>Two modes of DMA Request operation are supported: Set to 0 for DMA Request Mode 0 in which a DMA request is generated for all received packets; set to 1 for DMA Request Mode 1 in which a DMA request (but no interrupt) is generated for OUT packets of size MAXPAYLOAD bytes and an interrupt (but no DMA request) is generated for OUT packets of any other size.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPktBufDis</name>
              <description>Double Packet Buffer Disable. This bit is used to control the use of Double Packet Buffering. It is ignored when Dynamic FIFO sizing is enabled. Clearing this bit does NOT necessarily enable Double Packet Buffering but rather allows Double Packet Buffering to be determined by the Endpoint's IDX2_OUTFIFOSZ setting and MAXPAYLOAD size relationship. Default is enabled.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_DPB</name>
                  <description>Clear to allow Double Packet Buffering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_DPB</name>
                  <description>Set to disable Double Packet Buffering regardless of the End Point FIFO size and MAXPAYLOAD size relationship.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IncompRx</name>
              <description>Incomplete Receive. This bit is set in a high-bandwidth Isochronous transfer if the packet in the OUT FIFO is incomplete because parts of the data were not received. It is cleared when OutPktRdy is cleared. Note: In anything other than a high-bandwidth Isochronous transfer, this bit will always return 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ClrDataTog</name>
              <description>Clear Data Toggle. Set this bit to reset the endpoint data toggle to 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SentStall</name>
              <description>Sent Stall. This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SendStall</name>
              <description>Send Stall. Issues a STALL handshake to a DATA packet.If IDX1_ISO is 0x1, this bit has no effect when the endpoint is being used for Isochronous transfers.If IDX1_ISO is 0x0, this field enables Stall Handshakes for Bulk/Interrupt transactions. Set this bit to issue a STALL handshake to a DATA packet. Clear this bit to terminate the stall condition.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FlushFIFO</name>
              <description>Flush FIFO. Set this bit to flush the next packet to be read from the endpoint OUT FIFO. The FIFO pointer is reset and the OutPktRdy bit is cleared. FlushFIFO should only be used when OutPktRdy is set. At other times, it may cause data to be corrupted. If the FIFO is double-buffered, FlushFIFO may need to be set twice to completely clear the FIFO.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DataError</name>
              <description>Data Error. Indicates a CRC error.If IDX1_ISO is 0x1 (ISO mode), this bit is set at the same time that OutPktRdy is set if the data packet has a CRC error. It is cleared when OutPktRdy is cleared.If IDX1_ISO is 0x0 (Bulk mode), this field always returns zero. This field is only valid when the endpoint is operating in ISO mode.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OverRun</name>
              <description>Overrun Condition. Indicates an overrun.If IDX1_ISO is 0x1 (ISO mode), this bit is set if an OUT packet arrives while FIFOFull is set, i.e., the OUT packet cannot be loaded into the OUT FIFO. The CPU should clear this bit.If IDX1_ISO is 0x0 (Bulk mode), this field always returns zero. This field is only valid when the endpoint is operating in ISO mode.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOFull</name>
              <description>FIFO Full. When set, this bit indicates that no more packets can be loaded into the OUT FIFO.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

