AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>INFIFOADD</name>
              <description>Sets the start address of the selected IN endpoint FIFO.</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <description>Endpoint 0 FIFO register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO1</name>
          <description>Endpoint 1 FIFO register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO2</name>
          <description>Endpoint 2 FIFO register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 2.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO3</name>
          <description>Endpoint 3 FIFO register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 3.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO4</name>
          <description>Endpoint 4 FIFO register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 4.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO5</name>
          <description>Endpoint 5 FIFO register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 5.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HWVERS</name>
          <description>Read-only register that returns version number (xx.yyy) of the core hardware.</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>RC</name>
              <description>Unused</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>xx</name>
              <description>Major Version Number (Range 0 - 31).</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>yyy</name>
              <description>Minor Version Number (Range 0 - 999).</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INFO</name>
          <description>Contains read-only info of the number of IN and OUT endpoints included in the design, width of the RAM, the ability to reset the USB Controller via software, a soft reset bit for the CLK clock domain and a soft reset bit for the XCLK clock domain.</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0303FFFF</resetMask>

          <fields>
            <field>
              <name>EDMAIN</name>
              <description>DMA_REQ deassert for all IN endpoints.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEASSERT_MAXPAYLOAD</name>
                  <description>DMA_REQ signal for all IN Endpoints will be de-asserted when MAXPAYLOAD bytes have been written to an endpoint.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEASSERT_MAXPAYLOADMINUS8</name>
                  <description>DMA_REQ signal for all IN Endpoints will be de-asserted when MAXPAYLOAD-8 bytes have been written to an endpoint.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDMAOUT</name>
              <description>DMA_REQ deassert for all OUT Endpoints.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEASSERT_MAXPAYLOAD</name>
                  <description>DMA_REQ signal for all OUT Endpoints will be de-asserted when MAXPAYLOAD bytes have been read to an endpoint. When 1 byte early.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEASSERT_MAXPAYLOADMINUS8</name>
                  <description>DMA_REQ signal for all OUT Endpoints will be de-asserted when MAXPAYLOAD-8 bytes have been read to an endpoint. When 1 byte early.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTXS</name>
              <description>Soft reset for the XCLK domain. will cause the output signal NRSTXO to be asserted low. This bit is self-clearing. For reset to actually occur, the output NRSTXO must be connected to the input NRSTX.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

