AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>RSTS</name>
              <description>Soft reset for the CLK domain. cause the output signal NRSTO to be asserted low. This bit is self-clearing. For reset to actually occur, the output NRSTO must be connected to the input NRST.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAChains</name>
              <description>Provides the number of implemented DMA channels.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RamBits</name>
              <description>Provides the width of the RAM address bus.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OutEndPoints</name>
              <description>Provides the number of implemented OUT Endpoints.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>InEndPoints</name>
              <description>Provides the number of implemented IN Endpoints.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT1</name>
          <description>Holds the configurable chirp timeout value.</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00004074</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTUCH</name>
              <description>Configurable Chirp Timeout timer; default value of 0x4074 corresponds to a delay of 1.1ms (60Mhz clock cycles * 4 * 0x4074).</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT2</name>
          <description>Holds the configurable delay from the end of High Speed resume signal to enable UTM normal operating mode.</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000032</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTHRSTN</name>
              <description>Configurable delay from the end of High Speed resume signaling to enabling UTM normal operating mode. Default value of 0x32 corresponds to a delay of 3us. This programmed delay is equivalent to the number of 60MHz clock cycles * 4.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Provides optional control for turning off the interface clocks to USB Controller and PHY as well as the reference clock to the USB PHY.</description>
          <addressOffset>0x00002000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07010101</resetMask>

          <fields>
            <field>
              <name>PHYREFCLKSEL</name>
              <description>USB PHY reference clock select. The reference clock frequency needs to be 24MHz.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>48MHz HFRC. Internally will divide by 2 before using it as USB PHY reference clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_31MHz</name>
                  <description>31MHz HFRC2. Internally will divide by 2 before using it as USB PHY reference clock. This is only for engineering purpose, as it does not meet the 24MHz frequency requirement.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_24MHz</name>
                  <description>24MHz HFRC based reference clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFCLK</name>
                  <description>External reference clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTREFCLK_DIV2</name>
                  <description>External reference clock divide by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALHS</name>
                  <description>XTAL clock as reference clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALHS_DIV2</name>
                  <description>XTAL clock divide by 2 as reference clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Static 0</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYAPBLCLKDIS</name>
              <description>Setting this bit turns off PHY control logic clock.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

