AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>CTRLAPBCLKDIS</name>
              <description>Setting this bit turns off the Controller logic clock.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PHYREFCLKDIS</name>
              <description>Setting this bit turns off the PHY reference clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>Provides optional SRAM tuning control.</description>
          <addressOffset>0x00002004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x00007FFF</resetMask>

          <fields>
            <field>
              <name>STOV</name>
              <description>SRAM self-timed override</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WABL</name>
              <description>SRAM write assist enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WABLM</name>
              <description>SRAM No margin adjustment</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RAWL</name>
              <description>SRAM Read assist enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RAWLM</name>
              <description>SRAM Adjustment for margin for this read assist scheme</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCDLY</name>
                  <description>Increased margin adjustment, increased delay for enabling write assist.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBINCDLY</name>
                  <description>Minimum boost level with increased delay for enabling write assist.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMNB</name>
                  <description>Increased margin adjustment with more negative boost.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMNB</name>
                  <description>Minimum margin adjustment with lowest negative boost level.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAW</name>
              <description>Extra margin adjustment for write operations</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMAS</name>
              <description>Extra margin adjustment sense amplifier pulse</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMA</name>
              <description>Extra margin adjustment</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RET1N</name>
              <description>Retention mode 1 enable, active-LOW</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>UTMISTICKYSTATUS</name>
          <description>This read only register provides the results from the PHY OBS port controlled by reg 0x20[5:4]. IF any bits are set, the bits are sticky. Clear this register using the OBSCLRSTAT register.</description>
          <addressOffset>0x00002014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OBSPORTSTICKY</name>
              <description>These bits are read only status bits from the PHY OBS port</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBS3</name>
                  <description>bit 1:HS BIST results, bit 0:FS BIST results</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBS2</name>
                  <description>bit 1: ODT calibration state, bit 0: Current calibration state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBS1</name>
                  <description>bit 1: Rx squelch signal, bit 0: Rx datap</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBS0</name>
                  <description>bit 1: PLL lock signal, bit 0: Host Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OBSCLRSTAT</name>
          <description>Clears all bits in the sticky obs status register.</description>
          <addressOffset>0x00002018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CLRSTAT</name>
              <description>Writing a 1 to this bit clears all bits in the UTMISTICKYSTATUS register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

