AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DPDMPULLDOWN</name>
          <description>Enables a pulldown resistor(15K) on D+ or D-</description>
          <addressOffset>0x0000201C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DPPULLDOWN</name>
              <description>Enables a pulldown resistor(15K) on D+</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMPULLDOWN</name>
              <description>Enables a pulldown resistor(15K) on D-</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BCDETSTATUS</name>
          <description>USB Battery Charge Detenction Registers</description>
          <addressOffset>0x00002020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000037</resetMask>

          <fields>
            <field>
              <name>DMCOMPOUT</name>
              <description>DM comparator output</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPCOMPOUT</name>
              <description>DP comparator output</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCPDETECTED</name>
              <description>Dedicated charging port detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPDETECTED</name>
              <description>Charging port detected</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPATTACHED</name>
              <description>Data pin attachment detected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BCDETCRTL1</name>
          <description>Battery Charging detection main control register</description>
          <addressOffset>0x00002024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x80000BFF</resetMask>

          <fields>
            <field>
              <name>USBSWRESET</name>
              <description>Holds a USB controller and PHY in the reset for BC detection</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBDCOMPEN</name>
              <description>Enables DP/DM vendor-specific detection comparator</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBDCOMPREF</name>
              <description>Sets DP/DM vendor-specific comparator ref voltage</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1P25V</name>
                  <description>1.25V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P35</name>
                  <description>2.35V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P10V</name>
                  <description>3.10V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P65</name>
                  <description>1.65V (VCCIO/2)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDPSINKEN</name>
              <description>Enables DP current sink</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDMSRCEN</name>
              <description>Enables DM voltage source</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RDMPDWNEN</name>
              <description>Enables DM BC 1.2 pull-down resistor</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDPSRCEN</name>
              <description>Enables DP voltage source</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IDPSRCEN</name>
              <description>Enables DP current source</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IDMSINKEN</name>
              <description>Enables DM current sink</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BCWEAKPULLDOWNEN</name>
              <description>Enables weak sink current on DP and DM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

