AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>BCWEAKPULLUPEN</name>
              <description>Enables weak source current to DP and DM</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BCDETCRTL2</name>
          <description>Battery Charging auxillary detection control register</description>
          <addressOffset>0x00002028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000500</resetValue>
          <resetMask>0x00000F0F</resetMask>

          <fields>
            <field>
              <name>BCWEAKPULLDOWNTUNE</name>
              <description>Weak sink resistor to both DP and DM tuning. Trimmable.</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BCWEAKPULLUPTUNE</name>
              <description>Weak source resistor to both DP and DM tuning. Trimmable.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEDCPDET</name>
              <description>Force output dedicated charging port detected</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCECPDET</name>
              <description>Force output charging port detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEDPATTACHED</name>
              <description>Force output dp_attached</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CHARGEDETBYP</name>
              <description>BC detection bypass</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACTRL</name>
          <description>DMA Control</description>
          <addressOffset>0x0000202C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF003F</resetMask>

          <fields>
            <field>
              <name>TOTCOUNT</name>
              <description>total transfer count in bytes</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAPRI</name>
              <description>USB DMA priority</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMADIR</name>
              <description>USB DMA direction</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAEP</name>
              <description>USB DMA endpoint selection</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAEN</name>
              <description>enable USB DMA</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDR</name>
          <description>USB DMA Target Address</description>
          <addressOffset>0x00002030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TARGADDR</name>
              <description>Target byte address for source of DMA (either read or write). In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMAINTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00002034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACMP</name>
              <description>DMA Complete Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMAINTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00002038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACMP</name>
              <description>DMA Complete Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

