AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
            <field>
              <name>ADMAERR2</name>
              <description>ADMA Error for USB DMA request line 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR1</name>
              <description>ADMA Error for USB DMA request line 1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR0</name>
              <description>ADMA Error for USB DMA request line 0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAERRINTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00002074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>ADMAERR9</name>
              <description>ADMA Error for USB DMA request line 9 Interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR8</name>
              <description>ADMA Error for USB DMA request line 8 Interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR7</name>
              <description>ADMA Error for USB DMA request line 7 Interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR6</name>
              <description>ADMA Error for USB DMA request line 6 Interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR5</name>
              <description>ADMA Error for USB DMA request line 5 Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR4</name>
              <description>ADMA Error for USB DMA request line 4 Interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR3</name>
              <description>ADMA Error for USB DMA request line 3 Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR2</name>
              <description>ADMA Error for USB DMA request line 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR1</name>
              <description>ADMA Error for USB DMA request line 1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR0</name>
              <description>ADMA Error for USB DMA request line 0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAERRINTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00002078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>ADMAERR9</name>
              <description>ADMA Error for USB DMA request line 9 Interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR8</name>
              <description>ADMA Error for USB DMA request line 8 Interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR7</name>
              <description>ADMA Error for USB DMA request line 7 Interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR6</name>
              <description>ADMA Error for USB DMA request line 6 Interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR5</name>
              <description>ADMA Error for USB DMA request line 5 Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR4</name>
              <description>ADMA Error for USB DMA request line 4 Interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR3</name>
              <description>ADMA Error for USB DMA request line 3 Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADMAERR2</name>
              <description>ADMA Error for USB DMA request line 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

