AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ADMATOTCOUNT4</name>
          <description>Auto DMA Enable Register</description>
          <addressOffset>0x00002110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATOTCOUNT4</name>
              <description>Auto DMA Total Count for USB DMA request line 4</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATOTCOUNT5</name>
          <description>Auto DMA Enable Register</description>
          <addressOffset>0x00002114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATOTCOUNT5</name>
              <description>Auto DMA Total Count for USB DMA request line 5</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATOTCOUNT6</name>
          <description>Auto DMA Enable Register</description>
          <addressOffset>0x00002118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATOTCOUNT6</name>
              <description>Auto DMA Total Count for USB DMA request line 6</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATOTCOUNT7</name>
          <description>Auto DMA Enable Register</description>
          <addressOffset>0x0000211C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATOTCOUNT7</name>
              <description>Auto DMA Total Count for USB DMA request line 7</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATOTCOUNT8</name>
          <description>Auto DMA Enable Register</description>
          <addressOffset>0x00002120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATOTCOUNT8</name>
              <description>Auto DMA Total Count for USB DMA request line 8</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATOTCOUNT9</name>
          <description>Auto DMA Enable Register</description>
          <addressOffset>0x00002124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATOTCOUNT9</name>
              <description>Auto DMA Total Count for USB DMA request line 9</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR0</name>
          <description>Auto DMA Target Address 0</description>
          <addressOffset>0x00002200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR0</name>
              <description>Auto DMA Target Address for USB DMA request line 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR1</name>
          <description>Auto DMA Target Address 1</description>
          <addressOffset>0x00002204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR1</name>
              <description>Auto DMA Target Address for USB DMA request line 1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR2</name>
          <description>Auto DMA Target Address 2</description>
          <addressOffset>0x00002208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR2</name>
              <description>Auto DMA Target Address for USB DMA request line 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR3</name>
          <description>Auto DMA Target Address 3</description>
          <addressOffset>0x0000220C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR3</name>
              <description>Auto DMA Target Address for USB DMA request line 3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

