AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR4</name>
          <description>Auto DMA Target Address 4</description>
          <addressOffset>0x00002210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR4</name>
              <description>Auto DMA Target Address for USB DMA request line 4</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR5</name>
          <description>Auto DMA Target Address 5</description>
          <addressOffset>0x00002214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR5</name>
              <description>Auto DMA Target Address for USB DMA request line 5</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR6</name>
          <description>Auto DMA Target Address 6</description>
          <addressOffset>0x00002218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR6</name>
              <description>Auto DMA Target Address for USB DMA request line 6</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR7</name>
          <description>Auto DMA Target Address 7</description>
          <addressOffset>0x0000221C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR7</name>
              <description>Auto DMA Target Address for USB DMA request line 7</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR8</name>
          <description>Auto DMA Target Address 8</description>
          <addressOffset>0x00002220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR8</name>
              <description>Auto DMA Target Address for USB DMA request line 8</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMATARGADDR9</name>
          <description>Auto DMA Target Address 9</description>
          <addressOffset>0x00002224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADMATARGADDR9</name>
              <description>Auto DMA Target Address for USB DMA request line 9</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP0</name>
          <description>Auto DMA EP Number 0</description>
          <addressOffset>0x00002300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP0</name>
              <description>Auto DMA EP Number for USB DMA request line 0</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP1</name>
          <description>Auto DMA EP Number 1</description>
          <addressOffset>0x00002304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP1</name>
              <description>Auto DMA EP Number for USB DMA request line 1</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP2</name>
          <description>Auto DMA EP Number 2</description>
          <addressOffset>0x00002308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP2</name>
              <description>Auto DMA EP Number for USB DMA request line 2</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP3</name>
          <description>Auto DMA EP Number 3</description>
          <addressOffset>0x0000230C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP3</name>
              <description>Auto DMA EP Number for USB DMA request line 3</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

