AmbiqAI/heartkit-vitals-demo/pack/svd/apollo5b.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP4</name>
          <description>Auto DMA EP Number 4</description>
          <addressOffset>0x00002310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP4</name>
              <description>Auto DMA EP Number for USB DMA request line 4</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP5</name>
          <description>Auto DMA EP Number 5</description>
          <addressOffset>0x00002314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP5</name>
              <description>Auto DMA EP Number for USB DMA request line 5</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP6</name>
          <description>Auto DMA EP Number 6</description>
          <addressOffset>0x00002318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP6</name>
              <description>Auto DMA EP Number for USB DMA request line 6</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP7</name>
          <description>Auto DMA EP Number 7</description>
          <addressOffset>0x0000231C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP7</name>
              <description>Auto DMA EP Number for USB DMA request line 7</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP8</name>
          <description>Auto DMA EP Number 8</description>
          <addressOffset>0x00002320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP8</name>
              <description>Auto DMA EP Number for USB DMA request line 8</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAEP9</name>
          <description>Auto DMA EP Number 9</description>
          <addressOffset>0x00002324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMAEP9</name>
              <description>Auto DMA EP Number for USB DMA request line 9</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAREQSIZE0</name>
          <description>Auto DMA Request Size 0</description>
          <addressOffset>0x00002400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>ADMAREQSIZE0</name>
              <description>Auto DMA Request Size for USB DMA request line 0</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAREQSIZE1</name>
          <description>Auto DMA Request Size 1</description>
          <addressOffset>0x00002404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>ADMAREQSIZE1</name>
              <description>Auto DMA Request Size for USB DMA request line 1</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAREQSIZE2</name>
          <description>Auto DMA Request Size 2</description>
          <addressOffset>0x00002408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>ADMAREQSIZE2</name>
              <description>Auto DMA Request Size for USB DMA request line 2</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADMAREQSIZE3</name>
          <description>Auto DMA Request Size 3</description>
          <addressOffset>0x0000240C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>ADMAREQSIZE3</name>
              <description>Auto DMA Request Size for USB DMA request line 3</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

